[
    {
        "question": "Which city has an inception date earlier than 1584 and a population of 276960.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0200-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"276960.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the film published on 2005-11-16 in Germany and had a box office of 8.96911e+08?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the foundation with an IPv4 routing prefix of 91.198.174.0/24 and an Alexa rank of 29145.0 established?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> foundation . ?e <IPv4 routing prefix> ?pv_1 . ?pv_1 <pred:value> \"91.198.174.0/24\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4 routing prefix> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"2007-10-02\"^^xsd:date . ?e <Alexa rank> ?pv . ?pv <pred:value> \"29145.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISO 4217 code for the currency whose price was 1.4746 on 2015-12-31?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> currency . ?e <price> ?pv_1 . ?pv_1 <pred:value> \"1.4746\" . [ <pred:fact_h> ?e ; <pred:fact_r> <price> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2015-12-31\"^^xsd:date . ?e <ISO 4217 code> ?pv . ?pv <pred:value> \"GBP\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ITIS TSN of the taxon named Cichlidae, which was published in 1835?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> taxon . ?e <taxon name> ?pv_1 . ?pv_1 <pred:value> \"Cichlidae\" . [ <pred:fact_h> ?e ; <pred:fact_r> <taxon name> ; <pred:fact_t> ?pv_1 ] <year of taxon name publication> ?qpv . ?qpv <pred:date> \"1835-01-01\"^^xsd:date . ?e <ITIS TSN> ?pv . ?pv <pred:value> \"169770\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of the metropolis with a population of 1.64952e+06 on January 1st, 2011?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"1.64952e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--71428\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the film with an exploitation visa number of 114028, which started on 2005-11-17 and has a box office of 8.96911e+08, belong to the film category?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <exploitation visa number> ?pv_1 . ?pv_1 <pred:value> \"114028\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation visa number> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"2005-11-17\"^^xsd:date . ?e <box office> ?pv . ?pv <pred:value> \"8.96911e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the human with a ranking of 1.0 on 2008-08-18 have a doubles record of 131-72?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <ranking> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2008-08-18\"^^xsd:date . ?e <doubles record> ?pv . ?pv <pred:value> \"13172\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the airline with a market capitalization of 2.29e+10 on 2019-01-24?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <market capitalization> ?pv_1 . ?pv_1 <pred:value> \"2.29e+10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <market capitalization> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2019-01-24\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9950 5471\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the manifestation with an Alexa rank of 112.0 on 2017-11-20 and a Pinterest username of nytimes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Pinterest username> ?pv . ?pv <pred:value> \"nytimes\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which democracy has an INSEE countries and foreign territories code of 99302 and a license plate code of LB that started on 1967-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <licence plate code> ?pv_1 . ?pv_1 <pred:value> \"LB\" . [ <pred:fact_h> ?e ; <pred:fact_r> <licence plate code> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1967-01-01\"^^xsd:date . ?e <INSEE countries and foreign territories code> ?pv . ?pv <pred:value> \"99302\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country calling code for the country with NUTS code UKM (whose start time is 1999-01-01)?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <NUTS code> ?pv_1 . ?pv_1 <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS code> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1999-01-01\"^^xsd:date . ?e <country calling code> ?pv . ?pv <pred:value> \"+44\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between San Jose (the one with Dewey Decimal Classification of 2--79474) and Yekaterinburg (the one whose inception date is 1723-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"San Jose\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--79474\" . ?e_2 <pred:name> Yekaterinburg . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1723-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Tehran (the one with Dewey Decimal Classification of 2--5525) and Kinshasa (the one whose inception date is 1881-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tehran\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--5525\" . ?e_2 <pred:name> Kinshasa . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1881-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Paul Gross (whose name in native language is also Paul Gross) and Kiel (whose inception date is 1201-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paul Gross\" . ?e_1 <name in native language> ?pv . ?pv <pred:value> \"Paul Gross\" . ?e_2 <pred:name> Kiel . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1201-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between California State Polytechnic University, Pomona (the one with ISNI 0000 0001 2234 9391) and Pomona (the one whose inception date is 1888-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"California State Polytechnic University, Pomona\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2234 9391\" . ?e_2 <pred:name> Pomona . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1888-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Canal+ (the one with Giphy username canalplus) and Vivendi (whose inception date is 1987-12-18)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Canal+\" . ?e_1 <Giphy username> ?pv . ?pv <pred:value> \"canalplus\" . ?e_2 <pred:name> Vivendi . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1987-12-18\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Harare (the one with Dewey Decimal Classification of 2--6891) and Rhodesia (the one that was dissolved, abolished or demolished on 1979-06-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harare\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6891\" . ?e_2 <pred:name> Rhodesia . ?e_2 <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1979-06-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Babylon 5 (the one whose duration is 44.0) and Crusade (the one that ended on 1999-09-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Babylon 5\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"44.0\" . ?e_2 <pred:name> Crusade . ?e_2 <end time> ?pv_1 . ?pv_1 <pred:date> \"1999-09-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Angelina Jolie (the one whose CANTIC-ID is a10919934) and the movie Changeling (which was published on 2009-01-22)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Angelina Jolie\" . ?e_1 <CANTIC-ID> ?pv . ?pv <pred:value> \"a10919934\" . ?e_2 <pred:name> Changeling . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-22\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kettering (the one with OS grid reference SP8778) and Kettering (the one whose inception date is 1974-04-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kettering\" . ?e_1 <OS grid reference> ?pv . ?pv <pred:value> \"SP8778\" . ?e_2 <pred:name> Kettering . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Mohanlal (the one with Instagram username actormohanlalofficial) and Kochi (the one whose inception date is 1958-04-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mohanlal\" . ?e_1 <Instagram username> ?pv . ?pv <pred:value> \"actormohanlalofficial\" . ?e_2 <pred:name> Kochi . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1958-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the attendance of Cinderella (the one with a title of Cinderella) and what is the fact pertaining to it?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Cinderella . ?e_1 <title> ?pv . ?pv <pred:value> \"Cinderella\" . ?e_2 <pred:name> Cinderella . ?e_2 <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.35985e+06\"^^xsd:double . ?e_1 <derivative work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative work> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the CIVICUS Monitor country entry for Germany and what is the population of Germany (the one that is related to the CIVICUS Monitor country entry) and what is the fact h for the relationship between Germany and the country with the same name?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Germany . ?e_1 <CIVICUS Monitor country entry> ?pv . ?pv <pred:value> \"germany\" . ?e_2 <pred:name> Germany . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.2315e+07\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What does \"2--415\" apply to in Ireland (the one with a population of 2.83605e+06)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Ireland . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--415\" . ?e_2 <pred:name> Ireland . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.83605e+06\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <applies to part> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Eritrea and what is the Human Development Index of Eritrea (which is 0.381) according to the same source? Also, what is the predicate of the fact connecting Eritrea to its country?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Eritrea . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--635\" . ?e_2 <pred:name> Eritrea . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.381\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Guinea and what is the Human Development Index of Guinea? Also, what is the fact h pertaining to the relationship between these two pieces of information?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Guinea . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6652\" . ?e_2 <pred:name> Guinea . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.411\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the local dialing code for Richmond, which has a population of 21469 and is named after another place called Richmond?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Richmond . ?e_1 <local dialing code> ?pv . ?pv <pred:value> \"832\" . ?e_2 <pred:name> Richmond . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"21469.0\"^^xsd:double . ?e_1 <named after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named after> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the administrative territorial entity that Guildford (the one whose native label is Guildford) is located in and what is its population?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Guildford . ?e_1 <native label> ?pv . ?pv <pred:value> \"Guildford\" . ?e_2 <pred:name> Guildford . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"146100.0\"^^xsd:double . ?e_1 <located in the administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in the administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the administrative body twinned with Salisbury (the one with a local dialing code of 01722) and has a population of 30343.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Salisbury . ?e_1 <local dialing code> ?pv . ?pv <pred:value> \"01722\" . ?e_2 <pred:name> Salisbury . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"30343.0\"^^xsd:double . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the reason that Bethlehem (the one with a population of 74982.0) is named after Bethlehem (the one with a population of 27000.0)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Bethlehem . ?e_1 <population> ?pv . ?pv <pred:value> \"74982.0\" . ?e_2 <pred:name> Bethlehem . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"27000.0\"^^xsd:double . ?e_1 <named after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named after> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index of Iran and what is the connection between two entities with the same name and the same Human Development Index?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Iran . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.766\"^^xsd:double . ?e_2 <pred:name> Iran . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.766\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the difference in Human Development Index between Mauritius as a country and Mauritius as a human?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Mauritius . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.674\"^^xsd:double . ?e_2 <pred:name> Mauritius . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.762\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index for Benin and what is the fact that connects them?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Benin . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.344\"^^xsd:double . ?e_2 <pred:name> Benin . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.344\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the difference in population between two places named Sheffield, where one has a population of 518090.0 and the other has a population of 569700.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Sheffield . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"518090.0\"^^xsd:double . ?e_2 <pred:name> Sheffield . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"569700.0\"^^xsd:double . ?e_1 <different from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different from> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the difference in Human Development Index between Nepal and the country it is a part of?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Nepal . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.531\"^^xsd:double . ?e_2 <pred:name> Nepal . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.384\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index and population of India, and what is the fact pertaining to these two pieces of information?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> India . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.496\"^^xsd:double . ?e_2 <pred:name> India . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"7.47986e+08\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index and total fertility rate of Singapore, which is also the capital of itself?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Singapore . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.841\"^^xsd:double . ?e_2 <pred:name> Singapore . ?e_2 <total fertility rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.22\"^^xsd:double . ?e_1 <capital of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital of> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the narrative location of Dallas (the one with 40.0 episodes and a population of 1.19782e+06)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Dallas . ?e_1 <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"40.0\"^^xsd:double . ?e_2 <pred:name> Dallas . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.19782e+06\"^^xsd:double . ?e_1 <narrative location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative location> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]