[{"question": "When did Mauritius become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mauritius\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6982\" . ?e_2 <pred:name> \"Mauritius\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-03-12\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the ship with IMO ship number 5059953 named after Canberra (the one whose inception date is 0250-03-12)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Canberra\" . ?e_1 <IMO_ship_number> ?pv . ?pv <pred:value> \"5059953\" . ?e_2 <pred:name> \"Canberra\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"0250-03-12\"^^xsd:date . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Russia become a country according to the CIVICUS Monitor country entry with a value of \"russia\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Russia\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"russia\" . ?e_2 <pred:name> \"Russia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1917-10-25\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Bhutan become a country and what is the demonym for Bhutan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bhutan\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"bhutaner\" . ?e_2 <pred:name> \"Bhutan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1907-12-17\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Pittsburgh and when was it founded?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pittsburgh\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Pittsburgh\" . ?e_2 <pred:name> \"Pittsburgh\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1758-11-27\"^^xsd:date . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Italy become a country according to the CIVICUS Monitor country entry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Italy\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"italy\" . ?e_2 <pred:name> \"Italy\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-06-02\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the title \"Arizona\" given to the filming location Arizona?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Arizona\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Arizona\" . ?e_2 <pred:name> \"Arizona\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-02-14\"^^xsd:date . ?e_1 <filming_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <filming_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Kettering (the one with WOEID 24861) start being located in the administrative territorial entity Kettering?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kettering\" . ?e_1 <WOEID> ?pv . ?pv <pred:value> \"24861\" . ?e_2 <pred:name> \"Kettering\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Chad become a country with the ISO 3166-1 numeric code 148?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chad\" . ?e_1 <ISO_3166-1_numeric_code> ?pv . ?pv <pred:value> \"148\" . ?e_2 <pred:name> \"Chad\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-08-11\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Bangladesh (the one with ISNI 0000 0001 2188 6953) become a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bangladesh\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2188 6953\" . ?e_2 <pred:name> \"Bangladesh\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-03-26\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username for the TV show Fargo (based on the movie Fargo released on 1996-11-14)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Fargo\" . ?e_1 <Twitter_username> ?pv . ?pv <pred:value> \"FargoFX\" . ?e_2 <pred:name> \"Fargo\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1996-11-14\"^^xsd:date . ?e_1 <based_on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based_on> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the IRC channel irc://irc.ircnet.net/python.fi created for the programming language Python?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Python\" . ?e_1 <IRC_channel> ?pv . ?pv <pred:value> \"irc://irc.ircnet.net/python.fi\" . ?e_2 <pred:name> \"Python\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-02-20\"^^xsd:date . ?e_1 <programming_language> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <programming_language> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Suriname become a country and what is its country calling code?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Suriname\" . ?e_1 <country_calling_code> ?pv . ?pv <pred:value> \"+597\" . ?e_2 <pred:name> \"Suriname\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-11-25\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Odessa (the one with the official website http://www.odessa-tx.gov/) named after Odessa (the one with an inception date of 1794-09-02)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Odessa\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.odessa-tx.gov/\" . ?e_2 <pred:name> \"Odessa\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1794-09-02\"^^xsd:date . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Portugal become a country according to the CIVICUS Monitor country entry with a value of \"portugal\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Portugal\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"portugal\" . ?e_2 <pred:name> \"Portugal\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1143-10-05\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Liberia become a country with an ISO 3166-1 alpha-3 code of LBR?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Liberia\" . ?e_1 <ISO_3166-1_alpha-3_code> ?pv . ?pv <pred:value> \"LBR\" . ?e_2 <pred:name> \"Liberia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-07\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Mozambique become a British Museum person-institution with the value of 179887?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mozambique\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"179887\" . ?e_2 <pred:name> \"Mozambique\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-06-25\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Virginia (the one whose title is also Virginia) and when did it come into existence?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Virginia\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Virginia\" . ?e_2 <pred:name> \"Virginia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-06-25\"^^xsd:date . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the derivative work of Zodiac (the one published on 2007-03-02)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Zodiac\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Zodiac\" . ?e_2 <pred:name> \"Zodiac\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-03-02\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Gibraltar become the capital of Gibraltar (the one whose demonym is Gibraltare\u00f1a)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gibraltar\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"Gibraltare\u00f1a\" . ?e_2 <pred:name> \"Gibraltar\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1704-01-01\"^^xsd:date . ?e_1 <capital_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital_of> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Austria become a country according to the CIVICUS Monitor country entry with the value \"austria\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Austria\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"austria\" . ?e_2 <pred:name> \"Austria\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-11-12\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Rotherham (the one with a local dialing code of 01709) become located in the administrative territorial entity Rotherham?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Rotherham\" . ?e_1 <local_dialing_code> ?pv . ?pv <pred:value> \"01709\" . ?e_2 <pred:name> \"Rotherham\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the movie \"Traffic\" (the one with ISNI 0000 0001 1544 3179) that is different from the movie \"Traffic\" released on 2001-03-09?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Traffic\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1544 3179\" . ?e_2 <pred:name> \"Traffic\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2001-03-09\"^^xsd:date . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Moldova become a country with a Dewey Decimal Classification of 2--476?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Moldova\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--476\" . ?e_2 <pred:name> \"Moldova\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-27\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Havok (the one with the official website http://www.havok.com/) developed?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Havok\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.havok.com/\" . ?e_2 <pred:name> \"Havok\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1998-01-01\"^^xsd:date . ?e_1 <developer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <developer> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in native language of Michelangelo (the one born on 1475-03-06) who is named after Michelangelo?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Michelangelo\" . ?e_1 <name_in_native_language> ?pv . ?pv <pred:value> \"Michelangelo\" . ?e_2 <pred:name> \"Michelangelo\" . ?e_2 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1475-03-06\"^^xsd:date . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Prussia (whose demonym is Preusse) cease to exist as a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Prussia\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"Preusse\" . ?e_2 <pred:name> \"Prussia\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1947-02-25\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Vietnam become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Vietnam\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--597\" . ?e_2 <pred:name> \"Vietnam\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1945-09-02\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Mexico become a country according to the CIVICUS Monitor country entry with the value \"mexico\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mexico\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"mexico\" . ?e_2 <pred:name> \"Mexico\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1810-09-16\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Maldives become a country and what is its country calling code?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Maldives\" . ?e_1 <country_calling_code> ?pv . ?pv <pred:value> \"+960\" . ?e_2 <pred:name> \"Maldives\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1965-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the British Museum person-institution with a value of 167069 start being associated with Belarus?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Belarus\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"167069\" . ?e_2 <pred:name> \"Belarus\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-25\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Bahrain become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bahrain\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5365\" . ?e_2 <pred:name> \"Bahrain\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-08-14\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Cameroon become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6711\" . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Jamaica (the one with Dewey Decimal Classification 2--7292) become a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jamaica\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--7292\" . ?e_2 <pred:name> \"Jamaica\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Mongolia become a country with Dewey Decimal Classification of 2--517?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mongolia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--517\" . ?e_2 <pred:name> \"Mongolia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1911-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Saxony follow Saxony (the one with Dewey Decimal Classification 2--4321) and was dissolved, abolished, or demolished on 1952-07-25?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Saxony\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4321\" . ?e_2 <pred:name> \"Saxony\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1952-07-25\"^^xsd:date . ?e_1 <follows> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <follows> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Georgia (the one whose inception date is 1788-01-02) and is different from another entity?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Georgia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4758\" . ?e_2 <pred:name> \"Georgia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-01-02\"^^xsd:date . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Taiwan become a country according to the CIVICUS Monitor country entry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Taiwan\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"taiwan\" . ?e_2 <pred:name> \"Taiwan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Latvia become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Latvia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4796\" . ?e_2 <pred:name> \"Latvia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-11-18\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Guinea (the one with Dewey Decimal Classification 2--6652) become a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Guinea\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6652\" . ?e_2 <pred:name> \"Guinea\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1958-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Japan become a country according to the CIVICUS Monitor country entry with a value of \"japan\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Japan\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"japan\" . ?e_2 <pred:name> \"Japan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-05-03\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Afghanistan become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Afghanistan\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--581\" . ?e_2 <pred:name> \"Afghanistan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1747-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Moldavia (the one with the short name Moldova) dissolved, abolished, or demolished?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Moldavia\" . ?e_1 <short_name> ?pv . ?pv <pred:value> \"Moldova\" . ?e_2 <pred:name> \"Moldavia\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1859-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the filming location Atlanta have the title Atlanta?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Atlanta\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Atlanta\" . ?e_2 <pred:name> \"Atlanta\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1845-12-29\"^^xsd:date . ?e_1 <filming_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <filming_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the derivative work of Superman (the one with British Museum person-institution ID 169934)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Superman\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"169934\" . ?e_2 <pred:name> \"Superman\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1979-02-19\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the demonym of Bohemia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bohemia\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"boeme\" . ?e_2 <pred:name> \"Bohemia\" . ?e_2 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1979-10-15\"^^xsd:date . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Guyana become a country and what is its Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Guyana\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--881\" . ?e_2 <pred:name> \"Guyana\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Ecuador become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ecuador\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--866\" . ?e_2 <pred:name> \"Ecuador\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1811-10-11\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the game Robots (with Nintendo_GameID GZQE7D) that is based on the movie Robots?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Robots\" . ?e_1 <Nintendo_GameID> ?pv . ?pv <pred:value> \"GZQE7D\" . ?e_2 <pred:name> \"Robots\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-03-10\"^^xsd:date . ?e_1 <based_on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based_on> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the derivative work of Contact (the one with a publication date of 1997-07-11)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Contact\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Contact\" . ?e_2 <pred:name> \"Contact\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1997-07-11\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the band Chicago form at the location whose official website is http://www.chicagotheband.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chicago\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.chicagotheband.com\" . ?e_2 <pred:name> \"Chicago\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1833-08-12\"^^xsd:date . ?e_1 <location_of_formation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <location_of_formation> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]