[
    {
        "question": "What is the connection between the Saxony-Anhalt whose area is 24576.0 and the Saxony-Anhalt whose inception date is 1990-10-03?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Saxony-Anhalt . ?e_1 <area> ?pv . ?pv <pred:value> \"24576.0\" . ?e_2 <pred:name> Saxony-Anhalt . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-10-03\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Bangladesh (the one with Dewey Decimal Classification of 2--5492) and Bangladesh (the one whose inception date is 1971-03-26)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Bangladesh . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--5492\" . ?e_2 <pred:name> Bangladesh . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-03-26\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Joseon, one with a McCune-Reischauer romanization of Chosn and the other with an inception date of 1392-08-05?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Joseon . ?e_1 <McCune-Reischauer romanization> ?pv . ?pv <pred:value> \"Chosn\" . ?e_2 <pred:name> Joseon . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1392-08-05\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Panama (the one with Dewey Decimal Classification of 2--7287) and Panama (the one whose inception date is 1903-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Panama . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--7287\" . ?e_2 <pred:name> Panama . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1903-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Bremen (the one with Dewey Decimal Classification of 2--4352) and Bremen (the one with an inception date of 1646-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Bremen . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--4352\" . ?e_2 <pred:name> Bremen . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1646-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Pakistan (the one with Dewey Decimal Classification of 2--5491) and Pakistan (the one whose inception date is 1947-08-14)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Pakistan . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--5491\" . ?e_2 <pred:name> Pakistan . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-08-14\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Jamaica (the one with an area of 11190.0) and Jamaica (the one whose inception date is 1962-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Jamaica . ?e_1 <area> ?pv . ?pv <pred:value> \"11190.0\" . ?e_2 <pred:name> Jamaica . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the city Atlanta (the one with an inception date of 1845-12-29) and the TV show Atlanta (the one with 21 episodes)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Atlanta . ?e_1 <number of episodes> ?pv . ?pv <pred:value> \"21.0\" . ?e_2 <pred:name> Atlanta . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1845-12-29\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is http://www.guitarherogame.com/gh3/ the official website of an entertainment entity?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.guitarherogame.com/gh3/\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.guitarherogame.com/gh3/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the disease have a minimal incubation period in humans of 7.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> disease . ?e <minimal incubation period in humans> ?pv_1 . ?pv_1 <pred:value> \"7.0\" . ?e <minimal incubation period in humans> ?pv . ?pv <pred:value> \"7.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the height of the superhero equal to 1.85?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> superhero . ?e <height> ?pv_1 . ?pv_1 <pred:value> \"1.85\" . ?e <height> ?pv . ?pv <pred:value> \"1.85\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a drum with a Hornbostel-Sachs classification of 211.261.1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> drum . ?e <Hornbostel-Sachs classification> ?pv_1 . ?pv_1 <pred:value> \"211.261.1\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"211.261.1\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is http://www.tridelta.org the official website for a sorority?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> sorority . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tridelta.org\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.tridelta.org\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the crematory with National Heritage List for England number 1001575 the same as the one with National Heritage List for England number 1001575?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> crematory . ?e <National Heritage List for England number> ?pv_1 . ?pv_1 <pred:value> \"1001575\" . ?e <National Heritage List for England number> ?pv . ?pv <pred:value> \"1001575\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a village with an area of 2.49152?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"2.49152\" . ?e <area> ?pv . ?pv <pred:value> \"2.49152\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which republic had an annual number of weddings of 251654.0 in 2010 and a Human Development Index of 0.848?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <annual number of weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"251654.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual number of weddings> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.848\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the population of the city/town in 2014 whose population was 757594.0 and later became 758400.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"758400.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"757594.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the metropolis with a population of 1.64952e+06 on January 1st, 2011 the same as the one with a population of 1.64952e+06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.64952e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.64952e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "On November 20th, 2017, did the agent with an Alexa rank of 360.0 change to an Alexa rank of 378.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"360.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"378.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What country had a population of 56295.0 on 2014-07-01 and a population of 52700.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56295.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-07-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"52700.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What facility had 2.9e+06 visitors in 2011-01-01 and 2.69667e+06 visitors per year?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.9e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors per year> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.69667e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the organization with an Alexa rank of 360.0 on 2017-11-20 have an Alexa rank of 378.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"360.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"378.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the manifestation with an Alexa rank of 112.0 on 2017-11-20 have a higher Alexa rank than the one with a rank of 114.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"114.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "As of December 31, 2017, does the airline with 129424 employees have the same number of employees currently?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"129424.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-12-31\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"129424.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Suffolk (the one with a population of 84761) and Suffolk (the one with a FIPS 10-4 code of UKN5)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Suffolk . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"84761.0\"^^xsd:double . ?e_2 <pred:name> Suffolk . ?e_2 <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"UKN5\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Plymouth (the one with a population of 267918) and Plymouth (the one with an official name of Plymouth)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Plymouth . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"267918.0\"^^xsd:double . ?e_2 <pred:name> Plymouth . ?e_2 <official name> ?pv_1 . ?pv_1 <pred:value> \"Plymouth\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Edmonton (the one with a population of 616306.0) and Edmonton (the one with an OS grid reference of TQ335925)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Edmonton . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"616306.0\"^^xsd:double . ?e_2 <pred:name> Edmonton . ?e_2 <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"TQ335925\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Taiwan (the one with a population of 2.35084e+07 and an ISO 3166-1 numeric code of 158) to Taiwan?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Taiwan . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.35084e+07\"^^xsd:double . ?e_2 <pred:name> Taiwan . ?e_2 <ISO 3166-1 numeric code> ?pv_1 . ?pv_1 <pred:value> \"158\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between India (the one with a Human Development Index of 0.496) and India (the one with an ISNI of 0000 0001 2331 2734)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> India . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.496\"^^xsd:double . ?e_2 <pred:name> India . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2331 2734\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the two places named Richmond, one with a population of 11679 and the other with an OS grid reference of TQ1874?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Richmond . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"11679.0\"^^xsd:double . ?e_2 <pred:name> Richmond . ?e_2 <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"TQ1874\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Chihuahua (the one with a population of 3.40646e+06) and Chihuahua (the one with a Dewey Decimal Classification of 2--7216)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Chihuahua . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.40646e+06\"^^xsd:double . ?e_2 <pred:name> Chihuahua . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7216\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Rotherham (the one with a population of 1.3439e+06) and Rotherham (the one with a TOID of 4000000074569937)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Rotherham . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.3439e+06\"^^xsd:double . ?e_2 <pred:name> Rotherham . ?e_2 <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074569937\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Uzbekistan (the one with a Human Development Index of 0.675) and Uzbekistan (the one with a CIVICUS Monitor country entry value of uzbekistan)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Uzbekistan . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.675\"^^xsd:double . ?e_2 <pred:name> Uzbekistan . ?e_2 <CIVICUS Monitor country entry> ?pv_1 . ?pv_1 <pred:value> \"uzbekistan\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kyrgyzstan (the one with a Human Development Index of 0.634) and Kyrgyzstan (the one with a Human Development Index of 0.652)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Kyrgyzstan . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.634\"^^xsd:double . ?e_2 <pred:name> Kyrgyzstan . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.652\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the Instagram username \"wponx\" associated with the title Logan?",
        "sparql": "ASK { ?e <pred:name> Logan . ?e <Instagram username> ?pv_1 . ?pv_1 <pred:value> \"wponx\" . ?e <title> ?pv . ?pv <pred:value> Logan .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Megadeth have a CANTIC-ID of a12188384 and a Twitter username of Megadeth?",
        "sparql": "ASK { ?e <pred:name> Megadeth . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a12188384\" . ?e <Twitter username> ?pv . ?pv <pred:value> Megadeth .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of http://www.molifilms.com/montana Montana?",
        "sparql": "ASK { ?e <pred:name> Montana . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.molifilms.com/montana\" . ?e <title> ?pv . ?pv <pred:value> Montana .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is existentialism classified under Dewey Decimal Classification 142.78 and a PhilPapers topic for the entity named existentialism?",
        "sparql": "ASK { ?e <pred:name> existentialism . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"142.78\" . ?e <PhilPapers topic> ?pv . ?pv <pred:value> existentialism .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the name of the entity Bismarck and does it have a title of Bismarck?",
        "sparql": "ASK { ?e <pred:name> Bismarck . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Bismarck\" . ?e <title> ?pv . ?pv <pred:value> Bismarck .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of Wakefield 106.0 and does it have a title of Wakefield?",
        "sparql": "ASK { ?e <pred:name> Wakefield . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"106.0\" . ?e <title> ?pv . ?pv <pred:value> Wakefield .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Havok's birth name Alexander Summers and is Havok the name in native language for the entity with the name Havok?",
        "sparql": "ASK { ?e <pred:name> Havok . ?e <birth name> ?pv_1 . ?pv_1 <pred:value> \"Alexander Summers\" . ?e <name in native language> ?pv . ?pv <pred:value> Havok .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Galway's official name also Galway and does it have a LAU code of IE01301?",
        "sparql": "ASK { ?e <pred:name> Galway . ?e <LAU> ?pv_1 . ?pv_1 <pred:value> \"IE01301\" . ?e <official name> ?pv . ?pv <pred:value> Galway .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Alsace have a Dewey Decimal Classification of 2--4439 and a Twitter username of Alsace?",
        "sparql": "ASK { ?e <pred:name> Alsace . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4439\" . ?e <Twitter username> ?pv . ?pv <pred:value> Alsace .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of the title Ali 157.0?",
        "sparql": "ASK { ?e <pred:name> Ali . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"157.0\" . ?e <title> ?pv . ?pv <pred:value> Ali .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which town has a population of 49404.0 and has a population of 49404.0 as a fact?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> town . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"49404.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"49404.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]