[
    {
        "question": "What is the number of subscribers for CarletonCollege's Twitter account for the college instance?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> college . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"CarletonCollege\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"8047.0\"^^xsd:double . ?e <Twitter username> ?pv . ?pv <pred:value> \"CarletonCollege\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the dog instance with subreddit \"Yorkies\" and 2394.0 subscribers?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> dog . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"2394.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the organization with an official website of http://www.assembly.ca.gov/ and 80 seats (with a unit of 1) ?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <number of seats> ?pv_1 . ?pv_1 <pred:value> \"80.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seats> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"80.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"http://www.assembly.ca.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the disco instance with subreddit \"italodisco\" and 3039.0 subscribers?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> disco . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"3039.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"italodisco\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index for the democracy with an HDI of 0.752?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.752\"^^xsd:double . ?e <Human Development Index> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many episodes does the miniseries have if the number of episodes is 11.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"11.0\"^^xsd:double . ?e <number of episodes> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Alexa rank of an award that has a rank of 126668.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> award . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"126668.0\"^^xsd:double . ?e <Alexa rank> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of episodes for the stop-motion show with a duration of 56.0 minutes?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> stop-motion . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . ?e <number of episodes> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of pages for a genre book that has 218.0 pages?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <number of pages> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Alexa rank of the industry whose Alexa rank is 1.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <Alexa rank> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of the town with a population of 160000.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> town . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"160000.0\"^^xsd:double . ?e <population> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of constituencies for the manifestation with a value of 107.0 and a unit of 1?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <number of constituencies> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107.0\"^^xsd:double . ?e <number of constituencies> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many speakers does Malay have?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Malay . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.3e+07\"^^xsd:double . ?e <number of speakers> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of pages for an anthology with 218.0 pages?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anthology . ?e <number of pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <number of pages> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which physician has a short name of \"M.D.\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> physician . ?e <short name> ?pv . ?pv <pred:value> \"M.D.\" . ?e <short name> ?pv_1 . ?pv_1 <pred:value> \"M.D.\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which activity has two official websites, http://www.medalofhonor.com?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <official website> ?pv . ?pv <pred:value> \"http://www.medalofhonor.com\" . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.medalofhonor.com\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which object classified as a zither has a Hornbostel-Sachs classification of 314.122-5?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> zither . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"314.122-5\" . ?e <Hornbostel-Sachs classification> ?pv_1 . ?pv_1 <pred:value> \"314.122-5\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity is classified under Christianity and has a Library of Congress Classification of BR1644-1644.7?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Christianity . ?e <Library of Congress Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" . ?e <Library of Congress Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which miniseries has a duration of 177.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <duration> ?pv . ?pv <pred:value> \"177.0\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"177.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a lawyer with ISCO occupation code 2421 and Iconclass notation 44G161?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> lawyer . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2421\" . ?e <Iconclass notation> ?pv_1 . ?pv_1 <pred:value> \"44G161\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity belongs to the genre category and has OLAC video game genre vocabulary values of \"1069\" and \"1069\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <OLAC video game genre vocabulary> ?pv . ?pv <pred:value> \"1069\" . ?e <OLAC video game genre vocabulary> ?pv_1 . ?pv_1 <pred:value> \"1069\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity is related to research and has an IPTC Newscode of \"mediatopic/20000737\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> research . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000737\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which road has a length of 2451.0 and is numbered US 66?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> road . ?e <length> ?pv . ?pv <pred:value> \"2451.0\" . ?e <road number> ?pv_1 . ?pv_1 <pred:value> \"US 66\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which crime has caused 6 million deaths?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> crime . ?e <number of deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which religion has a population of 3.35271e+06?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> religion . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.35271e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which manifestation has 107 constituencies?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <number of constituencies> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"107.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which book genre has 218 pages?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which neighborhood has a population of 68469?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"68469.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city/town has a population of 758400.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"758400.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which agent has 33 seats?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <number of seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which industry has 56 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the genre of the band with the Twitter username \"depechemode\" and whose information was retrieved on 2017-06-21?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> band . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"depechemode\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <retrieved> ?qpv . ?qpv <pred:date> \"2017-06-21\"^^xsd:date . ?e <genre> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the elevation above sea level of the capital whose ISO 3166-2 code is CZ-PR and whose end time is 2016-11-15?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <ISO 3166-2 code> ?pv_1 . ?pv_1 <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2016-11-15\"^^xsd:date . ?e <elevation above sea level> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the title of the newspaper with an Alexa rank of 112.0 on 2017-11-20?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> newspaper . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <title> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Pinterest username of the organization with an Alexa rank of 360.0 on 2017-11-20?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"360.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Pinterest username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the height of the human who had a ranking of 1.0 on 2008-08-18?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <ranking> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2008-08-18\"^^xsd:date . ?e <height> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISO 3166-1 numeric code for the democracy that started using the licence plate code \"LB\" on 1967-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <licence plate code> ?pv_1 . ?pv_1 <pred:value> \"LB\" . [ <pred:fact_h> ?e ; <pred:fact_r> <licence plate code> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1967-01-01\"^^xsd:date . ?e <ISO 3166-1 numeric code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the university that has an IPv4 routing prefix of 134.139.0.0/16 and started on 1989-06-08?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <IPv4 routing prefix> ?pv_1 . ?pv_1 <pred:value> \"134.139.0.0/16\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4 routing prefix> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1989-06-08\"^^xsd:date . ?e <pred:name> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital of the state whose native label is \"   \" and ended on 1991-08-24?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"   \" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"1991-08-24\"^^xsd:date . ?e <capital> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Twitter username of the museum that had a total revenue of 5.73753e+08 on January 1st, 2017?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <total revenue> ?pv_1 . ?pv_1 <pred:value> \"5.73753e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <total revenue> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-01-01\"^^xsd:date . ?e <Twitter username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Tuvalu (the one with a population of 9590.0) and Tuvalu (the one with a population of 9694.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Tuvalu . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9590.0\"^^xsd:double . ?e_2 <pred:name> Tuvalu . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9694.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Luxembourg (the one with a Human Development Index of 0.89) and Luxembourg (the one with a Human Development Index of 0.752)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Luxembourg . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.89\"^^xsd:double . ?e_2 <pred:name> Luxembourg . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.752\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Bahrain (the one with a Human Development Index of 0.821) and Bahrain (the one with a Human Development Index of 0.817)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Bahrain . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.821\"^^xsd:double . ?e_2 <pred:name> Bahrain . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.817\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two Sheffield populations, one with 569700.0 and the other with 518090.0?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Sheffield . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"569700.0\"^^xsd:double . ?e_2 <pred:name> Sheffield . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"518090.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two populations of Aachen, one with a value of 545067.0 and the other with a value of 23413.0?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Aachen . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"545067.0\"^^xsd:double . ?e_2 <pred:name> Aachen . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"23413.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Preston, one with a population of 141300.0 and the other with a population of 141801.0?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Preston . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"141300.0\"^^xsd:double . ?e_2 <pred:name> Preston . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"141801.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]