[{"question": "Which drug has a subreddit called \"Marijuana\" with 106,576 subscribers and another subreddit called \"trees\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"106576.0\"^^xsd:double . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"trees\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which college has a Twitter username of CarletonCollege, has 8047 subscribers, and has a PermID of 4296733383?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"CarletonCollege\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"8047.0\"^^xsd:double . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"4296733383\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the subreddit \"lesbians\" in the LGBT category, has 194,100 subscribers, and is classified under Dewey Decimal Classification 306.7663?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"194100.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of Mormonism (the one with a Twitter username of LDSchurch and 461,456 subscribers)?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"LDSchurch\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"461456.0\"^^xsd:double . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.mormon.org\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which art has a subreddit called photocritique with 166,070 subscribers and an UNSPSC code of 82131604?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <subreddit> ?pv . ?pv <pred:value> \"photocritique\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"166070.0\"^^xsd:double . ?e <UNSPSC_Code> ?pv_1 . ?pv_1 <pred:value> \"82131604\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which science has a subreddit called Anthropology with 56966.0 subscribers and a MeSH Code of I01.076?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Anthropology\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"56966.0\"^^xsd:double . ?e <MeSH_Code> ?pv_1 . ?pv_1 <pred:value> \"I01.076\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which business has a Twitter username of HearstCorp, has 110.0 subscribers, and has an ISNI of 0000 0000 8338 5874?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"HearstCorp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"110.0\"^^xsd:double . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8338 5874\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which basketball has a subreddit called CollegeBasketball with 256,367 subscribers and an IAB code of 489?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <subreddit> ?pv . ?pv <pred:value> \"CollegeBasketball\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"256367.0\"^^xsd:double . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"489\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]