[{"question": "Is Lund's inception date earlier than 1584 (according to the statement with Gregorian date)?", "sparql": "ASK { ?e <pred:name> \"Lund\" . ?e <inception> ?pv . ?pv <pred:date> \"0990-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Congo published in Germany on August 17, 1995?", "sparql": "ASK { ?e <pred:name> \"Congo\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1995-08-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Sicko published on 2007-10-11 in Germany?", "sparql": "ASK { ?e <pred:name> \"Sicko\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-10-11\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Frost/Nixon published on 2009-01-29 in Hungary?", "sparql": "ASK { ?e <pred:name> \"Frost/Nixon\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-01-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Hungary\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Showgirls published on 1996-01-25 in Germany?", "sparql": "ASK { ?e <pred:name> \"Showgirls\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1996-01-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Ghost\" published on 1990-10-11 in Germany?", "sparql": "ASK { ?e <pred:name> \"Ghost\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1990-10-11\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Assassins\" published on 1995-10-26 in Germany?", "sparql": "ASK { ?e <pred:name> \"Assassins\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1995-10-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Tyrannosaur published on 2011-10-13 in Germany?", "sparql": "ASK { ?e <pred:name> \"Tyrannosaur\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-10-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Rent published in Germany on April 13, 2006?", "sparql": "ASK { ?e <pred:name> \"Rent\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-04-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Tarzan published on 2014-02-20 in Germany?", "sparql": "ASK { ?e <pred:name> \"Tarzan\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2014-02-20\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Ben-Hur published on 2016-09-01 in Germany?", "sparql": "ASK { ?e <pred:name> \"Ben-Hur\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2016-09-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Centurion published on 2010-08-26 in Hungary?", "sparql": "ASK { ?e <pred:name> \"Centurion\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-08-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Hungary\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Chinatown\" published on 1974-12-19 in Germany?", "sparql": "ASK { ?e <pred:name> \"Chinatown\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1974-12-19\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Jarhead published on 2006-01-05 in Germany?", "sparql": "ASK { ?e <pred:name> \"Jarhead\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-01-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Thirteen\" published on November 13, 2003 in Germany?", "sparql": "ASK { ?e <pred:name> \"Thirteen\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2003-11-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Entourage published on 2015-07-09 in Germany?", "sparql": "ASK { ?e <pred:name> \"Entourage\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2015-07-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"It\" published on 2017-09-15 in Turkey?", "sparql": "ASK { ?e <pred:name> \"It\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2017-09-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Turkey\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Dogma published on 2000-04-20 in Germany?", "sparql": "ASK { ?e <pred:name> \"Dogma\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-04-20\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Hercules published on 2005-05-16 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Hercules\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-05-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Napoleon published in Germany on December 19, 1996?", "sparql": "ASK { ?e <pred:name> \"Napoleon\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1996-12-19\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Unstoppable\" published on 2010-11-11 in Germany?", "sparql": "ASK { ?e <pred:name> \"Unstoppable\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-11-11\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Cosmopolis\" published on 2012-07-05 in Germany?", "sparql": "ASK { ?e <pred:name> \"Cosmopolis\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2012-07-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Guernsey established before 1584?", "sparql": "ASK { ?e <pred:name> \"Guernsey\" . ?e <inception> ?pv . ?pv <pred:date> \"1204-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Helen have a significant event at the 2009 Sundance Film Festival?", "sparql": "ASK { ?e <pred:name> \"Helen\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-01-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <significant_event> ?qpv . ?qpv <pred:value> \"2009 Sundance Film Festival\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Victoria published on 2015-07-01 in France?", "sparql": "ASK { ?e <pred:name> \"Victoria\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2015-07-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"France\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Pleasantville published on 1999-03-04 in Germany?", "sparql": "ASK { ?e <pred:name> \"Pleasantville\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-03-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the Titanic published on 1998-01-16 in Italy?", "sparql": "ASK { ?e <pred:name> \"Titanic\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-01-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Italy\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie xXx published on 2002-10-17 in Germany?", "sparql": "ASK { ?e <pred:name> \"xXx\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2002-10-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Happy-Go-Lucky\" published on 2008-07-03 in Germany?", "sparql": "ASK { ?e <pred:name> \"Happy-Go-Lucky\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-07-03\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Afghanistan's inception date 1747-01-01 and its identity of subject in context Durrani Sadozai Empire?", "sparql": "ASK { ?e <pred:name> \"Afghanistan\" . ?e <inception> ?pv . ?pv <pred:date> \"1747-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <identity_of_subject_in_context> ?qpv . ?qpv <pred:value> \"Durrani Sadozai Empire\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Earth published at the Berlin International Film Festival on 2019-02-08?", "sparql": "ASK { ?e <pred:name> \"Earth\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2019-02-08\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Berlin International Film Festival\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Hugo\" published on 2012-02-09 in Germany?", "sparql": "ASK { ?e <pred:name> \"Hugo\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2012-02-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Bolt\" published on 2008-11-18 in North America?", "sparql": "ASK { ?e <pred:name> \"Bolt\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-11-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"North America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Grimsby published in the United Kingdom on 2016-02-24?", "sparql": "ASK { ?e <pred:name> \"Grimsby\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2016-02-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United Kingdom\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Alice published on 2009-12-06 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Alice\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-12-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Melancholia published on 2011-10-06 in Germany?", "sparql": "ASK { ?e <pred:name> \"Melancholia\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-10-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Network\" published on 1977-03-10 in Germany?", "sparql": "ASK { ?e <pred:name> \"Network\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1977-03-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book named \"April\" published on 1998-11-05 in Germany?", "sparql": "ASK { ?e <pred:name> \"April\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-11-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Scrooged\" published on 1988-12-25 in Sweden?", "sparql": "ASK { ?e <pred:name> \"Scrooged\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1988-12-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Collateral\" published in Germany on September 23, 2004?", "sparql": "ASK { ?e <pred:name> \"Collateral\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2004-09-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Superbad published on 2007-10-03 in Germany?", "sparql": "ASK { ?e <pred:name> \"Superbad\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-10-03\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Wakefield published on 2017-07-06 in Russia?", "sparql": "ASK { ?e <pred:name> \"Wakefield\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2017-07-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Russia\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Gladiator published in Germany on May 25, 2000?", "sparql": "ASK { ?e <pred:name> \"Gladiator\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-05-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"De-Lovely\" published on 2005-01-20 in Germany?", "sparql": "ASK { ?e <pred:name> \"De-Lovely\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-01-20\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the musical \"Oliver!\" published in Sweden on December 17, 1968?", "sparql": "ASK { ?e <pred:name> \"Oliver!\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1968-12-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Shrek published on 2001-07-05 in Germany?", "sparql": "ASK { ?e <pred:name> \"Shrek\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-07-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Apocalypto published on 2006-12-14 in Germany?", "sparql": "ASK { ?e <pred:name> \"Apocalypto\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-12-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Transformers published on 2007-06-12 in Sydney?", "sparql": "ASK { ?e <pred:name> \"Transformers\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-06-12\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sydney\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Invincible\" published on 2002-01-17 in Germany?", "sparql": "ASK { ?e <pred:name> \"Invincible\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2002-01-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Carrie\" published on 2013-12-05 in Germany?", "sparql": "ASK { ?e <pred:name> \"Carrie\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2013-12-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Phoenix published in Hungary on 2015-08-06?", "sparql": "ASK { ?e <pred:name> \"Phoenix\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2015-08-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Hungary\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Canada's inception date on July 1, 1867, based on the criterion of declaration of independence?", "sparql": "ASK { ?e <pred:name> \"Canada\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <criterion_used> ?qpv . ?qpv <pred:value> \"declaration of independence\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Twilight published in Germany on August 6, 1998?", "sparql": "ASK { ?e <pred:name> \"Twilight\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-08-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Celebrity\" published on 1999-04-08 in Germany?", "sparql": "ASK { ?e <pred:name> \"Celebrity\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-04-08\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Big\" published on 1988-09-29 in Germany?", "sparql": "ASK { ?e <pred:name> \"Big\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1988-09-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Sabrina\" published on January 11, 1996 in Germany?", "sparql": "ASK { ?e <pred:name> \"Sabrina\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1996-01-11\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Cobra\" published on 1986-10-02 in Germany?", "sparql": "ASK { ?e <pred:name> \"Cobra\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1986-10-02\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Beloved\" published on April 15, 1999 in Germany?", "sparql": "ASK { ?e <pred:name> \"Beloved\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-04-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Pina\" published on 2011-02-24 in Germany?", "sparql": "ASK { ?e <pred:name> \"Pina\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-02-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Iris\" published on 2002-05-16 in Germany?", "sparql": "ASK { ?e <pred:name> \"Iris\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2002-05-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Argo published in Germany on November 8, 2012?", "sparql": "ASK { ?e <pred:name> \"Argo\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2012-11-08\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Pocahontas published on 1995-06-10 in Central Park?", "sparql": "ASK { ?e <pred:name> \"Pocahontas\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1995-06-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Central Park\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Volver\" published on 2006-08-03 in Germany?", "sparql": "ASK { ?e <pred:name> \"Volver\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-08-03\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Hairspray published on 1988-08-04 in Germany?", "sparql": "ASK { ?e <pred:name> \"Hairspray\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1988-08-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Girls\" published on 2007-02-02 in Norway?", "sparql": "ASK { ?e <pred:name> \"Girls\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-02-02\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Norway\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Inception\" published on 2010-07-29 in Germany?", "sparql": "ASK { ?e <pred:name> \"Inception\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-07-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]