[
    {
        "question": "Is the population of Arkansas 1.57445e+06?",
        "sparql": "ASK { ?e <pred:name> Arkansas . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.57445e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.57445e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Bern 140567.0?",
        "sparql": "ASK { ?e <pred:name> Bern . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"140567.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"140567.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Salinas 150441.0?",
        "sparql": "ASK { ?e <pred:name> Salinas . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"150441.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"150441.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Hilversum have a number of households equal to 40288.0?",
        "sparql": "ASK { ?e <pred:name> Hilversum . ?e <number of households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"40288.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of households> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"40288.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Jeddah 3.4 million?",
        "sparql": "ASK { ?e <pred:name> Jeddah . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.4e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"3.4e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Modena 184960.0?",
        "sparql": "ASK { ?e <pred:name> Modena . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"184960.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"184960.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Lahore 1.0665e+07?",
        "sparql": "ASK { ?e <pred:name> Lahore . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0665e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.0665e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit \"rockford\" and the city with a population of 152871.0 named Rockford?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Rockford . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"152871.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"rockford\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of episodes in the first season of Friends, whose duration is 30.0 and the number of seasons is 10.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Friends . ?e <number of seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"10.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"30.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What language pertains to the official website of Verizon, which has 177700 employees with a unit of 1?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Verizon . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"177700.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"http://www.verizon.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the city of Spartanburg (whose population is 37013.0 and official website is http://www.cityofspartanburg.org)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Spartanburg . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"37013.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"http://www.cityofspartanburg.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate for the fact that Selma has a population of 20756.0 and an elevation above sea level of 38.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Selma . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20756.0\"^^xsd:double . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"38.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the city of Compton, whose population is 96455 and official website is http://www.comptoncity.org/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Compton . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"96455.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"http://www.comptoncity.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the city of Tallahassee, whose population is 62475 and official website is http://www.talgov.com/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Tallahassee . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"62475.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"http://www.talgov.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with magnesium, whose electronegativity is 1.0 and EC number is 231-104-6?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> magnesium . ?e <electronegativity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <EC number> ?pv . ?pv <pred:value> \"231-104-6\" . [ <pred:fact_h> ?e ; <pred:fact_r> <EC number> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the population of Yukon reach 36589 and its official name become Yukon Territory?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Yukon . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"36589.0\"^^xsd:double . ?e <official name> ?pv . ?pv <pred:value> \"Yukon Territory\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "At what point in time did Chittagong have a population of 2.58164e+06?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Chittagong . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.58164e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"2.58164e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What facility had 2.9 million visitors in 2011 and has a collection or exhibition size of 4.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.9e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors per year> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <collection or exhibition size> ?pv . ?pv <pred:value> \"4.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Google part of the industry whose Alexa rank is 1.0 as of November 20, 2017 and has a Twitter hashtag?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Twitter hashtag> ?pv . ?pv <pred:value> \"Google\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the museum, which had 2.9 million visitors in 2011 and a collection or exhibition size of 4.0, have its visitors per year measured in units of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.9e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors per year> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <collection or exhibition size> ?pv . ?pv <pred:value> \"4.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the university with a Twitter username of SussexUni, had 17,319 students on 2016-01-12, and the count was measured in units of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <students count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"17319.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students count> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2016-01-12\"^^xsd:date . ?e <Twitter username> ?pv . ?pv <pred:value> \"SussexUni\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What country has a population of 56295.0 as of 2014-07-01 and a country calling code of +299?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56295.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-07-01\"^^xsd:date . ?e <country calling code> ?pv . ?pv <pred:value> \"+299\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the film with an attendance of 8446.0 on 2018-05-30 have a duration of 109.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8446.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"109.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISO 3166-2 code for the city whose population was 928850.0 on 2014-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"928850.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <ISO 3166-2 code> ?pv . ?pv <pred:value> \"MA-MMD\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the metropolis with a population of 1.64952e+06 (as of 2011-01-01) called Montralais?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.64952e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <demonym> ?pv . ?pv <pred:value> \"Montralais\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of the democracy that had an annual number of weddings of 265404.0 on 2008-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <annual number of weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"265404.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual number of weddings> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2008-01-01\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--44\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an organization with an Alexa rank of 380.0 (whose inception date is 1902-06-24) and whose Alexa rank is measured in units of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"380.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"380.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1902-06-24\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What college was founded on January 1, 1824 and has a student count of 1628.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> college . ?e <students count> ?pv_1 . ?pv_1 <pred:value> \"1628.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <students count> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1628.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publication date of the song with a beats per minute of 90.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> song . ?e <beats per minute> ?pv_1 . ?pv_1 <pred:value> \"90.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <beats per minute> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"90.0\"^^xsd:double . ?e <publication date> ?pv . ?pv <pred:date> \"1991-12-30\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the army that was founded on 1947-08-15 and has 1.1299e+06 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> army . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"1.1299e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.1299e+06\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1947-08-15\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a museum whose visitors per year is 2.69667e+06 and whose inception date is 1819-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:value> \"2.69667e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors per year> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2.69667e+06\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1819-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a democracy that has a Human Development Index of 0.424 (with unit 1) and was founded on 1822-01-07?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.424\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"0.424\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1822-01-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the island whose population is 68073.0 (with a unit of 1) and was founded on 1898-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"68073.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"68073.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a town with a population of 6444.0 (unit: 1) and an inception date of 1566-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> town . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6444.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6444.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1566-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a software with a Twitter username of Windows, 6.26385e+06 subscribers, and an inception date of 1985-11-20?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"Windows\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6.26385e+06\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1985-11-20\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the city whose population is 2.39487e+06 (the unit is 1) and was founded on 1810-09-25?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"2.39487e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2.39487e+06\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1810-09-25\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the language with Ethnologue.com language code \"sin\" spoken by 1.6e+07 people?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.6e+07\"^^xsd:double . ?e <Ethnologue.com language code> ?pv . ?pv <pred:value> \"sin\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the anthology with 218 pages also measured as 218.0 pages?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> anthology . ?e <number of pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <number of pages> ?pv . ?pv <pred:value> \"218.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a city/town with a population of 758400 and a Dewey Decimal Classification of 2--4779?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"758400.0\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--4779\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a film with a box office of 8.96911e+08 and a cost of 1.5e+08?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <cost> ?pv . ?pv <pred:value> \"1.5e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an island with a population of 1.1158e+06 and whose demonym is South Islander?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1158e+06\"^^xsd:double . ?e <demonym> ?pv . ?pv <pred:value> \"South Islander\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the country that has a Human Development Index of 0.424 and a British Museum person-institution value of 180889 a republic?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.424\"^^xsd:double . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"180889\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]