[
    {
        "question": "Which language had 4.02e+07 speakers as of January 1, 2007?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <number of speakers> ?pv . ?pv <pred:value> \"4.02e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2007-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many divisions were dissolved, abolished or demolished on September 16th, 2015?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> division . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"2015-09-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many democracies were established in the year 0697?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <inception> ?pv . ?pv <pred:date> \"0697-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many governors were inaugurated on October 25th, 1780?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> governor . ?e <inception> ?pv . ?pv <pred:date> \"1780-10-25\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many speakers were created on April 1st, 1789?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> speaker . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many anarcho-punk instances were created on January 1st, 1986?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anarcho-punk . ?e <inception> ?pv . ?pv <pred:date> \"1986-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many empires were established on January 1st, 1526?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> empire . ?e <inception> ?pv . ?pv <pred:date> \"1526-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many singles were published on 1994-07-06?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> single . ?e <publication date> ?pv . ?pv <pred:date> \"1994-07-06\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many fronts started on August 3rd, 1914?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> front . ?e <start time> ?pv . ?pv <pred:date> \"1914-08-03\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many sounds were created in 1983?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> sound . ?e <inception> ?pv . ?pv <pred:date> \"1983-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many businesses were founded on July 10th, 2008?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <inception> ?pv . ?pv <pred:date> \"2008-07-10\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the business with the official website http://www.watchimage.com, and what is the fact t value for this website?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.watchimage.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"http://www.watchimage.com\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.watchimage.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate that connects the family with the official website \"http://www.sachsen-coburg-gotha.de/\" and what is its object?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> family . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sachsen-coburg-gotha.de/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"http://www.sachsen-coburg-gotha.de/\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.sachsen-coburg-gotha.de/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between a genre book with 218 pages (whose OCLC control number is 357792) and a fact with a value of 218.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv_1 . ?pv_1 <pred:value> \"218.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of pages> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"218.0\" . ?e <OCLC control number> ?pv . ?pv <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC control number> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact that connects the color orange (with sRGB color hex triplet value FFD700) to itself?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> orange . ?e <sRGB color hex triplet> ?pv_1 . ?pv_1 <pred:value> \"FFD700\" . [ <pred:fact_h> ?e ; <pred:fact_r> <sRGB color hex triplet> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"FFD700\" . ?e <sRGB color hex triplet> ?pv . ?pv <pred:value> \"FFD700\" . [ <pred:fact_h> ?e ; <pred:fact_r> <sRGB color hex triplet> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ROME Occupation Code (v3) and ISCO occupation code for a mathematician whose ISCO occupation code is 2122 and ROME Occupation Code (v3) is M1403?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> mathematician . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2122\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"2122\" . ?e <ROME Occupation Code (v3)> ?pv . ?pv <pred:value> \"M1403\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME Occupation Code (v3)> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the Malay instance with Ethnologue.com language code \"ind\" and ISO 639-1 code \"in\" end?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Malay . ?e <Ethnologue.com language code> ?pv_1 . ?pv_1 <pred:value> \"ind\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Ethnologue.com language code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"ind\" . ?e <ISO 639-1 code> ?pv . ?pv <pred:value> \"in\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 639-1 code> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the instances of the class paranormal that have Iconclass notation 13A361?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> paranormal . ?e <Iconclass notation> ?pv_1 . ?pv_1 <pred:value> \"13A361\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass notation> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"13A361\" . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"13A361\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass notation> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the speaker whose native label is \"Speaker of the United States House of Representatives\" and official website is http://www.speaker.gov/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> speaker . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"Speaker of the United States House of Representatives\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.speaker.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Tagalog, its IETF language tag fil, and its ISO 639-2 code fil?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Tagalog . ?e <IETF language tag> ?pv_1 . ?pv_1 <pred:value> \"fil\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IETF language tag> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"fil\" . ?e <ISO 639-2 code> ?pv . ?pv <pred:value> \"fil\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 639-2 code> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Bhopal 1.88338e+06?",
        "sparql": "ASK { ?e <pred:name> Bhopal . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.88338e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.88338e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Calvados have an annual number of weddings of 2686 and a population of 693579?",
        "sparql": "ASK { ?e <pred:name> Calvados . ?e <annual number of weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2686.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"693579.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Ipswich 163,000?",
        "sparql": "ASK { ?e <pred:name> Ipswich . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"163000.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"163000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Haut-Rhin have an annual number of weddings equal to 2769.0?",
        "sparql": "ASK { ?e <pred:name> Haut-Rhin . ?e <annual number of weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2769.0\"^^xsd:double . ?e <annual number of weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2769.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Reno have a population of 225221 and 245255?",
        "sparql": "ASK { ?e <pred:name> Reno . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"225221.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"245255.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Dominica have a Human Development Index of 0.723?",
        "sparql": "ASK { ?e <pred:name> Dominica . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.723\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.723\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Tours have a population of 41,061 and 134,803?",
        "sparql": "ASK { ?e <pred:name> Tours . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"41061.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"134803.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Hartford 124,775?",
        "sparql": "ASK { ?e <pred:name> Hartford . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"124775.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"124775.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Danville 16218.0?",
        "sparql": "ASK { ?e <pred:name> Danville . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"16218.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"16218.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Guatemala have a Human Development Index of 0.455?",
        "sparql": "ASK { ?e <pred:name> Guatemala . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.455\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.455\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the annual number of weddings in Brittany, which is named after the region with an area of 34022.0 and has an annual number of weddings of 10718.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Brittany . ?e_1 <annual number of weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10718.0\"^^xsd:double . ?e_2 <pred:name> Brittany . ?e_2 <area> ?pv_1 . ?pv_1 <pred:value> \"34022.0\" . ?e_1 <named after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named after> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Twitter username of the capital of Tokyo (the one with a population of 9.27256e+06)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Tokyo . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9.27256e+06\"^^xsd:double . ?e_2 <pred:name> Tokyo . ?e_2 <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"tocho koho\" . ?e_1 <capital of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital of> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the administrative territorial entity that Chichester with a population of 30925 and a TOID of 7000000000016444 is located in?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Chichester . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"30925.0\"^^xsd:double . ?e_2 <pred:name> Chichester . ?e_2 <TOID> ?pv_1 . ?pv_1 <pred:value> \"7000000000016444\" . ?e_1 <located in the administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in the administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index for Andorra (the one with M.49 code 020) and what is the predicate for this fact?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Andorra . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.819\"^^xsd:double . ?e_2 <pred:name> Andorra . ?e_2 <M.49 code> ?pv_1 . ?pv_1 <pred:value> \"020\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the difference in Human Development Index between Eswatini and the country it belongs to?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Eswatini . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.473\"^^xsd:double . ?e_2 <pred:name> Eswatini . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.529\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index and demonym of Norway, and what is the fact pertaining to it?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Norway . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.942\"^^xsd:double . ?e_2 <pred:name> Norway . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Burlington (the one with a population of 25663.0) owning the entity with NRHP reference number 01001540?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Burlington . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"25663.0\"^^xsd:double . ?e_2 <pred:name> Burlington . ?e_2 <NRHP reference number> ?pv_1 . ?pv_1 <pred:value> \"01001540\" . ?e_1 <owner of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <owner of> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index for Haiti and what is its INSEE countries and foreign territories code? Also, what is the fact h for the relationship between Haiti and its country?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Haiti . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.422\"^^xsd:double . ?e_2 <pred:name> Haiti . ?e_2 <INSEE countries and foreign territories code> ?pv_1 . ?pv_1 <pred:value> \"99410\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index and IOC country code for Eritrea, and what is the fact pertaining to these two pieces of information?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Eritrea . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.39\"^^xsd:double . ?e_2 <pred:name> Eritrea . ?e_2 <IOC country code> ?pv_1 . ?pv_1 <pred:value> \"ERI\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the source of the fact that Greenland has a population of 76186 and is located in the administrative territorial entity of Greenland (the one with CIVICUS Monitor country entry \"greenland\")?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Greenland . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"76186.0\"^^xsd:double . ?e_2 <pred:name> Greenland . ?e_2 <CIVICUS Monitor country entry> ?pv_1 . ?pv_1 <pred:value> \"greenland\" . ?e_1 <located in the administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in the administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Sedona 10031.0?",
        "sparql": "ASK { ?e <pred:name> Sedona . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10031.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"10031.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Hannibal have 39 episodes?",
        "sparql": "ASK { ?e <pred:name> Hannibal . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"39.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"39.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Wolverhampton 250970.0?",
        "sparql": "ASK { ?e <pred:name> Wolverhampton . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"250970.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"250970.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]