[
    {
        "question": "Is there a television series episode with an attendance of 1.43e+07 and another attendance greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.43e+07\"^^xsd:double . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a facility with a visitors per year of 2.74113e+06 and another visitors per year greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.74113e+06\"^^xsd:double . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a language with 1.6e+07 speakers and more than arg4 speakers?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.6e+07\"^^xsd:double . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast and Ivory Coast (the one whose inception date is 1960-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Dallas and Larry Hagman (the one who died on 2012-11-23)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dallas\" . ?e_2 <pred:name> \"Larry Hagman\" . ?e_2 <date of death> ?pv . ?pv <pred:date> \"2012-11-23\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Sound of Music (the one with the same name as the date of first performance of 1959-11-16) and The Sound of Music?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Sound of Music\" . ?e_2 <pred:name> \"The Sound of Music\" . ?e_2 <date of first performance> ?pv . ?pv <pred:date> \"1959-11-16\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Burton upon Trent have an OS grid reference of SK245225?",
        "sparql": "ASK { ?e <pred:name> \"Burton upon Trent\" . ?e <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"SK245225\" . ?e <OS grid reference> ?pv . ?pv <pred:value> \"SK245225\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the area of Summit equal to 15.661?",
        "sparql": "ASK { ?e <pred:name> \"Summit\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"15.661\" . ?e <area> ?pv . ?pv <pred:value> \"15.661\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of Miracle at St. Anna 160.0?",
        "sparql": "ASK { ?e <pred:name> \"Miracle at St. Anna\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"160.0\" . ?e <duration> ?pv . ?pv <pred:value> \"160.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Ayn Rand have less than 4 children and was born on February 2nd, 1905?",
        "sparql": "ASK { ?e <pred:name> \"Ayn Rand\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1905-02-02\"^^xsd:date . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the rural population of New Delhi less than arg4, given that its inception date is 1911-01-01?",
        "sparql": "ASK { ?e <pred:name> \"New Delhi\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1911-01-01\"^^xsd:date . ?e <rural population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Serpico end on January 28, 1977 and have less than 4 seasons?",
        "sparql": "ASK { ?e <pred:name> \"Serpico\" . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1977-01-28\"^^xsd:date . ?e <number of seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the Golden Gate Bridge officially open on May 27, 1937 and have less than one span?",
        "sparql": "ASK { ?e <pred:name> \"Golden Gate Bridge\" . ?e <date of official opening> ?pv_1 . ?pv_1 <pred:date> \"1937-05-27\"^^xsd:date . ?e <number of spans> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the mean age of Prague less than arg4, given that its earliest written record dates back to 0965-01-17?",
        "sparql": "ASK { ?e <pred:name> \"Prague\" . ?e <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"0965-01-17\"^^xsd:date . ?e <mean age> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a sovereign state with a Human Development Index of 0.501 (unit: 1) and an inception date of 1960-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.501\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the film with a box office of 8.96911e+08 and a publication date of 2005-11-06 belong to the category of film?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <publication date> ?pv . ?pv <pred:date> \"2005-11-06\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the person born on 1899-05-10, who is a human, have 2 children?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <number of children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double . ?e <date of birth> ?pv . ?pv <pred:date> \"1899-05-10\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the video game console model with 1.5368e+08 units sold and discontinued on 2013-01-04?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <units sold> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.5368e+08\"^^xsd:double . ?e <discontinued date> ?pv . ?pv <pred:date> \"2013-01-04\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the capital city whose mean age is 42.0 and has the earliest written record on 0965-01-17?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <mean age> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"42.0\"^^xsd:double . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an aircraft functional class that has a total production of 1527.0 and entered service on 1970-01-22?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <total produced> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1527.0\"^^xsd:double . ?e <service entry> ?pv . ?pv <pred:date> \"1970-01-22\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What metropolitan area had a population of 2.71049e+06 on January 1st, 2014 and had a population greater than arg4?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv . ?pv <pred:value> \"2.71049e+06\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film had an attendance of 8446.0 and a start time of 2018-05-30, and whose attendance value is greater than arg4?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv . ?pv <pred:value> \"8446.0\" . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What film has an exploitation visa number of 54231, a start time of 1981-05-20, and a duration of 120.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <exploitation visa number> ?pv . ?pv <pred:value> \"54231\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation visa number> ; <pred:fact_t> ?pv ] <start time> ?qpv . ?qpv <pred:date> \"1981-05-20\"^^xsd:date . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"120.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the admission rate of the university that has an admission rate of 0.42 (with a point in time) and a unit of 1?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <admission rate> ?pv_1 . ?pv_1 <pred:value> \"0.42\" . [ <pred:fact_h> ?e ; <pred:fact_r> <admission rate> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"0.42\"^^xsd:double . ?e <admission rate> ?pv . ?pv <pred:value> \"0.42\" . [ <pred:fact_h> ?e ; <pred:fact_r> <admission rate> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the area of the U.S. city whose elevation above sea level is 114.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"114.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"114.0\" . ?e <area> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has an elevation above sea level of 114.0 and an area of 15.661?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"114.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"114.0\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"15.661\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Aachen and Aachen?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Aachen\" . ?e_2 <pred:name> \"Aachen\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Alien?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alien\" . ?e_2 <pred:name> \"Alien\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Catch-22?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Catch-22\" . ?e_2 <pred:name> \"Catch-22\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Max Weber?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Max Weber\" . ?e_2 <pred:name> \"Max Weber\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Morocco?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Morocco\" . ?e_2 <pred:name> \"Morocco\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Velvet Underground (the band) and The Velvet Underground (the album)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Velvet Underground\" . ?e_2 <pred:name> \"The Velvet Underground\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities both named Chichester?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chichester\" . ?e_2 <pred:name> \"Chichester\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Cherokee?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cherokee\" . ?e_2 <pred:name> \"Cherokee\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Christopher Cross?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Christopher Cross\" . ?e_2 <pred:name> \"Christopher Cross\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Limburg?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Limburg\" . ?e_2 <pred:name> \"Limburg\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the relationship between two entities named \"string\"?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"string\" . ?e_2 <pred:name> \"string\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of The Lion King?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Lion King\" . ?e_2 <pred:name> \"The Lion King\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities both named Brandenburg?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brandenburg\" . ?e_2 <pred:name> \"Brandenburg\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named John Adams?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Adams\" . ?e_2 <pred:name> \"John Adams\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Shrek?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shrek\" . ?e_2 <pred:name> \"Shrek\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Nantes?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nantes\" . ?e_2 <pred:name> \"Nantes\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities both named Taunton?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Taunton\" . ?e_2 <pred:name> \"Taunton\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Grammy Award for Best Comedy Album?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grammy Award for Best Comedy Album\" . ?e_2 <pred:name> \"Grammy Award for Best Comedy Album\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of jaundice?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"jaundice\" . ?e_2 <pred:name> \"jaundice\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Helen?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Helen\" . ?e_2 <pred:name> \"Helen\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Johann Sebastian Bach?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Johann Sebastian Bach\" . ?e_2 <pred:name> \"Johann Sebastian Bach\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Philadelphia?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Philadelphia\" . ?e_2 <pred:name> \"Philadelphia\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the two entities named Ghostbusters?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ghostbusters\" . ?e_2 <pred:name> \"Ghostbusters\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the two entities named Hercules?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hercules\" . ?e_2 <pred:name> \"Hercules\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Harry Stradling?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Stradling\" . ?e_2 <pred:name> \"Harry Stradling\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the two entities named Antwone Fisher?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Antwone Fisher\" . ?e_2 <pred:name> \"Antwone Fisher\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]