[
    {
        "question": "Is there a U.S. city with a population of exactly 25514.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25514.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"25514.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Somerset (the one whose end time is 1976-12-31) and Sigourney Weaver?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Somerset\" . ?e_1 <end time> ?pv . ?pv <pred:date> \"1976-12-31\"^^xsd:date . ?e_2 <pred:name> \"Sigourney Weaver\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kevin Clash (the one born on 1960-09-17) and the Primetime Emmy Award?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kevin Clash\" . ?e_1 <date of birth> ?pv . ?pv <pred:date> \"1960-09-17\"^^xsd:date . ?e_2 <pred:name> \"Primetime Emmy Award\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has a Dewey Decimal Classification of 2--74461?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--74461\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2--74461\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the city of the United States with a WOEID of 2475403 and a population of 31302.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2475403\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"31302.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the person with a British Museum person-institution ID of 17780 and 2 children a human?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"17780\" . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States was founded on September 7th, 1630?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was born on May 10th, 1899 and is classified as a human?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1899-05-10\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film was published on July 11th, 2007?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv . ?pv <pred:date> \"2007-07-11\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which play had its first performance on November 16th, 1959?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <date of first performance> ?pv . ?pv <pred:date> \"1959-11-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which theatrical genre ended on 1968-03-25?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <end time> ?pv . ?pv <pred:date> \"1968-03-25\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which Academy Awards ceremony took place on April 9th, 1979?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <point in time> ?pv . ?pv <pred:date> \"1979-04-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city is the capital and has the earliest written record dated on 0965-01-17?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which aircraft functional class had its first flight on 1969-02-09?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <first flight> ?pv . ?pv <pred:date> \"1969-02-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Boston's Dewey Decimal Classification 2--74461 and was it founded on September 7th, 1630?",
        "sparql": "ASK { ?e <pred:name> \"Boston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--74461\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Larry Hagman (born on 1931-09-21) have an ISNI of 0000 0000 5930 3891?",
        "sparql": "ASK { ?e <pred:name> \"Larry Hagman\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1931-09-21\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 5930 3891\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Miracle at St. Anna have a duration of 160.0 and a publication date of 2008-01-01?",
        "sparql": "ASK { ?e <pred:name> \"Miracle at St. Anna\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"160.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Somerset end on December 31st, 1976 and have 1710 episodes?",
        "sparql": "ASK { ?e <pred:name> \"Somerset\" . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1976-12-31\"^^xsd:date . ?e <number of episodes> ?pv . ?pv <pred:value> \"1710.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the 40th Academy Awards take place on April 10th, 1968 and have an edition number of 40?",
        "sparql": "ASK { ?e <pred:name> \"40th Academy Awards\" . ?e <point in time> ?pv_1 . ?pv_1 <pred:date> \"1968-04-10\"^^xsd:date . ?e <edition number> ?pv . ?pv <pred:value> \"40\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Boston, which has a Dewey Decimal Classification of 2--74461, have an inception date of 1630-09-07?",
        "sparql": "ASK { ?e <pred:name> \"Boston\" . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--74461\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Larry Hagman (the one with ISNI 0000 0000 5930 3891) die on November 23, 2012?",
        "sparql": "ASK { ?e <pred:name> \"Larry Hagman\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 5930 3891\" . ?e <date of death> ?pv . ?pv <pred:date> \"2012-11-23\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the production code for Hearts and Minds 111 and was its first performance on January 12th, 2005?",
        "sparql": "ASK { ?e <pred:name> \"Hearts and Minds\" . ?e <production code> ?pv_1 . ?pv_1 <pred:value> \"111\" . ?e <date of first performance> ?pv . ?pv <pred:date> \"2005-01-12\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the People's Democratic Party (whose native label is also People's Democratic Party) and Nigeria (the one whose British Museum person-institution is 174909)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"People's Democratic Party\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"People's Democratic Party\" . ?e_2 <pred:name> \"Nigeria\" . ?e_2 <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"174909\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Target Corporation have an Alexa rank of 380.0?",
        "sparql": "ASK { ?e <pred:name> \"Target Corporation\" . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"380.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Carlisle have 50429.0 households?",
        "sparql": "ASK { ?e <pred:name> \"Carlisle\" . ?e <number of households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50429.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Has cholera caused 143,000 deaths?",
        "sparql": "ASK { ?e <pred:name> \"cholera\" . ?e <number of deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"143000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many sovereign states have a Human Development Index of 0.499 and a nominal GDP of 2.07215e+10?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.499\" . ?e <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"2.07215e+10\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Burton upon Trent have a WOEID of 14696?",
        "sparql": "ASK { ?e <pred:name> \"Burton upon Trent\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"14696\" . ?e <WOEID> ?pv . ?pv <pred:value> \"14696\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Ivory Coast have a Human Development Index of 0.376?",
        "sparql": "ASK { ?e <pred:name> \"Ivory Coast\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.376\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.376\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Larry Hagman's Munzinger IBA value equal to 00000016518?",
        "sparql": "ASK { ?e <pred:name> \"Larry Hagman\" . ?e <Munzinger IBA> ?pv_1 . ?pv_1 <pred:value> \"00000016518\" . ?e <Munzinger IBA> ?pv . ?pv <pred:value> \"00000016518\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Rafael Nadal's height 185.0?",
        "sparql": "ASK { ?e <pred:name> \"Rafael Nadal\" . ?e <height> ?pv_1 . ?pv_1 <pred:value> \"185.0\" . ?e <height> ?pv . ?pv <pred:value> \"185.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"https://engineering.stackexchange.com/tags/mechanical-engineering\" a Stack Exchange tag for mechanical engineering?",
        "sparql": "ASK { ?e <pred:name> \"mechanical engineering\" . ?e <Stack Exchange tag> ?pv_1 . ?pv_1 <pred:value> \"https://engineering.stackexchange.com/tags/mechanical-engineering\" . ?e <Stack Exchange tag> ?pv . ?pv <pred:value> \"https://engineering.stackexchange.com/tags/mechanical-engineering\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Aachen have a German municipality key of 05334002?",
        "sparql": "ASK { ?e <pred:name> \"Aachen\" . ?e <German municipality key> ?pv_1 . ?pv_1 <pred:value> \"05334002\" . ?e <German municipality key> ?pv . ?pv <pred:value> \"05334002\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Harry Potter and the Goblet of Fire have a box office value of 8.96911e+08?",
        "sparql": "ASK { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <box office> ?pv_1 . ?pv_1 <pred:value> \"8.96911e+08\" . ?e <box office> ?pv . ?pv <pred:value> \"8.96911e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Bharatiya Janata Party have 117 representatives in an organization/legislature?",
        "sparql": "ASK { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:value> \"117.0\" . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:value> \"117.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Estudiantes Tecos also known as UAG Tecos?",
        "sparql": "ASK { ?e <pred:name> \"Estudiantes Tecos\" . ?e <name> ?pv_1 . ?pv_1 <pred:value> \"UAG Tecos\" . ?e <name> ?pv . ?pv <pred:value> \"UAG Tecos\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the 60th Golden Globe Awards have an edition number of 60?",
        "sparql": "ASK { ?e <pred:name> \"60th Golden Globe Awards\" . ?e <edition number> ?pv_1 . ?pv_1 <pred:value> \"60\" . ?e <edition number> ?pv . ?pv <pred:value> \"60\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Canberra have a draft value of 9.97?",
        "sparql": "ASK { ?e <pred:name> \"Canberra\" . ?e <draft> ?pv_1 . ?pv_1 <pred:value> \"9.97\" . ?e <draft> ?pv . ?pv <pred:value> \"9.97\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does SNK have a Corporate Number (Japan) of 6120901008215?",
        "sparql": "ASK { ?e <pred:name> \"SNK\" . ?e <Corporate Number (Japan)> ?pv_1 . ?pv_1 <pred:value> \"6120901008215\" . ?e <Corporate Number (Japan)> ?pv . ?pv <pred:value> \"6120901008215\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Target Corporation have an Alexa rank of 360.0?",
        "sparql": "ASK { ?e <pred:name> \"Target Corporation\" . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"360.0\" . ?e <Alexa rank> ?pv . ?pv <pred:value> \"360.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Guitar Hero III: Legends of Rock have a Nintendo GameID of RGHE52?",
        "sparql": "ASK { ?e <pred:name> \"Guitar Hero III: Legends of Rock\" . ?e <Nintendo GameID> ?pv_1 . ?pv_1 <pred:value> \"RGHE52\" . ?e <Nintendo GameID> ?pv . ?pv <pred:value> \"RGHE52\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Franz Schubert have an NSDAP membership number of 44488?",
        "sparql": "ASK { ?e <pred:name> \"Franz Schubert\" . ?e <NSDAP membership number (1925\u20131945> ?pv_1 . ?pv_1 <pred:value> \"44488\" . ?e <NSDAP membership number (1925\u20131945> ?pv . ?pv <pred:value> \"44488\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Greater Los Angeles Area have a nighttime view of Long Beach, CA at night.jpg?",
        "sparql": "ASK { ?e <pred:name> \"Greater Los Angeles Area\" . ?e <nighttime view> ?pv_1 . ?pv_1 <pred:value> \"Long Beach, CA at night.jpg\" . ?e <nighttime view> ?pv . ?pv <pred:value> \"Long Beach, CA at night.jpg\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Hamburg's German regional key equal to 02?",
        "sparql": "ASK { ?e <pred:name> \"Hamburg\" . ?e <German regional key> ?pv_1 . ?pv_1 <pred:value> \"02\" . ?e <German regional key> ?pv . ?pv <pred:value> \"02\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the subject of geography have a Universal Decimal Classification of 91?",
        "sparql": "ASK { ?e <pred:name> \"geography\" . ?e <Universal Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"91\" . ?e <Universal Decimal Classification> ?pv . ?pv <pred:value> \"91\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cosmopolis have an OCLC control number of 50441437?",
        "sparql": "ASK { ?e <pred:name> \"Cosmopolis\" . ?e <OCLC control number> ?pv_1 . ?pv_1 <pred:value> \"50441437\" . ?e <OCLC control number> ?pv . ?pv <pred:value> \"50441437\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does cheese have an OKPD2 code of the good or service equal to 10.51.40.100?",
        "sparql": "ASK { ?e <pred:name> \"cheese\" . ?e <OKPD2 code of the good or service> ?pv_1 . ?pv_1 <pred:value> \"10.51.40.100\" . ?e <OKPD2 code of the good or service> ?pv . ?pv <pred:value> \"10.51.40.100\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the serum have a UMLS CUI of C0229671?",
        "sparql": "ASK { ?e <pred:name> \"serum\" . ?e <UMLS CUI> ?pv_1 . ?pv_1 <pred:value> \"C0229671\" . ?e <UMLS CUI> ?pv . ?pv <pred:value> \"C0229671\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Parkinson disease have an ICD-9-CM code of 332?",
        "sparql": "ASK { ?e <pred:name> \"Parkinson disease\" . ?e <ICD-9-CM> ?pv_1 . ?pv_1 <pred:value> \"332\" . ?e <ICD-9-CM> ?pv . ?pv <pred:value> \"332\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Alzheimer's disease have an eMedicine ID of 1134817?",
        "sparql": "ASK { ?e <pred:name> \"Alzheimer's disease\" . ?e <eMedicine> ?pv_1 . ?pv_1 <pred:value> \"1134817\" . ?e <eMedicine> ?pv . ?pv <pred:value> \"1134817\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the occupation code of the astronomer 2111?",
        "sparql": "ASK { ?e <pred:name> \"astronomer\" . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2111\" . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Trainspotting have an ISBN-10 of 0-7493-9606-7?",
        "sparql": "ASK { ?e <pred:name> \"Trainspotting\" . ?e <ISBN-10> ?pv_1 . ?pv_1 <pred:value> \"0-7493-9606-7\" . ?e <ISBN-10> ?pv . ?pv <pred:value> \"0-7493-9606-7\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Chongqing's China administrative division code equal to 50?",
        "sparql": "ASK { ?e <pred:name> \"Chongqing\" . ?e <China administrative division code> ?pv_1 . ?pv_1 <pred:value> \"50\" . ?e <China administrative division code> ?pv . ?pv <pred:value> \"50\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]