[
    {
        "question": "Is Caribbean the demonym for the region named Caribbean?",
        "sparql": "ASK { ?e <pred:name> \"Caribbean\" . ?e <demonym> ?pv . ?pv <pred:value> \"Caribbean\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is riboflavin the World Health Organisation International Nonproprietary Name for riboflavin?",
        "sparql": "ASK { ?e <pred:name> \"riboflavin\" . ?e <World Health Organisation International Nonproprietary Name> ?pv . ?pv <pred:value> \"riboflavin\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many subscribers does CNBC's Twitter account (@CNBC) have?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"CNBC\" . ?e <Twitter username> ?pv . ?pv <pred:value> \"CNBC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the Twitter hashtag \"Stuttgart\" for the city of Stuttgart?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Stuttgart\" . ?e <Twitter hashtag> ?pv . ?pv <pred:value> \"Stuttgart\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter hashtag> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Liberia?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Liberia\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Liberia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was a cast member in the film published on 2001-08-16 in Germany?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the inception time of the dynasty that has a statement with a Gregorian date earlier than 1584 and was dissolved, abolished or demolished in 1485?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1485-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved, abolished or demolished> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <inception> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Fred Astaire associated with the British Museum person-institution with ID 17780 and has a name in native language of Fred Astaire?",
        "sparql": "ASK { ?e <pred:name> \"Fred Astaire\" . ?e <name in native language> ?pv_1 . ?pv_1 <pred:value> \"Fred Astaire\" . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"17780\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of the movie Miracle at St. Anna 160.0?",
        "sparql": "ASK { ?e <pred:name> \"Miracle at St. Anna\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Miracle at St. Anna\" . ?e <duration> ?pv . ?pv <pred:value> \"160.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a portrait with the Artsy gene \"portrait\" for both its name and value?",
        "sparql": "ASK { ?e <pred:name> \"portrait\" . ?e <Artsy gene> ?pv_1 . ?pv_1 <pred:value> \"portrait\" . ?e <Artsy gene> ?pv . ?pv <pred:value> \"portrait\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the start time for the geographic region with NUTS code UKM65?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <NUTS code> ?pv_1 . ?pv_1 <pred:value> \"UKM65\" . ?e <NUTS code> ?pv . ?pv <pred:value> \"UKM65\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS code> ; <pred:fact_t> ?pv ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the subject's role for the town with TOID 4000000074552364?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074552364\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074552364\" . [ <pred:fact_h> ?e ; <pred:fact_r> <TOID> ; <pred:fact_t> ?pv ] <subject has role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate of the fact that states the area of the U.S. city whose area is 2.32141e+08?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"2.32141e+08\" . ?e <area> ?pv . ?pv <pred:value> \"2.32141e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <area> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for the sovereign state with a Human Development Index of 0.444?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.444\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.444\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the legislative body of the political party that has 117 representatives in an organization/legislature?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:value> \"117.0\" . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:value> \"117.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of representatives in an organization/legislature> ; <pred:fact_t> ?pv ] <legislative body> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of representatives in an organization/legislature for the first-level administrative country subdivision that has 135.0 as its value?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:value> \"135.0\" . ?e <number of representatives in an organization/legislature> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the UN/LOCODE of the city of the United States that has a UN/LOCODE of USURB?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <UN/LOCODE> ?pv_1 . ?pv_1 <pred:value> \"USURB\" . ?e <UN/LOCODE> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the NIS/INS code for the big city that has a code of 24062?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <NIS/INS code> ?pv_1 . ?pv_1 <pred:value> \"24062\" . ?e <NIS/INS code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISO 9362 SWIFT/BIC code for the agent with the code BOFAUS6S?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <ISO 9362 SWIFT/BIC code> ?pv_1 . ?pv_1 <pred:value> \"BOFAUS6S\" . ?e <ISO 9362 SWIFT/BIC code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Alexa rank of the Primetime Emmy Award?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"126668.0\" . ?e <Alexa rank> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ARCHON code for the college of the University of Cambridge with an ARCHON code of 2938?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Cambridge\" . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"2938\" . ?e <ARCHON code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ATC code for a chemical compound that has the code B03BB01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e <ATC code> ?pv_1 . ?pv_1 <pred:value> \"B03BB01\" . ?e <ATC code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ACM Classification Code (2012) for the academic discipline that has a code of 10003633?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <ACM Classification Code (2012)> ?pv_1 . ?pv_1 <pred:value> \"10003633\" . ?e <ACM Classification Code (2012)> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Australian Business Number of the television network with ABN 52429278345?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television network\" . ?e <Australian Business Number> ?pv_1 . ?pv_1 <pred:value> \"52429278345\" . ?e <Australian Business Number> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Artsy gene associated with the activity that involves portraits?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Artsy gene> ?pv_1 . ?pv_1 <pred:value> \"portrait\" . ?e <Artsy gene> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Amsterdam code for the municipality of the Netherlands that has an Amsterdam code of 11157?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"municipality of the Netherlands\" . ?e <Amsterdam code> ?pv_1 . ?pv_1 <pred:value> \"11157\" . ?e <Amsterdam code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Amtrak station code for the railway station that has an Amtrak station code of \"brl\"?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"railway station\" . ?e <Amtrak station code> ?pv_1 . ?pv_1 <pred:value> \"brl\" . ?e <Amtrak station code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which software has Arch Linux packages for both \"mesa\"?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Arch\u00a0Linux package> ?pv_1 . ?pv_1 <pred:value> \"mesa\" . ?e <Arch\u00a0Linux package> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Bulbapedia article for the entertainment instance related to Super Smash Bros. Brawl?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Bulbapedia article> ?pv_1 . ?pv_1 <pred:value> \"Super Smash Bros. Brawl\" . ?e <Bulbapedia article> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Caverphone code for the family name that has a NSN111 Caverphone code?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"family name\" . ?e <Caverphone> ?pv_1 . ?pv_1 <pred:value> \"NSN111\" . ?e <Caverphone> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Classification of Instructional Programs code for a technology instance that has a code of 11.0103?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"technology\" . ?e <Classification of Instructional Programs code> ?pv_1 . ?pv_1 <pred:value> \"11.0103\" . ?e <Classification of Instructional Programs code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Corporate Number (Japan) of the video game publisher with a value of 1011001060972?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game publisher\" . ?e <Corporate Number (Japan)> ?pv_1 . ?pv_1 <pred:value> \"1011001060972\" . ?e <Corporate Number (Japan)> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Common Procurement Vocabulary code for the class of instruments that has a Common Procurement Vocabulary value of 37316600?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of instruments\" . ?e <Common Procurement Vocabulary> ?pv_1 . ?pv_1 <pred:value> \"37316600\" . ?e <Common Procurement Vocabulary> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Debian stable package for the political ideology of anarchism?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political ideology\" . ?e <Debian stable package> ?pv_1 . ?pv_1 <pred:value> \"anarchism\" . ?e <Debian stable package> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of the metropolitan borough that has a classification of 2--42817?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--42817\" . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the EPPO Code for the taxon that has an EPPO Code of 1CICHF?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <EPPO Code> ?pv_1 . ?pv_1 <pred:value> \"1CICHF\" . ?e <EPPO Code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the FIFA country code for the national association football team whose FIFA country code is GPE?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <FIFA country code> ?pv_1 . ?pv_1 <pred:value> \"GPE\" . ?e <FIFA country code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Hornbostel-Sachs classification of a drum that has a classification of 211.212.11?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs classification> ?pv_1 . ?pv_1 <pred:value> \"211.212.11\" . ?e <Hornbostel-Sachs classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the HTML entity for the currency whose name is euro?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <HTML entity> ?pv_1 . ?pv_1 <pred:value> \"&euro;\" . ?e <HTML entity> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the first-level administrative country subdivision have 135 representatives in an organization/legislature?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:value> \"135.0\" . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:value> \"135.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a city in the United States with a UN/LOCODE of USURB?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <UN/LOCODE> ?pv_1 . ?pv_1 <pred:value> \"USURB\" . ?e <UN/LOCODE> ?pv . ?pv <pred:value> \"USURB\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a big city with NIS/INS code 24062?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <NIS/INS code> ?pv_1 . ?pv_1 <pred:value> \"24062\" . ?e <NIS/INS code> ?pv . ?pv <pred:value> \"24062\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the agent with ISO 9362 SWIFT/BIC code BOFAUS6S have the same code as its own ISO 9362 SWIFT/BIC code?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <ISO 9362 SWIFT/BIC code> ?pv_1 . ?pv_1 <pred:value> \"BOFAUS6S\" . ?e <ISO 9362 SWIFT/BIC code> ?pv . ?pv <pred:value> \"BOFAUS6S\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Primetime Emmy Award have an Alexa rank of 126668.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"126668.0\" . ?e <Alexa rank> ?pv . ?pv <pred:value> \"126668.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the college of the University of Cambridge with an ARCHON code of 2938 also the one with an ARCHON code of 2938?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Cambridge\" . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"2938\" . ?e <ARCHON code> ?pv . ?pv <pred:value> \"2938\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the chemical compound have an ATC code of B03BB01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e <ATC code> ?pv_1 . ?pv_1 <pred:value> \"B03BB01\" . ?e <ATC code> ?pv . ?pv <pred:value> \"B03BB01\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an academic discipline with an ACM Classification Code (2012) of 10003633?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <ACM Classification Code (2012)> ?pv_1 . ?pv_1 <pred:value> \"10003633\" . ?e <ACM Classification Code (2012)> ?pv . ?pv <pred:value> \"10003633\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the television network with an Australian Business Number of 52429278345 also have an Australian Business Number of 52429278345?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television network\" . ?e <Australian Business Number> ?pv_1 . ?pv_1 <pred:value> \"52429278345\" . ?e <Australian Business Number> ?pv . ?pv <pred:value> \"52429278345\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an activity that has both \"portrait\" values for the Artsy gene?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Artsy gene> ?pv_1 . ?pv_1 <pred:value> \"portrait\" . ?e <Artsy gene> ?pv . ?pv <pred:value> \"portrait\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]