[{"question": "What is the IPv6 routing prefix for Vodafone (the one that was established on 1984-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vodafone\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1984-01-01\"^^xsd:date . ?e <IPv6_routing_prefix> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Hereafter\" that was published on 2010-10-22?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hereafter\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-10-22\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member of Cairo (the one published on 1942-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cairo\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1942-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Gabon (the one whose inception date is 1960-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gabon\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISIN of THQ (the one dissolved, abolished or demolished on 2013-01-23)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"THQ\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2013-01-23\"^^xsd:date . ?e <ISIN> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Malawi (the one whose inception date is 1964-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Malawi\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the position played on team/speciality of the person named Yuma (born on 1985-10-08)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Yuma\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1985-10-08\"^^xsd:date . ?e <position_played_on_team_/_speciality> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Tabu receive in 1931-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tabu\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1931-01-01\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the birth name of Napoleon (the one born on 1963-12-02)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Napoleon\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1963-12-02\"^^xsd:date . ?e <birth_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the PermID of Scranton (the one with an inception date of 1856-02-14)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Scranton\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1856-02-14\"^^xsd:date . ?e <PermID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of citizenship for Vivek (the one born on 1961-11-19)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vivek\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1961-11-19\"^^xsd:date . ?e <country_of_citizenship> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the person named Medina (born on 1982-11-30)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Medina\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1982-11-30\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Rent based on (the one published on 2005-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rent\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-01-01\"^^xsd:date . ?e <based_on> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Columbia (the one whose inception date is 1967-06-21)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Columbia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1967-06-21\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Indianapolis (the one whose inception date is 1821-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Indianapolis\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for Oasis (the one published on 2002-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Oasis\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2002-01-01\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Slash (the one born on 1965-07-23)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Slash\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1965-07-23\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of Muskogee (the one with an inception date of 1898-03-16)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Muskogee\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-03-16\"^^xsd:date . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for AC/DC (the one whose inception date is 1973-12-31)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"AC/DC\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1973-12-31\"^^xsd:date . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the publication with the name February and the publication date of 2003-02-14?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"February\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2003-02-14\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member of the movie \"Taken\" that ended on 2002-12-13?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Taken\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2002-12-13\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ARCHON code for EMI (the one dissolved, abolished or demolished on 2012-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"EMI\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2012-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the Greek (the one whose start time is 2007-07-09)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Greek\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2007-07-09\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of the Schutzstaffel (dissolved on 1945-05-08)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Schutzstaffel\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1945-05-08\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Govinda's Instagram username (the one born on 1963-12-21)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Govinda\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1963-12-21\"^^xsd:date . ?e <Instagram_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie Hancock (published on 2008-06-16)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hancock\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-06-16\"^^xsd:date . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Aisne (the one whose inception date is 1790-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aisne\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPI name number of Donovan (the one born on 1946-05-10)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Donovan\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1946-05-10\"^^xsd:date . ?e <IPI_name_number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person-institution in the British Museum related to Mozambique (which was established on 1975-06-25)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mozambique\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-06-25\"^^xsd:date . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of CNBC (the one whose inception date is 1989-04-17)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"CNBC\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1989-04-17\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Prussia (the one dissolved, abolished or demolished on 1947-02-25)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Prussia\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1947-02-25\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Petersburg (the one whose inception date is 1748-12-17)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Petersburg\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1748-12-17\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Funkadelic (the one whose inception date is 1968-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Funkadelic\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-01-01\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"300\" receive on April 4, 2007?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"300\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-04-04\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie Moon (published on 2009-01-23)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Moon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-23\"^^xsd:date . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the GSS code (2011) for Guildford (which was established on 1974-04-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Guildford\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e <GSS_code_(2011)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Hoboken (the one whose inception date is 1849-04-09)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hoboken\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1849-04-09\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for chiptune (which was created on 1978-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"chiptune\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Iceland (the one whose inception date is 1918-12-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Iceland\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-12-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie U-571 receive on September 14, 2000?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"U-571\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2000-09-14\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Guam become a FIPS 10-4 country or region?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Guam\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Jersey (the one with an inception date of 1651-12-12)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jersey\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1651-12-12\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Peru (the one whose inception date is 1821-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Peru\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the British Museum person-institution for McDonald's (which was founded on 1940-05-15)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"McDonald's\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1940-05-15\"^^xsd:date . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the genre of Malibu (published on 2017-05-11)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Malibu\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2017-05-11\"^^xsd:date . ?e <genre> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of Microsoft (the one whose inception date is 1975-04-04)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Microsoft\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-04-04\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Australia (published on 1989-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Australia\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1989-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie Collateral receive on 2004-08-05?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Collateral\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2004-08-05\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the TV show \"Damages\" receive on 2012-09-12?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Damages\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2012-09-12\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the China administrative division code for Xinjiang (which was established on 1955-10-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Xinjiang\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1955-10-01\"^^xsd:date . ?e <China_administrative_division_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for Atari (the one whose inception date is 1972-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Atari\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1972-01-01\"^^xsd:date . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Sicko receive on 2007-10-11?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sicko\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-10-11\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Rajasthan (which was established on 1949-03-30)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rajasthan\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1949-03-30\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the movie Splash (published on 1988-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Splash\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1988-01-01\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Goa (published on 2010-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Goa\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the director/manager of Lucasfilm (the one founded on 1971-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lucasfilm\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-01-01\"^^xsd:date . ?e <director/manager> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Jharkhand (which was established on 2000-11-15)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jharkhand\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2000-11-15\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie Argo receive on 2012-11-08?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Argo\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2012-11-08\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member of Silkwood (published in 1983-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Silkwood\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of the movie Psycho (published on 1960-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Psycho\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Heroes (published on 1977-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Heroes\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1977-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the mathcore genre (which was founded on 1988-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"mathcore\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1988-01-01\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Mammootty (the one born on 1951-11-07)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mammootty\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1951-11-07\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the radio show that was published on 2009-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Radio\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie Shame (published in 1968)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Shame\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1968-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Bugsy receive on 1992-03-12?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bugsy\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1992-03-12\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie Dogville (published on 2003-10-23)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dogville\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2003-10-23\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Ashanti (born on 1980-10-13) have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ashanti\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1980-10-13\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"ashanti\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the film Dresden (whose official website is http://www.dresden-der-film.de/)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Dresden\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dresden-der-film.de/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Julia (the one with an inception date of 2009-08-23) included in the Arch Linux package?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Julia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2009-08-23\"^^xsd:date . ?e <Arch\u00a0Linux_package> ?pv . ?pv <pred:value> \"julia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Arch\u00a0Linux_package> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person with the birth name Shamika Brown and the date of birth 1977-05-17, and is related to India?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"India\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1977-05-17\"^^xsd:date . ?e <birth_name> ?pv . ?pv <pred:value> \"Shamika Brown\" . [ <pred:fact_h> ?e ; <pred:fact_r> <birth_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the author of the book titled \"Bismarck\" (published on 1914-02-07)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bismarck\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1914-02-07\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Bismarck\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"edomex\" related to M\u00e9xico (which was established on 1823-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"M\u00e9xico\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1823-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"edomex\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the time of the earliest written record for Potsdam (the one with the German municipality key 12054000)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Potsdam\" . ?e <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"0993-07-03\"^^xsd:date . ?e <German_municipality_key> ?pv . ?pv <pred:value> \"12054000\" . [ <pred:fact_h> ?e ; <pred:fact_r> <German_municipality_key> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the author of the book \"Laura\" (published in 1944-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Laura\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1944-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Laura\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]