[
    {
        "question": "Is Jeddah's population 3.4 million and its elevation above sea level 12.0?",
        "sparql": "ASK { ?e <pred:name> Jeddah . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.4e+06\"^^xsd:double . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"12.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Syracuse 122086 and does it have a Dewey Decimal Classification of 2--458141?",
        "sparql": "ASK { ?e <pred:name> Syracuse . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"122086.0\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--458141\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Gloucestershire's FIPS 10-4 (countries and regions) code UKE6 and population 861700.0?",
        "sparql": "ASK { ?e <pred:name> Gloucestershire . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"861700.0\"^^xsd:double . ?e <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"UKE6\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Spokane's population 208,916 and its area 180.018?",
        "sparql": "ASK { ?e <pred:name> Spokane . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"208916.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"180.018\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Pittsfield have a population of 44737 and a local dialing code of 413?",
        "sparql": "ASK { ?e <pred:name> Pittsfield . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"44737.0\"^^xsd:double . ?e <local dialing code> ?pv . ?pv <pred:value> \"413\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Raleigh's population 439896 and its elevation above sea level 96.0?",
        "sparql": "ASK { ?e <pred:name> Raleigh . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"439896.0\"^^xsd:double . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"96.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Montenegro's FIPS 10-4 code MJ and its Human Development Index 0.792?",
        "sparql": "ASK { ?e <pred:name> Montenegro . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.792\"^^xsd:double . ?e <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"MJ\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Worcester 100,842 and does it have a TOID of 4000000074565458?",
        "sparql": "ASK { ?e <pred:name> Worcester . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"100842.0\"^^xsd:double . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074565458\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many literature works have a Dewey Decimal Classification of 820?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> literature . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"820\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many bobsleigh instances have an IPTC Newscode of \"mediatopic/20001055\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> bobsleigh . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20001055\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many superheroes have a catalog code of \"Anthony Stark (Earth-616)\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> superhero . ?e <catalog code> ?pv . ?pv <pred:value> \"Anthony Stark (Earth-616)\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many news instances have a number of episodes equal to 8779.0?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> news . ?e <number of episodes> ?pv . ?pv <pred:value> \"8779.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many announcers have a ROME Occupation Code (v3) of E1106?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> announcer . ?e <ROME Occupation Code (v3)> ?pv . ?pv <pred:value> \"E1106\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many sororities have the official website http://www.tridelta.org?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> sorority . ?e <official website> ?pv . ?pv <pred:value> \"http://www.tridelta.org\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What phenomenon has an IPTC Newscode of mediatopic/20000441 and is related to the subreddit \"nature\" with 47980 subscribers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> phenomenon . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000441\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"nature\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"47980.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What activity is associated with the Twitter usernames \"sonic hedgehog\" and \"sonic20th\" and has 31,585 subscribers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <Twitter username> ?pv . ?pv <pred:value> \"sonic hedgehog\" . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"31585.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Serbo-Croatian language with a Dewey Decimal Classification of 491.82 and 1.2e+07 speakers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Serbo-Croatian . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"491.82\" . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:value> \"1.2e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.2e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What disease has a DiseasesDB of 29089 and a number of deaths of 143000.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> disease . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"29089\" . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:value> \"143000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"143000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Chinese language with Glottolog code yuec1235 and 6.22216e+07 speakers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Chinese . ?e <Glottolog code> ?pv . ?pv <pred:value> \"yuec1235\" . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:value> \"6.22216e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6.22216e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which music subreddit has 281136.0 subscribers and is named \"kpop\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> music . ?e <subreddit> ?pv . ?pv <pred:value> \"kpop\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"kpop\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"281136.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which village has a WOEID of 2369745 and a population of 6323.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <WOEID> ?pv . ?pv <pred:value> \"2369745\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6323.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6323.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which state has a Dewey Decimal Classification of 2--476 and a Human Development Index of 0.597?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--476\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.597\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"0.597\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What cemetery is located at Avenue Samson, 37 and has 20000 graves?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> cemetery . ?e <located at street address (DEPRECATED)> ?pv . ?pv <pred:value> \"Avenue Samson, 37\" . ?e <number of graves> ?pv_1 . ?pv_1 <pred:value> \"20000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of graves> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"20000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the campus whose inception date is 1893-01-01 and official website is https://www.hopkinsmedicine.org/som/index.html called campus?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> campus . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1893-01-01\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"https://www.hopkinsmedicine.org/som/index.html\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the band with ISNI 0000 0001 1089 9660 formed on January 1st, 1969?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> band . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1969-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1089 9660\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a cemetery located at Avenue Samson, 37 that was established in 1825?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> cemetery . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e <located at street address (DEPRECATED)> ?pv . ?pv <pred:value> \"Avenue Samson, 37\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the road with the number US 66 end on 1985-06-27?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> road . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1985-06-27\"^^xsd:date . ?e <road number> ?pv . ?pv <pred:value> \"US 66\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a manga with an official website of http://tezukaosamu.net and a publication date of 1952-04-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> manga . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1952-04-01\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital city with an ISO 3166-2 code of CZ-PR that had 4787 employees on 2016-11-15?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <ISO 3166-2 code> ?pv_1 . ?pv_1 <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2016-11-15\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4787.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What conservatory has a short name of \"- \", started on 1991-09-24, and has 75 employees with a unit of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <short name> ?pv_1 . ?pv_1 <pred:value> \"- \" . [ <pred:fact_h> ?e ; <pred:fact_r> <short name> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1991-09-24\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"75.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "On November 28th, 2017, was the foundation with an Alexa rank of 29145.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> foundation . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"29145.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-28\"^^xsd:date . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29145.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What airline had 120262 employees on December 31, 2017 and 129424 employees at some point in time?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"129424.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-12-31\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"120262.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the newspaper's Alexa rank 117.0 on November 20th, 2017?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> newspaper . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What museum had a total revenue of 5.73753e+08 on January 1st, 2017 and had 6.7e+06 visitors per year?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <total revenue> ?pv_1 . ?pv_1 <pred:value> \"5.73753e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <total revenue> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-01-01\"^^xsd:date . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.7e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of the country with NUTS code UKM, which started on 1999-01-01 and has a population of 5.3136e+06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <NUTS code> ?pv_1 . ?pv_1 <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS code> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1999-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.3136e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the manifestation with an Alexa rank of 112.0 on 2017-11-20, whose current Alexa rank is 117.0, an instance of manifestation?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the population of the city/town on January 1st, 2014, if its population was 757594.0 on a different point in time?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"758400.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"757594.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Caverphone code for the person named Alexander (whose native label is also Alexander)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Alexander . ?e <native label> ?pv_1 . ?pv_1 <pred:value> Alexander . ?e <Caverphone> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the CANTIC-ID of the work titled Kinsey?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Kinsey . ?e <title> ?pv_1 . ?pv_1 <pred:value> Kinsey . ?e <CANTIC-ID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a cast member in Arcadia?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Arcadia . ?e <title> ?pv_1 . ?pv_1 <pred:value> Arcadia . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Libya's subreddit?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Libya . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> Libya . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a cast member in Santiago and has the title Santiago?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Santiago . ?e <title> ?pv_1 . ?pv_1 <pred:value> Santiago . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Ulm (the one whose official name is also Ulm)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Ulm . ?e <official name> ?pv_1 . ?pv_1 <pred:value> Ulm . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification for the subreddit named feminism?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> feminism . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> feminism . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of Viacom (the one with a Twitter username of Viacom)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Viacom . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> Viacom . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of CNBC (the one with a Twitter username of CNBC)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> CNBC . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> CNBC . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Guinea-Bissau (the one whose official name is also Guinea-Bissau)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Guinea-Bissau . ?e <official name> ?pv_1 . ?pv_1 <pred:value> Guinea-Bissau . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]