[{"question": "What is the connection between Malawi (the one with a Human Development Index of 0.42) and Malawi (the one with an inception date of 1964-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Malawi\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.42\"^^xsd:double . ?e_2 <pred:name> \"Malawi\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Munich (the one with a female population of 35859.0) and Munich (the one with a time of earliest written record of 1158-06-14)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Munich\" . ?e_1 <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"35859.0\"^^xsd:double . ?e_2 <pred:name> \"Munich\" . ?e_2 <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"1158-06-14\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Burundi (the one whose Human Development Index is 0.328) and Burundi (the one whose inception date is 1962-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Burundi\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.328\"^^xsd:double . ?e_2 <pred:name> \"Burundi\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Peru (the one with a Human Development Index of 0.6) and Peru (the one with an inception date of 1821-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peru\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.6\"^^xsd:double . ?e_2 <pred:name> \"Peru\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Madagascar (the one with a Human Development Index of 0.505) and Madagascar (the one with an inception date of 1960-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Madagascar\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.505\"^^xsd:double . ?e_2 <pred:name> \"Madagascar\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Laos (the one whose Human Development Index is 0.462) and Laos (the one whose inception date is 1949-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Laos\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.462\"^^xsd:double . ?e_2 <pred:name> \"Laos\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1949-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Albania (the one with a Human Development Index of 0.674) and Albania (the one with an inception date of 1912-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Albania\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.674\"^^xsd:double . ?e_2 <pred:name> \"Albania\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Saxony (the one with a population of 5.6828e+06) and Saxony (the one with an inception date of 1990-10-03)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saxony\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.6828e+06\"^^xsd:double . ?e_2 <pred:name> \"Saxony\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-10-03\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Haiti (the one with a Human Development Index of 0.422) and Haiti (the one with an inception date of 1804-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Haiti\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.422\"^^xsd:double . ?e_2 <pred:name> \"Haiti\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1804-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Australia (the one with a Human Development Index of 0.932) and Australia (the one with an inception date of 1901-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Australia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.932\"^^xsd:double . ?e_2 <pred:name> \"Australia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1901-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Atlanta (the one with 21.0 number of episodes) and Atlanta (the one with an inception date of 1845-12-29)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Atlanta\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"21.0\"^^xsd:double . ?e_2 <pred:name> \"Atlanta\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1845-12-29\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Canada (the one whose Human Development Index is 0.861) and Canada (the one whose inception date is 1867-07-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Canada\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.861\"^^xsd:double . ?e_2 <pred:name> \"Canada\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Belize (the one with a Human Development Index of 0.715) and Belize (the one with an inception date of 1981-09-21)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Belize\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.715\"^^xsd:double . ?e_2 <pred:name> \"Belize\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1981-09-21\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Armenia (the one with a Human Development Index of 0.721) and Armenia (the one with an inception date of 1991-09-23)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Armenia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.721\"^^xsd:double . ?e_2 <pred:name> \"Armenia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-09-23\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Iran (the one with a Human Development Index of 0.766) and Iran (the one with an inception date of 1979-04-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Iran\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.766\"^^xsd:double . ?e_2 <pred:name> \"Iran\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1979-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Chile (the one with a Human Development Index of 0.699) and Chile (the one with an inception date of 1818-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chile\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.699\"^^xsd:double . ?e_2 <pred:name> \"Chile\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1818-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Rochdale (the one with a population of 110194.0) and Rochdale (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rochdale\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"110194.0\"^^xsd:double . ?e_2 <pred:name> \"Rochdale\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Syria (the one with a Human Development Index of 0.586) and Syria (the one with an inception date of 1920-03-08)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Syria\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.586\"^^xsd:double . ?e_2 <pred:name> \"Syria\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1920-03-08\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Lithuania (the one with a Human Development Index of 0.831) and Lithuania (the one with an inception date of 1918-02-16)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lithuania\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.831\"^^xsd:double . ?e_2 <pred:name> \"Lithuania\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-02-16\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Angola (the one with a Human Development Index of 0.401) and Angola (the one with an inception date of 1975-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Angola\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.401\"^^xsd:double . ?e_2 <pred:name> \"Angola\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Cuba (the one with a Human Development Index of 0.685) and Cuba (the one with an inception date of 1898-12-10)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cuba\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.685\"^^xsd:double . ?e_2 <pred:name> \"Cuba\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-12-10\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Djibouti (the one with a population of 562,000) and Djibouti (the one with an inception date of 1977-06-23)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Djibouti\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"562000.0\"^^xsd:double . ?e_2 <pred:name> \"Djibouti\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1977-06-23\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Alpes-Maritimes (the one with an annual number of weddings of 964.0) and Alpes-Maritimes (the one with an inception date of 1793-02-04)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alpes-Maritimes\" . ?e_1 <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"964.0\"^^xsd:double . ?e_2 <pred:name> \"Alpes-Maritimes\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1793-02-04\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guadalajara (the one with a population of 83039.0) and Guadalajara (the one with an inception date of 1542-11-30)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guadalajara\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"83039.0\"^^xsd:double . ?e_2 <pred:name> \"Guadalajara\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1542-11-30\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between India (the one with a Human Development Index of 0.496) and India (the one with an inception date of 1947-08-15)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"India\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.496\"^^xsd:double . ?e_2 <pred:name> \"India\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-08-15\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which facility has an ARCHON code of 345?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"345\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is related to the topic \"philosophy-of-mind\" in the field of philosophy according to PhilPapers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <PhilPapers_topic> ?pv . ?pv <pred:value> \"philosophy-of-mind\" . ?e <PhilPapers_topic> ?pv_1 . ?pv_1 <pred:value> \"philosophy-of-mind\" . [ <pred:fact_h> ?e ; <pred:fact_r> <PhilPapers_topic> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"philosophy-of-mind\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which island has an ISO 3166-2 code of NZ-S?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"NZ-S\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"NZ-S\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which animal has a native label of \"Northern Dancer\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animal\" . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which landform has an ISO 3166-2 code of NZ-S?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"NZ-S\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"NZ-S\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which business has the official website http://www.cammell-laird.com/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cammell-laird.com/\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cammell-laird.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.cammell-laird.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which restaurant has the OSM tag or key \"Tag:shop=deli\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"restaurant\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:shop=deli\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:shop=deli\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Tag:shop=deli\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which chemist has an ISCO occupation code of 2212?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemist\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2212\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the IAB code 548 and the OSM tag or key \"Tag:sport=beachvolleyball\" in the context of volleyball?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"volleyball\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"548\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:sport=beachvolleyball\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Tag:sport=beachvolleyball\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has the Glottolog code \"fili1244\" for Tagalog?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"fili1244\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"fili1244\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"fili1244\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the ICD-10 code \"R10\" and the name \"pain\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pain\" . ?e <ICD-10> ?pv . ?pv <pred:value> \"R10\" . ?e <ICD-10> ?pv_1 . ?pv_1 <pred:value> \"R10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ICD-10> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"R10\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a homicide with a Dewey Decimal Classification of 364.66 and an IPTC Newscode of mediatopic/20000135?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"homicide\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"364.66\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000135\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000135\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name of the speaker who has the native label \"Speaker of the United States House of Representatives\" and an official website of \"http://www.speaker.gov/\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <native_label> ?pv . ?pv <pred:value> \"Speaker of the United States House of Representatives\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.speaker.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.speaker.gov/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under the name \"mathematics\" and has a Classification of Instructional Programs code of 27.0301?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematics\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"27.0301\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"27.0301\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Classification_of_Instructional_Programs_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"27.0301\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is related to the travel category and has an IAB code of 672?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"travel\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"672\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"672\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"672\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the IAB code 368 in the category of music?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"368\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"368\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"368\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has DiseasesDB value of 11890 for psychosis?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"psychosis\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"11890\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"11890\" . [ <pred:fact_h> ?e ; <pred:fact_r> <DiseasesDB> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"11890\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which medication has a MeSH Code of D27.505.954.427.040 and a UMLS CUI of C0002771?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <MeSH_Code> ?pv . ?pv <pred:value> \"D27.505.954.427.040\" . ?e <UMLS_CUI> ?pv_1 . ?pv_1 <pred:value> \"C0002771\" . [ <pred:fact_h> ?e ; <pred:fact_r> <UMLS_CUI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"C0002771\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity belongs to the LGBT category and has a Dewey Decimal Classification of 306.7663?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.7663\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"306.7663\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which actor has a NOC Occupation Code of 5232 and a ROME Occupation Code (v3) of L1204?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"actor\" . ?e <NOC_Occupation_Code> ?pv . ?pv <pred:value> \"5232\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"L1204\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"L1204\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which medal has the official website \"http://www.ras.org.uk/awards-and-grants/awards\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the technology with a Classification of Instructional Programs code of 11.0103 and a pronunciation audio in French?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"technology\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"11.0103\" . ?e <pronunciation_audio> ?pv_1 . ?pv_1 <pred:value> \"LL-Q150 (fra)-X-Javier-technologie de l'information.wav\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"French\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an official website of \"https://www.treasury.gov/about/Pages/Secretary.aspx\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a synthesizer according to the Hornbostel-Sachs classification?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"synthesizer\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"54\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"54\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"54\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which disco has a subreddit called \"italodisco\" and the language of its subreddit is English?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <subreddit> ?pv . ?pv <pred:value> \"italodisco\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under \"Christianity\" with a Library of Congress Classification of BR1644-1644.7?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Library_of_Congress_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has the title \"Iron Man 2\" and is also a soundtrack?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <title> ?pv . ?pv <pred:value> \"Iron Man 2\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Iron Man 2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]