[{"question": "How many subscribers does the association with 80.0 employees and a Twitter username of royalacademy have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"royalacademy\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the news organization with a Twitter username of TODAYshow have, if they have 66.0 seasons and each season is 1 unit?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"66.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the software with an Alexa rank of 1.0 and a Twitter username of Google have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Google\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the university with 500 employees and an official website of http://www.cca.edu?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"500.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cca.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the landform with an ISO 3166-2 code of NZ-N and a population of 3.5198e+06 end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.5198e+06\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"NZ-N\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the Malay language stop having 4.3e+07 speakers?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.3e+07\"^^xsd:double . ?e <ISO_639-1_code> ?pv . ?pv <pred:value> \"in\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_639-1_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the https://wikimediafoundation.org/ website regarding the foundation with an Alexa rank of 29145.0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29145.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"https://wikimediafoundation.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What part does the Byzantin demonym apply to in the empire with a population of 3.4e+07?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.4e+07\"^^xsd:double . ?e <demonym> ?pv . ?pv <pred:value> \"Byzantin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the number of seats for the manifestation with an official name of \"Legislative Assembly of Ontario\" and has 107.0 seats?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <number_of_seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107.0\"^^xsd:double . ?e <official_name> ?pv . ?pv <pred:value> \"Legislative Assembly of Ontario\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Ryanair (the airline with 13000.0 employees) have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13000.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Ryanair\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the organization with ISNI 0000 0001 2172 7549 have 80.0 seats?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2172 7549\" . ?e <number_of_seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_seats> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"80.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a democracy with a British Museum person-institution value of 180889 and a Human Development Index value of 0.424?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.424\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Human_Development_Index> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0.424\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a medal with a native label of \"Medal of Honor\" and a quantity of 3493.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Medal of Honor\" . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3493.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <quantity> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"3493.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an activity with an Instagram username of \"seriea\", 20 participants, and a number of participants equal to 20.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"seriea\" . ?e <number_of_participants> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_participants> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"20.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a town with an OS grid reference of TQ315065 and a population of 160,000?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ315065\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"160000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"160000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 6.22216e+07 Chinese speakers with a Glottolog code of yuec1235?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Chinese\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"yuec1235\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.22216e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6.22216e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an island with an ISO 3166-2 code of NZ-S and a population of 1.1158e+06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1158e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.1158e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a metropolis with a Dewey Decimal Classification of 2--71428 and a population of 1.64952e+06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--71428\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.64952e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.64952e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a village with a WOEID of 2369745 and a population of 6323.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2369745\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6323.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6323.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city/town with a Dewey Decimal Classification of 2--4779 and a population of 758400.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4779\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"758400.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"758400.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a war with a number of deaths equal to 1.7e+07?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:value> \"1.7e+07\" . ?e <number_of_deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.7e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_deaths> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.7e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a capital city with a Dewey Decimal Classification of 2--43712 and 4787 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43712\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4787.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"4787.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a country with a British Museum person-institution value of 114921 and a population of 5.3136e+06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"114921\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.3136e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"5.3136e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a stop-motion instance with 56.0 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"stop-motion\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"56.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the college with ISNI 0000 0001 2110 961X projected to have 2023 employees in 2023?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2110 961X\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2023.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2023.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anthology with an OCLC control number of 357792 and a number of pages equal to 218.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . ?e <number_of_pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_pages> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"218.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a song with an ISWC of T-070.017.986-7 and a beats per minute of 96.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-070.017.986-7\" . ?e <beats_per_minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"96.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <beats_per_minute> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"96.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a miniseries with 6 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"6.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the animation have 56 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animation\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"56.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a comedy with exactly 25 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"25.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"25.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a neighborhood with an elevation above sea level of 242.0 and a population of 68469.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:value> \"242.0\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"68469.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"68469.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the army with ISNI 0000 0004 0498 1870 have 1,129,900 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0498 1870\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1299e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.1299e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a cemetery located at Avenue Samson, 37 with 20000 graves?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <located_at_street_address_(DEPRECATED)> ?pv_1 . ?pv_1 <pred:value> \"Avenue Samson, 37\" . ?e <number_of_graves> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_graves> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"20000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a film with a box office of 8.96911e+08?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <box_office> ?pv_1 . ?pv_1 <pred:value> \"8.96911e+08\" . ?e <box_office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <box_office> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"8.96911e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the newscast with an Instagram username of todayshow and 66.0 seasons equal to 66.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_seasons> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"66.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a state with a Dewey Decimal Classification of 2--476 and a Human Development Index of 0.649?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--476\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.649\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Human_Development_Index> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0.649\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Tagalog have 9e+07 speakers and a Glottolog code of fili1244?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"fili1244\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"9e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a genre with an OCLC control number of 357792 and a number of pages equal to 218.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . ?e <number_of_pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_pages> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"218.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a business with 500 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"500.0\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"500.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the school with ISNI 0000 0001 2322 6561 have a student count of 4962?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2322 6561\" . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4962.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"4962.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the religion with a Dewey Decimal Classification of 294.4, a population of 3.35271e+06, and located in India?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"294.4\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.35271e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <location> ?qpv . ?qpv <pred:value> \"India\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the industry with a duration of 30.0 and 1447.0 number of episodes have a fact?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"30.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1447.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1447.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the award with the native label \"The Royal Victorian Chain\" and a quantity of 84.0 equal to 84.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"The Royal Victorian Chain\" . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"84.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <quantity> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"84.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the museum with an ARCHON code of 345 have 6.41672e+06 visitors per year?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.41672e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors_per_year> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6.41672e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many deaths are there from the disease with DiseasesDB ID 29089?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"29089\" . ?e <number_of_deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"143000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_deaths> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"143000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a medication with a CAS Registry Number of 7439-89-6 and an atomic number of 26.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <CAS_Registry_Number> ?pv_1 . ?pv_1 <pred:value> \"7439-89-6\" . ?e <atomic_number> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"26.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <atomic_number> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"26.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the person who is a human and has a British Museum person-institution value of 17780 have 2 children?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"17780\" . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_children> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a conservatory with an ISNI of 0000 0001 1140 6100 that has 40 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1140 6100\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"40.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"40.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the number of speakers of Serbo-Croatian equal to 1.2e+07 and its Dewey Decimal Classification 491.82?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"491.82\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.2e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.2e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an association with an ARCHON code of 397, 80 employees, and an employee value of 80.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"397\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"80.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the news with an Instagram username of todayshow and 66.0 seasons equal to 66.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_seasons> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"66.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city with an elevation above sea level of 50.0 and a population of 163,000?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:value> \"50.0\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"163000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"163000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]