[{"question": "Does the university with ISNI 0000 0001 2288 3033 have 500 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2288 3033\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"500.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a landform in New Zealand with an ISO 3166-2 code of NZ-S and a population of 1,115,800?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1158e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.1158e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the Malay language have 4.3e+07 speakers?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <Ethnologue.com_language_code> ?pv_1 . ?pv_1 <pred:value> \"ind\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.3e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"4.3e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an empire with a population of 3.4e+07 and an OSM tag or key of Tag:historic:civilization=byzantine?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:historic:civilization=byzantine\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.4e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"3.4e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the facility with an ARCHON code of 345 have 6.41672e+06 visitors per year?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.41672e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors_per_year> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6.41672e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manifestation with 107.0 number of constituencies and 107.0 number of seats?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <number_of_constituencies> ?pv_1 . ?pv_1 <pred:value> \"107.0\" . ?e <number_of_seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"107.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_seats> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"107.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the airline with IATA airline designator FR have 13000 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <IATA_airline_designator> ?pv_1 . ?pv_1 <pred:value> \"FR\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"13000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Singapore?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Singapore\" . ?e_2 <pred:name> \"Singapore\" . ?e_1 <capital_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital_of> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Fairfield named after?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Fairfield\" . ?e_2 <pred:name> \"Fairfield\" . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Argentina?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Argentina\" . ?e_2 <pred:name> \"Argentina\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who owns Burlington?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Burlington\" . ?e_2 <pred:name> \"Burlington\" . ?e_1 <owned_by> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <owned_by> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country that Austria-Hungary is a part of?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Austria-Hungary\" . ?e_2 <pred:name> \"Austria-Hungary\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who developed Havok?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Havok\" . ?e_2 <pred:name> \"Havok\" . ?e_1 <developer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <developer> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the performer of Spider-Man in Spider-Man?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Spider-Man\" . ?e_2 <pred:name> \"Spider-Man\" . ?e_1 <present_in_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <present_in_work> ; <pred:fact_t> ?e_2 ] <performer> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Botswana?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Botswana\" . ?e_2 <pred:name> \"Botswana\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Manchester start being located in Manchester?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Manchester\" . ?e_2 <pred:name> \"Manchester\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the cause of the difference between Tokyo and Tokyo?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tokyo\" . ?e_2 <pred:name> \"Tokyo\" . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <has_cause> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Turkmenistan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Turkmenistan\" . ?e_2 <pred:name> \"Turkmenistan\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Namibia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Namibia\" . ?e_2 <pred:name> \"Namibia\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Cambodia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cambodia\" . ?e_2 <pred:name> \"Cambodia\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What follows Limitless?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Limitless\" . ?e_2 <pred:name> \"Limitless\" . ?e_1 <followed_by> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <followed_by> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Manhattan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Manhattan\" . ?e_2 <pred:name> \"Manhattan\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Switzerland?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Switzerland\" . ?e_2 <pred:name> \"Switzerland\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Hawaii?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hawaii\" . ?e_2 <pred:name> \"Hawaii\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Virginia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Virginia\" . ?e_2 <pred:name> \"Virginia\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Bremen?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bremen\" . ?e_2 <pred:name> \"Bremen\" . ?e_1 <capital_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital_of> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the series ordinal of the character Pocahontas in the series Pocahontas?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pocahontas\" . ?e_2 <pred:name> \"Pocahontas\" . ?e_1 <characters> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <characters> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Norwich?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Norwich\" . ?e_2 <pred:name> \"Norwich\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the difference between two entities named Brittany?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brittany\" . ?e_2 <pred:name> \"Brittany\" . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Paris?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Paris\" . ?e_2 <pred:name> \"Paris\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the series ordinal of the characters Hercules and Hercules?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hercules\" . ?e_2 <pred:name> \"Hercules\" . ?e_1 <characters> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <characters> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Grimsby?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Grimsby\" . ?e_2 <pred:name> \"Grimsby\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the narrative location of California occur in California?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"California\" . ?e_2 <pred:name> \"California\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the twinned administrative body of Portsmouth?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Portsmouth\" . ?e_2 <pred:name> \"Portsmouth\" . ?e_1 <twinned_administrative_body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned_administrative_body> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity that Falkirk is located in?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Falkirk\" . ?e_2 <pred:name> \"Falkirk\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the difference between two entities named Gujarat?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Gujarat\" . ?e_2 <pred:name> \"Gujarat\" . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Detroit?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Detroit\" . ?e_2 <pred:name> \"Detroit\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who owns Google?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Google\" . ?e_2 <pred:name> \"Google\" . ?e_1 <owned_by> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <owned_by> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Bournemouth?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bournemouth\" . ?e_2 <pred:name> \"Bournemouth\" . ?e_1 <capital_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital_of> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the filming location of Atlanta?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Atlanta\" . ?e_2 <pred:name> \"Atlanta\" . ?e_1 <filming_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <filming_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Goa?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Goa\" . ?e_2 <pred:name> \"Goa\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Ukraine?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ukraine\" . ?e_2 <pred:name> \"Ukraine\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Pittsburgh?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Pittsburgh\" . ?e_2 <pred:name> \"Pittsburgh\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Canberra named after?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Canberra\" . ?e_2 <pred:name> \"Canberra\" . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the postal code of the headquarters location of Brno?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brno\" . ?e_2 <pred:name> \"Brno\" . ?e_1 <headquarters_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters_location> ; <pred:fact_t> ?e_2 ] <postal_code> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity that Kent is located in?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kent\" . ?e_2 <pred:name> \"Kent\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Antarctica?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Antarctica\" . ?e_2 <pred:name> \"Antarctica\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the derivative work of the movie \"Up\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Up\" . ?e_2 <pred:name> \"Up\" . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What follows Saxony-Anhalt?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Saxony-Anhalt\" . ?e_2 <pred:name> \"Saxony-Anhalt\" . ?e_1 <follows> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <follows> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Blackpool?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Blackpool\" . ?e_2 <pred:name> \"Blackpool\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What follows Brandenburg?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brandenburg\" . ?e_2 <pred:name> \"Brandenburg\" . ?e_1 <follows> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <follows> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Salzburg?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Salzburg\" . ?e_2 <pred:name> \"Salzburg\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Turkey?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Turkey\" . ?e_2 <pred:name> \"Turkey\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Brazil start being a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brazil\" . ?e_2 <pred:name> \"Brazil\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Groningen stop being located in the administrative territorial entity Groningen?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Groningen\" . ?e_2 <pred:name> \"Groningen\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Dallas?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dallas\" . ?e_2 <pred:name> \"Dallas\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the derivative work of Tommy?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tommy\" . ?e_2 <pred:name> \"Tommy\" . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity that Jamaica is located in?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jamaica\" . ?e_2 <pred:name> \"Jamaica\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity that Essex is located in?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Essex\" . ?e_2 <pred:name> \"Essex\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Aachen start being located in the administrative territorial entity Aachen?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Aachen\" . ?e_2 <pred:name> \"Aachen\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Malta become a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Malta\" . ?e_2 <pred:name> \"Malta\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Bradford start being located in the administrative territorial entity of Bradford?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bradford\" . ?e_2 <pred:name> \"Bradford\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the series ordinal of the movie Rocky in the Rocky series?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Rocky\" . ?e_2 <pred:name> \"Rocky\" . ?e_1 <part_of_the_series> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Taunton named after?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Taunton\" . ?e_2 <pred:name> \"Taunton\" . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Tacoma?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tacoma\" . ?e_2 <pred:name> \"Tacoma\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the derivative work of Zodiac?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Zodiac\" . ?e_2 <pred:name> \"Zodiac\" . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the programming language that Python is a programming language of?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Python\" . ?e_2 <pred:name> \"Python\" . ?e_1 <programming_language> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <programming_language> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Brooklyn?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brooklyn\" . ?e_2 <pred:name> \"Brooklyn\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]