[{"question": "Does NBC have a Twitter username of \"NBC\" and employ 7000 people?", "sparql": "ASK { ?e <pred:name> \"NBC\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"NBC\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Melbourne 3.99998e+06?", "sparql": "ASK { ?e <pred:name> \"Melbourne\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Melbourne\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.99998e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Macau have a subreddit named \"Macau\" and a number of out-of-school children equal to 14191.0?", "sparql": "ASK { ?e <pred:name> \"Macau\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Macau\" . ?e <number_of_out-of-school_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"14191.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Worcester 100,842?", "sparql": "ASK { ?e <pred:name> \"Worcester\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Worcester\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"100842.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the TV show \"Oz\" titled \"Oz\" and has 56 episodes?", "sparql": "ASK { ?e <pred:name> \"Oz\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Oz\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Lexington 295,803?", "sparql": "ASK { ?e <pred:name> \"Lexington\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Lexington\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"295803.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Seinfeld have a title equal to \"Seinfeld\" and a number of episodes equal to 180.0?", "sparql": "ASK { ?e <pred:name> \"Seinfeld\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Seinfeld\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"180.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Jamaica have a native label equal to \"Jamaica\" and a Human Development Index of 0.648?", "sparql": "ASK { ?e <pred:name> \"Jamaica\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Jamaica\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.648\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Superman have a title of \"Superman\" and a number of episodes equal to 13.0?", "sparql": "ASK { ?e <pred:name> \"Superman\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Superman\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Aachen 23413?", "sparql": "ASK { ?e <pred:name> \"Aachen\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Aachen\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"23413.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Austin have a subreddit with the value \"Austin\" and a population of 912,791?", "sparql": "ASK { ?e <pred:name> \"Austin\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Austin\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"912791.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Rouen 110169?", "sparql": "ASK { ?e <pred:name> \"Rouen\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"Rouen\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"110169.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Scotland have a native label equal to \"Scotland\" and a population of 5.3136e+06?", "sparql": "ASK { ?e <pred:name> \"Scotland\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Scotland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.3136e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nevada have a subreddit with the value \"Nevada\" and a population of 488,738?", "sparql": "ASK { ?e <pred:name> \"Nevada\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Nevada\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"488738.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Emilia-Romagna equal to \"Emilia-Romagna\" and does it have a Human Development Index of 0.909?", "sparql": "ASK { ?e <pred:name> \"Emilia-Romagna\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Emilia-Romagna\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.909\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Mauritania have a subreddit named \"Mauritania\" and a Human Development Index of 0.362?", "sparql": "ASK { ?e <pred:name> \"Mauritania\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Mauritania\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.362\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Joliet 152,812?", "sparql": "ASK { ?e <pred:name> \"Joliet\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Joliet\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"152812.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Darwin 127,532?", "sparql": "ASK { ?e <pred:name> \"Darwin\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Darwin\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"127532.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Redding equal to 89861.0?", "sparql": "ASK { ?e <pred:name> \"Redding\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Redding\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"89861.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Pasadena 137,122?", "sparql": "ASK { ?e <pred:name> \"Pasadena\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Pasadena\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"137122.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Kent 1.7314e+06?", "sparql": "ASK { ?e <pred:name> \"Kent\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Kent\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.7314e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Luton equal to 184900?", "sparql": "ASK { ?e <pred:name> \"Luton\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Luton\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"184900.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ethiopia have a subreddit and a Human Development Index of 0.423?", "sparql": "ASK { ?e <pred:name> \"Ethiopia\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Ethiopia\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.423\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Reading equal to 89893?", "sparql": "ASK { ?e <pred:name> \"Reading\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Reading\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"89893.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Taiwan 23,508,400?", "sparql": "ASK { ?e <pred:name> \"Taiwan\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Taiwan\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.35084e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Sydney 500,000?", "sparql": "ASK { ?e <pred:name> \"Sydney\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Sydney\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Latin the short name for a language with 100.0 speakers?", "sparql": "ASK { ?e <pred:name> \"Latin\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"Latin\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"100.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Oregon have a subreddit with the value \"Oregon\" and a population of 953,786?", "sparql": "ASK { ?e <pred:name> \"Oregon\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Oregon\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"953786.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Berlin 7000?", "sparql": "ASK { ?e <pred:name> \"Berlin\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Berlin\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Somerset 940,200?", "sparql": "ASK { ?e <pred:name> \"Somerset\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Somerset\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"940200.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Ravenna 159039?", "sparql": "ASK { ?e <pred:name> \"Ravenna\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Ravenna\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"159039.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Canada have a native label equal to \"Canada\" and a Human Development Index of 0.861?", "sparql": "ASK { ?e <pred:name> \"Canada\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Canada\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.861\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Idaho have a subreddit with the value \"Idaho\" and a population of 712,567?", "sparql": "ASK { ?e <pred:name> \"Idaho\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Idaho\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"712567.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Waukesha have a subreddit named \"Waukesha\" and a population of 70718.0?", "sparql": "ASK { ?e <pred:name> \"Waukesha\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Waukesha\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"70718.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 1.5 million speakers of Scots?", "sparql": "ASK { ?e <pred:name> \"Scots\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Scots\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.5e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Brandenburg have a native label equal to \"Brandenburg\" and a population of 2.725e+06?", "sparql": "ASK { ?e <pred:name> \"Brandenburg\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Brandenburg\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.725e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the number of households in Eindhoven equal to 110087.0?", "sparql": "ASK { ?e <pred:name> \"Eindhoven\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Eindhoven\" . ?e <number_of_households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"110087.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the show \"Missing\" have a title and 55.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Missing\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Missing\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"55.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bavaria have a short name of \"Bavaria\" and a population of 9.18447e+06?", "sparql": "ASK { ?e <pred:name> \"Bavaria\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"Bavaria\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9.18447e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Indonesia have a Twitter hashtag of \"Indonesia\" and a Human Development Index of 0.671?", "sparql": "ASK { ?e <pred:name> \"Indonesia\" . ?e <Twitter_hashtag> ?pv_1 . ?pv_1 <pred:value> \"Indonesia\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.671\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Barcelona have a native label equal to \"Barcelona\" and a number of households equal to 6166.0?", "sparql": "ASK { ?e <pred:name> \"Barcelona\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Barcelona\" . ?e <number_of_households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6166.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Aberdeen 222,793?", "sparql": "ASK { ?e <pred:name> \"Aberdeen\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Aberdeen\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"222793.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Sialkot have a native label equal to \"Sialkot\" and a population of 920,000?", "sparql": "ASK { ?e <pred:name> \"Sialkot\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Sialkot\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"920000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Gary equal to 15802?", "sparql": "ASK { ?e <pred:name> \"Gary\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Gary\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"15802.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Ankara \"Ankara\" and does it have a population of 5.50398e+06?", "sparql": "ASK { ?e <pred:name> \"Ankara\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Ankara\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.50398e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Yukon 36589?", "sparql": "ASK { ?e <pred:name> \"Yukon\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Yukon\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"36589.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Oxford 152,000?", "sparql": "ASK { ?e <pred:name> \"Oxford\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Oxford\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"152000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Dijon 151,576?", "sparql": "ASK { ?e <pred:name> \"Dijon\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Dijon\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"151576.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Sunderland 174,286?", "sparql": "ASK { ?e <pred:name> \"Sunderland\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Sunderland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"174286.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Mashhad have a subreddit named \"Mashhad\" and a population of 1,559,160?", "sparql": "ASK { ?e <pred:name> \"Mashhad\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Mashhad\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.55916e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Provo equal to 112,488?", "sparql": "ASK { ?e <pred:name> \"Provo\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Provo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"112488.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Kassel 195,422?", "sparql": "ASK { ?e <pred:name> \"Kassel\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Kassel\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"195422.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Riyadh have a subreddit and a population of 8.0021e+06?", "sparql": "ASK { ?e <pred:name> \"Riyadh\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Riyadh\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.0021e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Brunei have a demonym of Brunei and a Human Development Index of 0.819?", "sparql": "ASK { ?e <pred:name> \"Brunei\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Brunei\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.819\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Tupelo 33988?", "sparql": "ASK { ?e <pred:name> \"Tupelo\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Tupelo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33988.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Scranton equal to 76089.0?", "sparql": "ASK { ?e <pred:name> \"Scranton\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Scranton\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"76089.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Denmark have a subreddit named \"Denmark\" and a Human Development Index of 0.9?", "sparql": "ASK { ?e <pred:name> \"Denmark\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Denmark\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.9\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Illinois have a subreddit with the value \"Illinois\" and a population of 12,860,000?", "sparql": "ASK { ?e <pred:name> \"Illinois\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Illinois\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.286e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hamburg 271,000?", "sparql": "ASK { ?e <pred:name> \"Hamburg\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Hamburg\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"271000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pittsburgh have a native label equal to \"Pittsburgh\" and a population of 305,704?", "sparql": "ASK { ?e <pred:name> \"Pittsburgh\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Pittsburgh\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"305704.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nepal have a subreddit and a Human Development Index of 0.531?", "sparql": "ASK { ?e <pred:name> \"Nepal\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Nepal\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.531\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nebraska have a subreddit and a population of 1,483,490?", "sparql": "ASK { ?e <pred:name> \"Nebraska\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Nebraska\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.48349e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Gironde have a native label equal to \"Gironde\" and an annual number of weddings equal to 5553?", "sparql": "ASK { ?e <pred:name> \"Gironde\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Gironde\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5553.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Duisburg 486,855?", "sparql": "ASK { ?e <pred:name> \"Duisburg\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Duisburg\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"486855.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Blackpool 142,100?", "sparql": "ASK { ?e <pred:name> \"Blackpool\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Blackpool\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"142100.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Alton have a subreddit and a population of 30496?", "sparql": "ASK { ?e <pred:name> \"Alton\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Alton\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"30496.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Thor have a title of \"Thor\" and an attendance of 1,184,550?", "sparql": "ASK { ?e <pred:name> \"Thor\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Thor\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.18455e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is eBay's Twitter username \"eBay\" and Alexa rank 42.0?", "sparql": "ASK { ?e <pred:name> \"eBay\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"eBay\" . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"42.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Durham 6679.0?", "sparql": "ASK { ?e <pred:name> \"Durham\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Durham\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6679.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Brooklyn have a subreddit named \"Brooklyn\" and a population of 2,509,590?", "sparql": "ASK { ?e <pred:name> \"Brooklyn\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Brooklyn\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.50959e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Eminem have 3 children?", "sparql": "ASK { ?e <pred:name> \"Eminem\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Eminem\" . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Istanbul 12,573,800?", "sparql": "ASK { ?e <pred:name> \"Istanbul\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Istanbul\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.25738e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Memphis 646,889?", "sparql": "ASK { ?e <pred:name> \"Memphis\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Memphis\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"646889.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Mississippi have a subreddit with the value \"Mississippi\" and a population of 2.52064e+06?", "sparql": "ASK { ?e <pred:name> \"Mississippi\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Mississippi\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.52064e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hilo 40759?", "sparql": "ASK { ?e <pred:name> \"Hilo\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Hilo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"40759.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]