[{"question": "Which village has a WOEID of 2369745?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <WOEID> ?pv . ?pv <pred:value> \"2369745\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2369745\" . [ <pred:fact_h> ?e ; <pred:fact_r> <WOEID> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2369745\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with both the subreddit \"post-hardcore\" and the subreddit \"Emo\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Emo\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Emo\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an ICD-10 code of I61 for stroke?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"stroke\" . ?e <ICD-10> ?pv . ?pv <pred:value> \"I61\" . ?e <ICD-10> ?pv_1 . ?pv_1 <pred:value> \"I61\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ICD-10> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"I61\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under the ACM Classification Code (2012) with a value of 10002979?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10002979\" . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10002979\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ACM_Classification_Code_(2012)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"10002979\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as fiction and has an IAB code of 642?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fiction\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"642\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which airline has a Corporate Number (Japan) of 3700150005378 and an IATA airline designator of UA?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"3700150005378\" . ?e <IATA_airline_designator> ?pv_1 . ?pv_1 <pred:value> \"UA\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IATA_airline_designator> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"UA\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which dog has a catalog code of 111 and another catalog code of 111?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <catalog_code> ?pv . ?pv <pred:value> \"111\" . ?e <catalog_code> ?pv_1 . ?pv_1 <pred:value> \"111\" . [ <pred:fact_h> ?e ; <pred:fact_r> <catalog_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"111\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is both an abjad and has an ISO 15924 alpha-4 code of \"Arab\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"abjad\" . ?e <ISO_15924_alpha-4_code> ?pv . ?pv <pred:value> \"Arab\" . ?e <ISO_15924_alpha-4_code> ?pv_1 . ?pv_1 <pred:value> \"Arab\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_15924_alpha-4_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Arab\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which capital has a Dewey Decimal Classification of 2--43712 and a FIPS 10-4 (countries and regions) code of EZ52?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--43712\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"EZ52\" . [ <pred:fact_h> ?e ; <pred:fact_r> <FIPS_10-4_(countries_and_regions)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"EZ52\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which organization has an official website of http://www.cammell-laird.com?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cammell-laird.com/\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cammell-laird.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.cammell-laird.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which governor has an official website of \"http://governor.ky.gov/\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://governor.ky.gov/\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://governor.ky.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://governor.ky.gov/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which object is classified as a zither and has a Hornbostel-Sachs classification of 314.122-5?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"zither\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"314.122-5\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"314.122-5\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"314.122-5\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which instrument has a Hornbostel-Sachs classification of 422.212-71?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"saxophone\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"422.212-71\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"422.212-71\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"422.212-71\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which scientist has an ISCO occupation code of 2212?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2212\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the subreddit \"electro\" and \"funk\" at the same time?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"funk\" . ?e <subreddit> ?pv . ?pv <pred:value> \"electro\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"electro\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"electro\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which duo has an ISNI of 0000 0001 0728 0445 and an official website of http://www.laxmipyare.com/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"duo\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0728 0445\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.laxmipyare.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.laxmipyare.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which doctrine has a Dewey Decimal Classification of 211.7?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"doctrine\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"211.7\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"211.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"211.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which division has an official name of \"\u60c5\u5831\u958b\u767a\u672c\u90e8\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <official_name> ?pv . ?pv <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which designer has an ISCO occupation code of 2141 and an OSM tag or key of Key:architect?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"designer\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2141\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Key:architect\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Key:architect\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which manga has the official website http://tezukaosamu.net?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://tezukaosamu.net\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which writer has an ISNI of 0000 0001 0873 3741?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0873 3741\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which conservatory has an ISNI of 0000 0001 2166 5093 and an official website of http://consmilano.it?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2166 5093\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://consmilano.it\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://consmilano.it\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which activity has an official website of http://www.medalofhonor.com?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.medalofhonor.com\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.medalofhonor.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.medalofhonor.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the subreddit \"psytrance\" in the category \"trance\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <subreddit> ?pv . ?pv <pred:value> \"psytrance\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"psytrance\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a piano according to the Hornbostel-Sachs classification?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"piano\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"511\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"511\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"511\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which drug has subreddits named \"Marijuana\" and \"trees\" (both in English)?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"trees\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which museum has an ARCHON code of 345?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"345\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which crematory is listed as a Grade I listed building with the National Heritage List for England number 1001575?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crematory\" . ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1001575\" . ?e <National_Heritage_List_for_England_number> ?pv_1 . ?pv_1 <pred:value> \"1001575\" . [ <pred:fact_h> ?e ; <pred:fact_r> <National_Heritage_List_for_England_number> ; <pred:fact_t> ?pv_1 ] <heritage_designation> ?qpv . ?qpv <pred:value> \"Grade I listed building\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the engineering Stack Exchange tag \"https://engineering.stackexchange.com/tags/industrial-engineering\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"engineering\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://engineering.stackexchange.com/tags/industrial-engineering\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://engineering.stackexchange.com/tags/industrial-engineering\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Stack_Exchange_tag> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://engineering.stackexchange.com/tags/industrial-engineering\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which drum has a Hornbostel-Sachs classification of 211.212.11?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"211.212.11\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"211.212.11\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"211.212.11\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an sRGB color hex triplet of FFD700?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"orange\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"FFD700\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"FFD700\" . [ <pred:fact_h> ?e ; <pred:fact_r> <sRGB_color_hex_triplet> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"FFD700\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has the Glottolog code \"yuec1235\" and is also classified as \"Chinese\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Chinese\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"yuec1235\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"yuec1235\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"yuec1235\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which announcer has an ISCO occupation code of 2451 and a ROME Occupation Code (v3) of E1106?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"announcer\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"E1106\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"E1106\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the Malay language and has an Ethnologue.com language code of \"ind\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"ind\" . ?e <Ethnologue.com_language_code> ?pv_1 . ?pv_1 <pred:value> \"ind\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Ethnologue.com_language_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"ind\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which anthology has an OCLC control number of 357792?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"357792\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"357792\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the government with ISNI 0000 0001 2230 8442 and RIA Novosti reference 43219727?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"government\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2230 8442\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"43219727\" . [ <pred:fact_h> ?e ; <pred:fact_r> <RIA_Novosti_reference> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"43219727\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which sound has an IAB code of 368?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"368\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"368\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"368\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which language has an Ethnologue.com language code of \"sin\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"sin\" . ?e <Ethnologue.com_language_code> ?pv_1 . ?pv_1 <pred:value> \"sin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Ethnologue.com_language_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"sin\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under Islam with a Dewey Decimal Classification of 297.82 and an OSM tag or key of Tag:denomination=shia?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"297.82\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:denomination=shia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Tag:denomination=shia\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a clarinet and has a Dewey Decimal Classification of 788.65?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"clarinet\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"788.65\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"788.65\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"788.65\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which occupation has an Iconclass notation of 13H2?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"13H2\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"13H2\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"13H2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which screenwriter has an ISCO occupation code of 2451 and a ROME Occupation Code (v3) of E1102?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"screenwriter\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"E1102\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"E1102\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with both Iconclass notation 95 and Iconclass notation 94?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"94\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"94\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which college has an ISNI of 0000 0001 2222 3895?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2222 3895\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2222 3895\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2222 3895\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an Iconclass notation of 41B152?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"residue\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"41B152\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"41B152\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"41B152\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a drama and has a Dewey Decimal Classification of 809.2523?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drama\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"809.2523\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which software has a Stack Exchange tag of https://stackoverflow.com/tags/windows-7 and a nickname of Blackcomb?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/windows-7\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Blackcomb\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nickname> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Blackcomb\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which single has an OCLC control number of 16386945?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"16386945\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"16386945\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"16386945\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which novel has an official website of \"http://www.dccomics.com/watchmen\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dccomics.com/watchmen\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.dccomics.com/watchmen\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.dccomics.com/watchmen\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which mathematician has an ISCO occupation code of 2122 and a ROME Occupation Code (v3) of M1403?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematician\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2122\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"M1403\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"M1403\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has the CANTIC-ID \"a11336638\" and is related to Mormonism?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11336638\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11336638\" . [ <pred:fact_h> ?e ; <pred:fact_r> <CANTIC-ID> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"a11336638\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which industry has the nickname \"Longhorn\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <nickname> ?pv . ?pv <pred:value> \"Longhorn\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Longhorn\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nickname> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Longhorn\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]