[
    {
        "question": "Does Forest Lawn Memorial Park have 119216 graves?",
        "sparql": "ASK { ?e <pred:name> \"Forest Lawn Memorial Park\" . ?e <number of graves> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"119216.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cebu have an electorate of 1.90374e+06?",
        "sparql": "ASK { ?e <pred:name> \"Cebu\" . ?e <electorate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.90374e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Queen's University have an admission rate of 0.42?",
        "sparql": "ASK { ?e <pred:name> \"Queen's University\" . ?e <admission rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.42\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Cinderella have an attendance of 1.35985e+06?",
        "sparql": "ASK { ?e <pred:name> \"Cinderella\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.35985e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Metropolitan Museum of Art have 5.24 million visitors per year?",
        "sparql": "ASK { ?e <pred:name> \"Metropolitan Museum of Art\" . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.24e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does For Your Eyes Only have 218 pages?",
        "sparql": "ASK { ?e <pred:name> \"For Your Eyes Only\" . ?e <number of pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Sydney Airport have a patronage of 2.71981e+07?",
        "sparql": "ASK { ?e <pred:name> \"Sydney Airport\" . ?e <patronage> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.71981e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was 1527.0 the total number of Boeing 747s produced?",
        "sparql": "ASK { ?e <pred:name> \"Boeing 747\" . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1527.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Selangor FA have a maximum capacity of 80000.0?",
        "sparql": "ASK { ?e <pred:name> \"Selangor FA\" . ?e <maximum capacity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Ivory Coast, which has a Human Development Index of 0.39?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ivory Coast\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.39\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many representatives does the Bharatiya Janata Party have in an organization/legislature and what is their member count?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <member count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1e+08\"^^xsd:double . ?e <number of representatives in an organization/legislature> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What work was Harry Potter and the Goblet of Fire based on and what was its box office revenue?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <after a work by> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the California State Assembly have 80 seats and less than arg4 seats?",
        "sparql": "ASK { ?e <pred:name> \"California State Assembly\" . ?e <number of seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <number of seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Street Fighter II V have less than arg4 episodes, where the first episode is 29.0?",
        "sparql": "ASK { ?e <pred:name> \"Street Fighter II V\" . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29.0\"^^xsd:double . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does SkyTeam have a member count of 20.0 (unit: 1) and another member count less than arg4?",
        "sparql": "ASK { ?e <pred:name> \"SkyTeam\" . ?e <member count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20.0\"^^xsd:double . ?e <member count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the Royal Victorian Chain awarded in a quantity of 84.0 and is the value of its quantity less than arg4?",
        "sparql": "ASK { ?e <pred:name> \"Royal Victorian Chain\" . ?e <quantity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"84.0\"^^xsd:double . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the South Australian House of Assembly have 47 constituencies?",
        "sparql": "ASK { ?e <pred:name> \"South Australian House of Assembly\" . ?e <number of constituencies> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"47.0\"^^xsd:double . ?e <number of constituencies> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Empire State Building have less than arg4 elevators and 102 floors above ground?",
        "sparql": "ASK { ?e <pred:name> \"Empire State Building\" . ?e <floors above ground> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"102.0\"^^xsd:double . ?e <number of elevators> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Rio de Janeiro have a Human Development Index less than 0.761 and another Human Development Index less than arg4?",
        "sparql": "ASK { ?e <pred:name> \"Rio de Janeiro\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.761\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Moon have an albedo less than arg4 and equal to 0.136?",
        "sparql": "ASK { ?e <pred:name> \"Moon\" . ?e <albedo> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.136\"^^xsd:double . ?e <albedo> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does malaria have a number of cases less than arg4 (which is not specified in the query)?",
        "sparql": "ASK { ?e <pred:name> \"malaria\" . ?e <number of cases> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"881730.0\"^^xsd:double . ?e <number of cases> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Southeast Asia have a total fertility rate less than arg4 and a number of out-of-school children equal to 1.8579e+07?",
        "sparql": "ASK { ?e <pred:name> \"Southeast Asia\" . ?e <number of out-of-school children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.8579e+07\"^^xsd:double . ?e <total fertility rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does arachidonic acid have a pKa value less than arg4?",
        "sparql": "ASK { ?e <pred:name> \"arachidonic acid\" . ?e <pKa> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.752\"^^xsd:double . ?e <pKa> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the city of the United States with a Twitter username of CityOfBoston founded on 1630-09-07?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"CityOfBoston\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the person with ISNI 0000 0000 5930 3891 born on September 21, 1931?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 5930 3891\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1931-09-21\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a film with a duration of 160.0 and a publication date of 2008-09-07?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"160.0\" . ?e <publication date> ?pv . ?pv <pred:date> \"2008-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the 51st Academy Awards ceremony take place on April 9th, 1979?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <edition number> ?pv_1 . ?pv_1 <pred:value> \"51\" . ?e <point in time> ?pv . ?pv <pred:date> \"1979-04-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which comics character, with an ISNI of 0000 0003 5932 6542, will enter the public domain on 2024-01-01 and is applicable to the jurisdiction of the United States of America?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comics character\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 5932 6542\" . ?e <public domain date> ?pv_1 . ?pv_1 <pred:date> \"2024-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <public domain date> ; <pred:fact_t> ?pv_1 ] <applies to jurisdiction> ?qpv . ?qpv <pred:value> \"United States of America\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which aircraft functional class has a total produced of 1527 and a service entry date of 1970-01-22 with Pan Am as the operator?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <total produced> ?pv . ?pv <pred:value> \"1527.0\" . ?e <service entry> ?pv_1 . ?pv_1 <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv_1 ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a U.S. city with an area of 37.5618 and a population greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"37.5618\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a cemetery with a National Heritage List for England number of 1080633 and more than one person buried?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <National Heritage List for England number> ?pv_1 . ?pv_1 <pred:value> \"1080633\" . ?e <quantity buried> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an aircraft functional class with a stall speed of 250.0 and a total production number greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <stall speed> ?pv_1 . ?pv_1 <pred:value> \"250.0\" . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Get Carter published in Germany on August 16, 2001?",
        "sparql": "ASK { ?e <pred:name> \"Get Carter\" . ?e <publication date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the House of Plantagenet dissolved, abolished or demolished before 1485 (according to a statement with Gregorian date earlier than 1584)?",
        "sparql": "ASK { ?e <pred:name> \"House of Plantagenet\" . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"1485-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved, abolished or demolished> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Gil Kane die at the age of 73 on January 31, 2000?",
        "sparql": "ASK { ?e <pred:name> \"Gil Kane\" . ?e <date of death> ?pv . ?pv <pred:date> \"2000-01-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date of death> ; <pred:fact_t> ?pv ] <stated age at event> ?qpv . ?qpv <pred:value> \"73.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"forum apud Munichen\" the stated source for the time of earliest written record of Munich (which is 1158-06-14)?",
        "sparql": "ASK { ?e <pred:name> \"Munich\" . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"1158-06-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <time of earliest written record> ; <pred:fact_t> ?pv ] <stated as> ?qpv . ?qpv <pred:value> \"forum apud Munichen\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Pan Am the operator of the Boeing 747 when it entered service on 1970-01-22?",
        "sparql": "ASK { ?e <pred:name> \"Boeing 747\" . ?e <service entry> ?pv . ?pv <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Rudyard Kipling buried or cremated on 1936-01-23 at Westminster Abbey?",
        "sparql": "ASK { ?e <pred:name> \"Rudyard Kipling\" . ?e <date of burial or cremation> ?pv . ?pv <pred:date> \"1936-01-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date of burial or cremation> ; <pred:fact_t> ?pv ] <location> ?qpv . ?qpv <pred:value> \"Westminster Abbey\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which metropolitan area has a population greater than 6.155e+06?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6.155e+06\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6.155e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the administrative territorial entity that Dorchester is located in, and what is its native label?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dorchester\" . ?e_2 <pred:name> \"Boston\" . ?e_2 <native label> ?pv . ?pv <pred:value> \"Boston\" . ?e_1 <located in the administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in the administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Cameroon become a member of the United Nations (the one with an official name of United Nations)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_2 <pred:name> \"United Nations\" . ?e_2 <official name> ?pv . ?pv <pred:value> \"United Nations\" . ?e_1 <member of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member of> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Boston's inception date 1630-09-07 and population 617594.0?",
        "sparql": "ASK { ?e <pred:name> \"Boston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"617594.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Fred Astaire have 2 children (the one born on 1899-05-10)?",
        "sparql": "ASK { ?e <pred:name> \"Fred Astaire\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1899-05-10\"^^xsd:date . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Harry Potter and the Goblet of Fire published on 2005-11-06 and had a box office of 8.96911e+08?",
        "sparql": "ASK { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-06\"^^xsd:date . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Somerset end on December 31st, 1976 and have 1710.0 episodes?",
        "sparql": "ASK { ?e <pred:name> \"Somerset\" . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1976-12-31\"^^xsd:date . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1710.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Hudson Soft dissolve on 2012-03-01 and have 500 employees?",
        "sparql": "ASK { ?e <pred:name> \"Hudson Soft\" . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"2012-03-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the Boeing 747 have its first flight on 1969-02-09 and a total production of 1527.0?",
        "sparql": "ASK { ?e <pred:name> \"Boeing 747\" . ?e <first flight> ?pv_1 . ?pv_1 <pred:date> \"1969-02-09\"^^xsd:date . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1527.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the United States presidential election in 2008 have 2.13314e+08 eligible voters on November 4th?",
        "sparql": "ASK { ?e <pred:name> \"United States presidential election, 2008\" . ?e <point in time> ?pv_1 . ?pv_1 <pred:date> \"2008-11-04\"^^xsd:date . ?e <eligible voters> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.13314e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]