[{"question": "What is the Dewey Decimal Classification for ethics?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"ethics\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"170\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the DiseasesDB ID for schizophrenia?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"schizophrenia\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"11890\" . ?e <DiseasesDB> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Oakland?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Oakland\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79466\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which country is associated with the film Vertigo and has an official website of http://www.vertigocomics.com?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vertigo\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.vertigocomics.com\" . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for CBS?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"CBS\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"cbs\" . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Guinea?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Guinea\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6652\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Jharkhand?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jharkhand\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"IN38\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Luton in the UK?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Luton\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKI1\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Liechtenstein?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Liechtenstein\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43648\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution value for Edinburgh (the one with a value of 105726)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Edinburgh\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"105726\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for Gameloft?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gameloft\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"gameloft\" . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Quebec?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Quebec\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--714\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Wiesbaden?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wiesbaden\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--434165\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of Bouzouki?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bouzouki\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.321\" . ?e <Hornbostel-Sachs_classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode for the flood with the mediatopic/20000154 value?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"flood\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000154\" . ?e <IPTC_Newscode> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who composed the title \"Tarzan\" for the movie Tarzan?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tarzan\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Tarzan\" . ?e <composer> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Christchurch (the one with ISNI 0000 0001 2222 322X)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Christchurch\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2222 322X\" . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the China administrative division code for Sichuan?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sichuan\" . ?e <China_administrative_division_code> ?pv_1 . ?pv_1 <pred:value> \"51\" . ?e <China_administrative_division_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for boxing?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"boxing\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"485\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of Ballarat?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ballarat\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"1100071\" . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the China administrative division code for Fujian (the one with a code of 35)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fujian\" . ?e <China_administrative_division_code> ?pv_1 . ?pv_1 <pred:value> \"35\" . ?e <China_administrative_division_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of citizenship of Brahmanandam (the one whose name in native language is \u0c2c\u0c4d\u0c30\u0c39\u0c4d\u0c2e\u0c3e\u0c28\u0c02\u0c26\u0c02)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brahmanandam\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"\u0c2c\u0c4d\u0c30\u0c39\u0c4d\u0c2e\u0c3e\u0c28\u0c02\u0c26\u0c02\" . ?e <country_of_citizenship> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of Uxbridge?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Uxbridge\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2510576\" . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username for Devon?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Devon\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"devonxxx\" . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the GSS code (2011) for Essex?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Essex\" . ?e <GSS_code_(2011)> ?pv_1 . ?pv_1 <pred:value> \"E10000012\" . ?e <GSS_code_(2011)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Lancashire (the one whose FIPS 10-4 code is UKH2)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lancashire\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKH2\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name of the instrument with a Hornbostel-Sachs classification of 423.121.11?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"didgeridoo\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"423.121.11\" . ?e <pred:name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Deutsche Synchronkartei actor-ID of Ice-T (the one whose ID is 3727)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ice-T\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv_1 . ?pv_1 <pred:value> \"3727\" . ?e <Deutsche_Synchronkartei_actor-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Tampa?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tampa\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--75965\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CAS Registry Number for cholesterol (the one with CAS Registry Number 57-88-5)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"cholesterol\" . ?e <CAS_Registry_Number> ?pv_1 . ?pv_1 <pred:value> \"57-88-5\" . ?e <CAS_Registry_Number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISBN-10 of the book \"Trainspotting\" with the ISBN-10 value of 85-325-1773-0?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Trainspotting\" . ?e <ISBN-10> ?pv_1 . ?pv_1 <pred:value> \"85-325-1773-0\" . ?e <ISBN-10> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Bandung?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bandung\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--59824\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for January (the one with a value of 529.2)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"January\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"529.2\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was democracy established on 1822-01-07 and is it related to the British Museum person-institution with a value of 180889?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British_Museum_person-institution> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"180889\" . ?e <inception> ?pv . ?pv <pred:date> \"1822-01-07\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the activity with the official website http://www.berlin2009.org/1-1-home.html end on 2009-08-23?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.berlin2009.org/1-1-home.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.berlin2009.org/1-1-home.html\" . ?e <end_time> ?pv . ?pv <pred:date> \"2009-08-23\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the town with WOEID 1586549 established on January 1, 1839?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"1586549\" . [ <pred:fact_h> ?e ; <pred:fact_r> <WOEID> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1586549\" . ?e <inception> ?pv . ?pv <pred:date> \"1839-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the inception date of Protestantism (the one with ISNI 0000 0004 0508 6616) 1957-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0004 0508 6616\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anime with 13 episodes and a publication date of 2008-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"13.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"13.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the official name \"Prime Minister\" of an entity established on July 1, 1867?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Prime Minister\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Prime Minister\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an island with FIPS 10-4 code GQ that was established on January 1, 1898?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"GQ\" . [ <pred:fact_h> ?e ; <pred:fact_r> <FIPS_10-4_(countries_and_regions)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"GQ\" . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a novel with a Dewey Decimal Classification of 813.54 and a publication date of 1960-07-11?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"813.54\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"813.54\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1960-07-11\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a metropolis with a Dewey Decimal Classification of 2--71428 and an inception date of May 17, 1642?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--71428\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2--71428\" . ?e <inception> ?pv . ?pv <pred:date> \"1642-05-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an album with a duration of 1744.0 and a publication date of 1976-04-23?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"1744.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1744.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1976-04-23\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the war with KulturNav-id f0a37482-3736-4dd0-b56c-c7d26fb32a95 end?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KulturNav-id> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . ?e <end_time> ?pv . ?pv <pred:date> \"1648-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the capital with ISNI 0000 0003 9717 5415 established on 1571-06-24?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0003 9717 5415\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0003 9717 5415\" . ?e <inception> ?pv . ?pv <pred:date> \"1571-06-24\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the agent with ISNI 0000 0000 9987 0743 active since 1946-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 9987 0743\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0000 9987 0743\" . ?e <inception> ?pv . ?pv <pred:date> \"1946-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the college with ISNI 0000 0001 0719 5427 established on 1824-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0719 5427\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 0719 5427\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a song with a duration of 238.0 and a publication date of 1995-05-30?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"238.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"238.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1995-05-30\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a techno subreddit that has the value \"minimal\" and was created on January 1, 1991?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"minimal\" . ?e <inception> ?pv . ?pv <pred:date> \"1991-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a miniseries with a duration of 177.0 and a publication date of 1999-10-16?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"177.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"177.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-10-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did marketing (the one with RIA_Novosti_reference 61684885) have its first flight?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"61684885\" . [ <pred:fact_h> ?e ; <pred:fact_r> <RIA_Novosti_reference> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"61684885\" . ?e <first_flight> ?pv . ?pv <pred:date> \"1967-04-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the comedy with a duration of 25.0 minutes end on May 9, 1992?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"25.0\" . ?e <end_time> ?pv . ?pv <pred:date> \"1992-05-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the neighborhood with postal code 02119 established on September 28, 1630?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"02119\" . [ <pred:fact_h> ?e ; <pred:fact_r> <postal_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"02119\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-28\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the newspaper with an Alexa rank of 112.0 and an inception date of 1851-09-18 ranked 112.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"112.0\" . ?e <inception> ?pv . ?pv <pred:date> \"1851-09-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the army with ISNI 0000 0004 0498 1870 established on 1947-08-15?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0498 1870\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0004 0498 1870\" . ?e <inception> ?pv . ?pv <pred:date> \"1947-08-15\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the trance genre, which has a subreddit called psytrance and was created on 1995-01-01, also created on the subreddit psytrance?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"psytrance\" . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the inception date of Mormonism (the one with CANTIC-ID a11336638) April 6, 1830?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11336638\" . [ <pred:fact_h> ?e ; <pred:fact_r> <CANTIC-ID> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"a11336638\" . ?e <inception> ?pv . ?pv <pred:date> \"1830-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a film with a duration of 98.0 minutes and a publication date of 2000-09-25?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"98.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-09-25\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the inception date of Christianity (the one with ISNI 0000 0004 0508 6616) January 1, 1957?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0004 0508 6616\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the state with IPTC Newscode mediatopic/20000807 dissolved, abolished, or demolished?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000807\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000807\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1865-12-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an opera with a number of parts equal to 1.0 and a date of first performance on January 25, 1909?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <number_of_parts_of_this_work_of_art> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_parts_of_this_work_of_art> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.0\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1909-01-25\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the governor, whose official website is http://governor.ky.gov/ and inception date is 1792-06-04, the same as the one with the official website http://governor.ky.gov/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://governor.ky.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://governor.ky.gov/\" . ?e <inception> ?pv . ?pv <pred:date> \"1792-06-04\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a politician whose native label is \"Speaker of the United States House of Representatives\" and whose inception date is 1789-04-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Speaker of the United States House of Representatives\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]