[
    {
        "question": "Does the university with ISNI 0000 0004 1936 8286 have a fact with ISNI 0000 0000 8596 9494?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1936 8286\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8596 9494\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0000 0000 8596 9494\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Tagalog language have a Glottolog code of fili1244?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Tagalog . ?e <Glottolog code> ?pv_1 . ?pv_1 <pred:value> \"fili1244\" . ?e <Glottolog code> ?pv . ?pv <pred:value> \"fili1244\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"fili1244\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a newspaper whose length is 22.0 and has a fact with a value of 22.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> newspaper . ?e <length> ?pv_1 . ?pv_1 <pred:value> \"22.0\" . ?e <length> ?pv . ?pv <pred:value> \"22.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <length> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"22.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a subreddit related to trance and psytrance that has the same value for both?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> trance . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . ?e <subreddit> ?pv . ?pv <pred:value> \"psytrance\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"psytrance\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for Wichita (the one with a native label of Wichita and an official website of http://www.wichita.gov)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Wichita . ?e <native label> ?pv_1 . ?pv_1 <pred:value> Wichita . ?e <official website> ?pv . ?pv <pred:value> \"http://www.wichita.gov\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Tartu stop being officially known as Derpt?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Tartu . ?e <official name> ?pv_1 . ?pv_1 <pred:value> Tartu . ?e <official name> ?pv . ?pv <pred:value> \"Derpt\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for Solihull's population being 206674 and having an official name of Solihull?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Solihull . ?e <official name> ?pv_1 . ?pv_1 <pred:value> Solihull . ?e <population> ?pv . ?pv <pred:value> \"206674.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the Community subreddit?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Community . ?e <title> ?pv_1 . ?pv_1 <pred:value> Community . ?e <subreddit> ?pv . ?pv <pred:value> \"community\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Freeform (formerly known as ABC Family) stop using the Pinterest username \"Freeform\"?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Freeform . ?e <Pinterest username> ?pv_1 . ?pv_1 <pred:value> Freeform . ?e <official name> ?pv . ?pv <pred:value> \"ABC Family\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the subreddit \"astrology\" and the Iconclass notation \"14\" for the topic of astrology?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> astrology . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> astrology . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"14\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass notation> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with Seal (the one with the pseudonym Seal) and the official website http://www.seal.com/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Seal . ?e <pseudonym> ?pv_1 . ?pv_1 <pred:value> Seal . ?e <official website> ?pv . ?pv <pred:value> \"http://www.seal.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Instagram handle of Kajol (the one whose name in native language is also Kajol)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Kajol . ?e <name in native language> ?pv_1 . ?pv_1 <pred:value> Kajol . ?e <Instagram username> ?pv . ?pv <pred:value> \"kajol\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Instagram username> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the duration of the song \"Styx\" by Styx, which is 94.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Styx . ?e <title> ?pv_1 . ?pv_1 <pred:value> Styx . ?e <duration> ?pv . ?pv <pred:value> \"94.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the missing title and a duration of 45.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Missing . ?e <title> ?pv_1 . ?pv_1 <pred:value> Missing . ?e <duration> ?pv . ?pv <pred:value> \"45.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]