[
    {
        "question": "What is the connection between two instances of Angola whose Human Development Index is 0.401?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Angola . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.401\"^^xsd:double . ?e_2 <pred:name> Angola . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.401\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Germany (the one with a population of 7.8209e+07) and Germany (the one with a population of 8.2315e+07)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Germany . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.8209e+07\"^^xsd:double . ?e_2 <pred:name> Germany . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.2315e+07\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Mongolia (the one with a Human Development Index of 0.524) and Mongolia (the one with a Human Development Index of 0.727)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Mongolia . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.524\"^^xsd:double . ?e_2 <pred:name> Mongolia . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.727\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cambodia (the one with a Human Development Index of 0.55) and Cambodia (the one with a Human Development Index of 0.491)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Cambodia . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.55\"^^xsd:double . ?e_2 <pred:name> Cambodia . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.491\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Zambia have a Human Development Index of 0.403 and a subreddit with the same name?",
        "sparql": "ASK { ?e <pred:name> Zambia . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.403\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> Zambia .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Maidstone's population 107,627 and does it have a native label of Maidstone?",
        "sparql": "ASK { ?e <pred:name> Maidstone . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107627.0\"^^xsd:double . ?e <native label> ?pv . ?pv <pred:value> Maidstone .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Sialkot 920,000 and does it have a native label equal to Sialkot?",
        "sparql": "ASK { ?e <pred:name> Sialkot . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"920000.0\"^^xsd:double . ?e <native label> ?pv . ?pv <pred:value> Sialkot .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Durban have a subreddit with a population of 595061.0?",
        "sparql": "ASK { ?e <pred:name> Durban . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"595061.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> Durban .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Romania have a subreddit and a Human Development Index of 0.791?",
        "sparql": "ASK { ?e <pred:name> Romania . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.791\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> Romania .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Alberta have a subreddit with the same name and a population of 3.64526e+06?",
        "sparql": "ASK { ?e <pred:name> Alberta . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.64526e+06\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> Alberta .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Sydney 500,000 and does it have a native label of Sydney?",
        "sparql": "ASK { ?e <pred:name> Sydney . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"500000.0\"^^xsd:double . ?e <native label> ?pv . ?pv <pred:value> Sydney .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of the show Merlin and does it have 2 episodes with a duration of 2.0?",
        "sparql": "ASK { ?e <pred:name> Merlin . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double . ?e <title> ?pv . ?pv <pred:value> Merlin .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Zagreb 790017.0 and does it have a native label of Zagreb?",
        "sparql": "ASK { ?e <pred:name> Zagreb . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"790017.0\"^^xsd:double . ?e <native label> ?pv . ?pv <pred:value> Zagreb .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Edinburgh 483,000 and does it have a native label of Edinburgh?",
        "sparql": "ASK { ?e <pred:name> Edinburgh . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"483000.0\"^^xsd:double . ?e <native label> ?pv . ?pv <pred:value> Edinburgh .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the business dissolved, abolished or demolished on 2012-03-01 and had 500 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"2012-03-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a museum that was officially opened on 1819-11-19 and has 2.69667e+06 visitors per year?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <date of official opening> ?pv_1 . ?pv_1 <pred:date> \"1819-11-19\"^^xsd:date . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.69667e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a miniseries that ended on 1986-12-21 and has 6.0 episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1986-12-21\"^^xsd:date . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the single with a publication date of 2007-11-06 and a beats per minute of 72.0 exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> single . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2007-11-06\"^^xsd:date . ?e <beats per minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"72.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a school with an inception date of 1881-01-01 and a student count of 4962.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> school . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1881-01-01\"^^xsd:date . ?e <students count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4962.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the capital city whose inception date is 1571-06-24 and has an electorate of 959581?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1571-06-24\"^^xsd:date . ?e <electorate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"959581.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the award, whose inception is 1983-01-01 and has 441290 visitors per year, exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> award . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"441290.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a book of genre with a publication date of 1960-04-11 and 218 pages?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1960-04-11\"^^xsd:date . ?e <number of pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an island with an inception date of 1898-01-01 and a population of 133553.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"133553.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ACM Classification Code (2012) for the foundation that was established on 1999-06-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> foundation . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-06-01\"^^xsd:date . ?e <ACM Classification Code (2012)> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the person with occupation as their instance of and born on 1934-08-18?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> occupation . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin for the rockabilly group that was formed on 1978-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> rockabilly . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Instagram username of the newscast that first performed on 1952-01-14?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> newscast . ?e <date of first performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <Instagram username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What jurisdiction does the profession that was established on 1721-04-04 apply to?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> profession . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1721-04-04\"^^xsd:date . ?e <applies to jurisdiction> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was the director/manager of the division that was dissolved, abolished or demolished on 2015-09-16?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> division . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"2015-09-16\"^^xsd:date . ?e <director/manager> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin for the bebop genre that was founded on 1963-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> bebop . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1963-01-01\"^^xsd:date . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the British Museum person-institution of the dynasty that was dissolved, abolished or demolished on 1780-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> dynasty . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1780-01-01\"^^xsd:date . ?e <British Museum person-institution> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the business that was founded on 1887-03-04?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1887-03-04\"^^xsd:date . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which jurisdiction does the minister who was established on 1867-07-01 apply to?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> minister . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <applies to jurisdiction> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Jersey (the one with FIPS 10-4 code JE) and Jersey (also with FIPS 10-4 code JE)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Jersey . ?e_1 <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"JE\" . ?e_2 <pred:name> Jersey . ?e_2 <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"JE\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Switzerland (the one with Dewey Decimal Classification of 2--494) and Switzerland (the one with a Human Development Index of 0.831)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Switzerland . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--494\" . ?e_2 <pred:name> Switzerland . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.831\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Turkey (the one with Dewey Decimal Classification of 2--561) and Turkey (the one with a Human Development Index of 0.761)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Turkey . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--561\" . ?e_2 <pred:name> Turkey . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.761\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Suffolk (the one with Dewey Decimal Classification of 2--75553) and Suffolk (the one with FIPS 10-4 code of UKN5)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Suffolk . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--75553\" . ?e_2 <pred:name> Suffolk . ?e_2 <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"UKN5\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ghana (the one with Dewey Decimal Classification of 2--667) and Ghana (the one with ISNI 0000 0001 2114 305X)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Ghana . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--667\" . ?e_2 <pred:name> Ghana . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2114 305X\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Elektra (the one whose birth name is Elektra Natchios) and Elektra (the one with a duration of 96.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Elektra . ?e_1 <birth name> ?pv . ?pv <pred:value> \"Elektra Natchios\" . ?e_2 <pred:name> Elektra . ?e_2 <duration> ?pv_1 . ?pv_1 <pred:value> \"96.0\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Nashville (the one with a duration of 42.0) and Nashville (the one with a Dewey Decimal Classification of 2--76855)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Nashville . ?e_1 <duration> ?pv . ?pv <pred:value> \"42.0\" . ?e_2 <pred:name> Nashville . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--76855\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the movie Bedazzled (the one with a box office of 9.03832e+07) and the movie Bedazzled (the one with a duration of 103.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Bedazzled . ?e_1 <box office> ?pv . ?pv <pred:value> \"9.03832e+07\" . ?e_2 <pred:name> Bedazzled . ?e_2 <duration> ?pv_1 . ?pv_1 <pred:value> \"103.0\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Norwalk (the one with Dewey Decimal Classification of 2--79493) and Norwalk (the one with ISNI 0000 0004 0620 0169)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Norwalk . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--79493\" . ?e_2 <pred:name> Norwalk . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0620 0169\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Thailand (the one with Dewey Decimal Classification of 2--593) and Thailand (the one with a Human Development Index of 0.611)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Thailand . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--593\" . ?e_2 <pred:name> Thailand . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.611\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Twitter username of the band with 20707.0 subscribers and a Twitter username of goldfingermusic?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> band . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"goldfingermusic\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"20707.0\"^^xsd:double . ?e <Twitter username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the subreddit for Yorkies (the dog) and how many subscribers does it have?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> dog . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2394.0\"^^xsd:double . ?e <pred:instance of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the city/town with a population of 816171.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"816171.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"816171.0\"^^xsd:double . ?e <pred:name> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the airline with a Twitter username of \"united\" and 988,612 subscribers?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"united\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"988612.0\"^^xsd:double . ?e <pred:instance of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]