[{"question": "What is the Human Development Index of the republic whose annual number of weddings is 238592.0 on January 1, 2013?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:value> \"238592.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <annual_number_of_weddings> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2013-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.848\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many languages had 40,200,000 speakers on January 1, 2007?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:value> \"4.02e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2007-01-01\"^^xsd:date . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.02e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the capital with ISO 3166-2 code CZ-PR (the one whose end time is 2016-11-15) have 4787.0 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <end_time> ?qpv . ?qpv <pred:date> \"2016-11-15\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4787.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the agent with an Alexa rank of 360.0 on 2017-11-20 ranked 378.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"360.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"378.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the country with NUTS code UKM (whose population is 5.3136e+06) start?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS_code> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:date> \"1999-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.3136e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of the neighborhood on January 1, 2010?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"91982.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"91982.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a newspaper with an Alexa rank of 112.0 on 2017-11-20 and a current Alexa rank of 117.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the film with an exploitation visa number of 114028 (which started on 2005-11-17) have a box office of 8.96911e+08?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"114028\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:date> \"2005-11-17\"^^xsd:date . ?e <box_office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a state with a nominal GDP of 1.93007e+09 on January 1, 1997 and a Human Development Index of 0.649?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <nominal_GDP> ?pv_1 . ?pv_1 <pred:value> \"1.93007e+09\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal_GDP> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"1997-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.649\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the business with an Alexa rank of 360.0 on 2017-11-20 the same business with an Alexa rank of 360.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"360.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"360.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an industry with an Alexa rank of 1.0 on 2017-11-20?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the award with an Alexa rank of 126668.0 on 2018-01-09?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"126668.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2018-01-09\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"126668.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the museum have a total revenue of 5.73753e+08 on January 1, 2017 and have 6.7e+06 visitors per year?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <total_revenue> ?pv_1 . ?pv_1 <pred:value> \"5.73753e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <total_revenue> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-01-01\"^^xsd:date . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.7e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a human with a ranking of 1.0 on 2008-08-18 and a ranking of 145.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ranking> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2008-08-18\"^^xsd:date . ?e <ranking> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"145.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the conservatory with the short name \"\u0421\u0430\u043d\u043a\u0442-\u041f\u0435\u0442\u0435\u0440\u0431\u0443\u0440\u0433\u0441\u043a\u0430\u044f \u043a\u043e\u043d\u0441\u0435\u0440\u0432\u0430\u0442\u043e\u0440\u0438\u044f\" (whose start time is 1991-09-24) have 75.0 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"\u0421\u0430\u043d\u043a\u0442-\u041f\u0435\u0442\u0435\u0440\u0431\u0443\u0440\u0433\u0441\u043a\u0430\u044f \u043a\u043e\u043d\u0441\u0435\u0440\u0432\u0430\u0442\u043e\u0440\u0438\u044f\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:date> \"1991-09-24\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"75.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What was the population of the city on January 1, 2014?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"928850.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"928850.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a software with an Alexa rank of 1.0 on November 20, 2017?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the university with an IPv4 routing prefix of 132.203.0.0/16 start and have a student count of 37591?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <IPv4_routing_prefix> ?pv_1 . ?pv_1 <pred:value> \"132.203.0.0/16\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4_routing_prefix> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv . ?qpv <pred:date> \"1989-08-08\"^^xsd:date . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"37591.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of the landform with an ISO_3166-2_code of NZ-S that ended on 2015-11-27?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <end_time> ?qpv . ?qpv <pred:date> \"2015-11-27\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1158e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the foundation with an Alexa rank of 29145.0 on 2017-11-28?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"29145.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-28\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29145.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the facility, with a total revenue of 5.73753e+08 on 2017-01-01 and 6.7e+06 visitors per year, exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <total_revenue> ?pv_1 . ?pv_1 <pred:value> \"5.73753e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <total_revenue> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-01-01\"^^xsd:date . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.7e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a manifestation with an Alexa rank of 112.0 on 2017-11-20 and a current Alexa rank of 117.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many airlines had 120,262 employees on December 31, 2017?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"129424.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-12-31\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"120262.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie Troy?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Troy\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Troy\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"Memento\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Memento\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Memento\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution ID for Michelangelo (the one with the Swedish Literature Bank AuthorID Michelangelo)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Michelangelo\" . ?e <Swedish_Literature_Bank_AuthorID> ?pv_1 . ?pv_1 <pred:value> \"Michelangelo\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Caverphone code for the name Wilson?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wilson\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Wilson\" . ?e <Caverphone> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the work that Contact is based on?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Contact\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Contact\" . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Canberra and what is its official name?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Canberra\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Canberra\" . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Alabama (the one with subreddit \"Alabama\")?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Alabama\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Alabama\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie Annie?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Annie\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Annie\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Prague (the one with subreddit Prague)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Prague\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Prague\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the show \"Heroes\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Heroes\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Heroes\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Caverphone code for the name \"Bobby\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bobby\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Bobby\" . ?e <Caverphone> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Aachen (the one with a native label of Aachen)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aachen\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Aachen\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OCLC control number for the movie titled \"Cosmopolis\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cosmopolis\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Cosmopolis\" . ?e <OCLC_control_number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie U-571 receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"U-571\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"U-571\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member in the movie \"Anonymous\" with the title \"Anonymous\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Anonymous\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Anonymous\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of Missoula?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Missoula\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Missoula\" . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Iowa (the one with subreddit Iowa)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Iowa\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Iowa\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Nashville?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nashville\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Nashville\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member of the movie \"Celebrity\" with the title \"Celebrity\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Celebrity\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Celebrity\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the GSS code (2011) for England?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"England\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"England\" . ?e <GSS_code_(2011)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the show \"Damages\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Damages\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Damages\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie Melancholia?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Melancholia\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Melancholia\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Inkheart\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Inkheart\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Inkheart\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Frankenweenie and what is it based on?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Frankenweenie\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Frankenweenie\" . ?e <based_on> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Monterey (the one with an official name of Monterey)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Monterey\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Monterey\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Bratislava (the one with a subreddit named Bratislava)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bratislava\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Bratislava\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the Airport movie receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Airport\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Airport\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISBN-10 of the book titled \"Slaughterhouse-Five\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Slaughterhouse-Five\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Slaughterhouse-Five\" . ?e <ISBN-10> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"Closer\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Closer\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Closer\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie Shortbus?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Shortbus\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Shortbus\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of existentialism (the one whose PhilPapers topic is existentialism)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"existentialism\" . ?e <PhilPapers_topic> ?pv_1 . ?pv_1 <pred:value> \"existentialism\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Kick-Ass based on?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kick-Ass\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Kick-Ass\" . ?e <based_on> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Chelmsford?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chelmsford\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Chelmsford\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the work that Sherlock is based on?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sherlock\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Sherlock\" . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Graz (the one with a native label of Graz)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Graz\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Graz\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the film \"Amour\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Amour\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Amour\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"Fame\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fame\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Fame\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie Eragon?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Eragon\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Eragon\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for socialism (the one with subreddit \"socialism\")?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"socialism\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"socialism\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie G-Force?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"G-Force\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"G-Force\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Darmstadt?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Darmstadt\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Darmstadt\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the film Happy-Go-Lucky receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Happy-Go-Lucky\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Happy-Go-Lucky\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Mulan based on?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mulan\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Mulan\" . ?e <based_on> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the EPPO Code for Liliaceae (the one with the taxon name Liliaceae)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Liliaceae\" . ?e <taxon_name> ?pv_1 . ?pv_1 <pred:value> \"Liliaceae\" . ?e <EPPO_Code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie \"Big\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Big\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Big\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]