[
    {
        "question": "What language has 4.37e+08 speakers and an IETF language tag of \"es\"? What is the fact associated with this language?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.37e+08\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"4.37e+08\" . ?e <IETF language tag> ?pv . ?pv <pred:value> \"es\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IETF language tag> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the village with a population of 6323, whose name in native language is Underhill's Crossing, end?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"6323.0\" . ?e <name in native language> ?pv . ?pv <pred:value> \"Underhill's Crossing\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name in native language> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact that connects filmmaking to having 56 episodes, and what is the value of that fact?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> filmmaking . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"56.0\" . ?e <number of episodes> ?pv . ?pv <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which nationality has a population of 6e+06 and has the same population as its fact?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> nationality . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"6e+06\" . ?e <population> ?pv . ?pv <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the part of a star with an absolute magnitude of 4.83 and a temperature of 5e+06 that has a value of 4.83?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> star . ?e <absolute magnitude> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.83\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <absolute magnitude> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"4.83\" . ?e <temperature> ?pv . ?pv <pred:value> \"5e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <temperature> ; <pred:fact_t> ?pv ] <applies to part> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the start time of the film with an exploitation visa number of 114028 and a box office of 8.96911e+08?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <box office> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"8.96911e+08\" . ?e <exploitation visa number> ?pv . ?pv <pred:value> \"114028\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation visa number> ; <pred:fact_t> ?pv ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time when an army had 44200 members and 15200 employees?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> army . ?e <member count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"44200.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <member count> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"44200.0\" . ?e <employees> ?pv . ?pv <pred:value> \"15200.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which anime was published in Germany on September 16, 2010?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anime . ?e <publication date> ?pv . ?pv <pred:date> \"2010-09-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What film was published on January 22, 1987 in Germany?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <publication date> ?pv . ?pv <pred:date> \"1987-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What entertainment was published on June 23, 1991 in North America?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <publication date> ?pv . ?pv <pred:date> \"1991-06-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"North America\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city has an inception date earlier than 1584 according to a statement with Gregorian date and an instance of \"statement with Gregorian date earlier than 1584\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <inception> ?pv . ?pv <pred:date> \"0200-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What activity was published on November 30th, 2006 on the Xbox 360 platform?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <publication date> ?pv . ?pv <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which war ended before January 1st, 1337 and is described as a statement with Gregorian date earlier than 1584?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <end time> ?pv . ?pv <pred:date> \"1337-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <end time> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which school has an inception date earlier than 1584 according to a statement with Gregorian date and has an instance of \"statement with Gregorian date earlier than 1584\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> school . ?e <inception> ?pv . ?pv <pred:date> \"1560-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which dynasty was dissolved, abolished or demolished before 1485 (according to statements with Gregorian date earlier than 1584)?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> dynasty . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"1485-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved, abolished or demolished> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which empire has an inception date of 1526-01-01 and is described as a statement with Gregorian date earlier than 1584?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> empire . ?e <inception> ?pv . ?pv <pred:date> \"1526-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the university whose inception date is 1457-09-21 (according to the Gregorian calendar), whose motto is \"Die Wahrheit wird euch frei machen\", and is part of a statement with Gregorian date earlier than 1584?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1457-09-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv_1 . ?qpv_1 <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <motto text> ?pv . ?pv <pred:value> \"Die Wahrheit wird euch frei machen.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <motto text> ; <pred:fact_t> ?pv ] <part of> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the statement with Gregorian date earlier than 1584 that pertains to the school whose official website is http://www.harrowschool.org.uk and has an inception date of 1572-01-01?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> school . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1572-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv_1 . ?qpv_1 <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.harrowschool.org.uk\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the statement with Gregorian date earlier than 1584 that pertains to the dynasty with a native label of Plantagent, which was dissolved, abolished or demolished in 1485?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> dynasty . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1485-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved, abolished or demolished> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv_1 . ?qpv_1 <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <native label> ?pv . ?pv <pred:value> \"Plantagent\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the cause of the organization whose inception date is 1916-08-25 and whose official website is http://www.nps.gov/ (the language of this statement is not specified)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1916-08-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <has cause> ?qpv_1 . ?qpv_1 <pred:value> \"National Park Service Organic Act\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.nps.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What part of the republic, whose inception date is 0697-01-01 (according to the Gregorian calendar), has a demonym of vnitien and applies to the statement with Gregorian date earlier than 1584?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv_1 . ?qpv_1 <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <demonym> ?pv . ?pv <pred:value> \"vnitien\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies to part> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin and number of seasons for the miniseries with a publication date of 1993-02-21 and a fact h of ?qpv?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1993-02-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <country> ?qpv_1 . ?qpv_1 <pred:value> \"Italy\" . ?e <number of seasons> ?pv . ?pv <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seasons> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the cause of the inception of the country whose Human Development Index is 0.799 and whose inception date is 1954-12-15 (according to the Charter for the Kingdom of the Netherlands)? Also, what is the point in time for this information?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-12-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <has cause> ?qpv_1 . ?qpv_1 <pred:value> \"Charter for the Kingdom of the Netherlands\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.799\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the stated age at event for the human with ISNI 0000 0001 0916 8967 who died on 2000-01-31 at the age of 73.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <date of death> ?pv_1 . ?pv_1 <pred:date> \"2000-01-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date of death> ; <pred:fact_t> ?pv_1 ] <stated age at event> ?qpv_1 . ?qpv_1 <pred:value> \"73.0\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0916 8967\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What part of democracy does the demonym \"vnitien\" apply to, for the instance of statement with Gregorian date earlier than 1584, for a democracy whose inception date is 0697-01-01?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv_1 . ?qpv_1 <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <demonym> ?pv . ?pv <pred:value> \"vnitien\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies to part> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the statement with Gregorian date earlier than 1584 that pertains to the capital whose time of earliest written record is 1067-01-01 and has a Dewey Decimal Classification of 2--4786?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"1067-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <time of earliest written record> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv_1 . ?qpv_1 <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--4786\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Hungary (whose demonym is ) and Hungarians (whose demonym is maghiar)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hungary\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"\" . ?e_2 <pred:name> Hungarians . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"maghiar\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kenya (with a Human Development Index of 0.539) and Tanzania (with a Human Development Index of 0.371)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kenya\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:value> \"0.539\" . ?e_2 <pred:name> Tanzania . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.371\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Hema Malini (whose name in native language is Hema Malini) and Dharmendra (whose name in native language is Dharmendra)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hema Malini\" . ?e_1 <name in native language> ?pv . ?pv <pred:value> \"Hema Malini\" . ?e_2 <pred:name> Dharmendra . ?e_2 <name in native language> ?pv_1 . ?pv_1 <pred:value> \"Dharmendra\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Forbes (the one with the official website https://www.forbes.com) and Forbes (the one with the official website http://www.forbes.com/)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Forbes\" . ?e_1 <official website> ?pv . ?pv <pred:value> \"https://www.forbes.com\" . ?e_2 <pred:name> Forbes . ?e_2 <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.forbes.com/\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Lower Saxony (with Dewey Decimal Classification of 2--4359) and Saxony-Anhalt (with Dewey Decimal Classification of 2--4318)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lower Saxony\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--4359\" . ?e_2 <pred:name> Saxony-Anhalt . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4318\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between BT (the one with Twitter username bt) and Rockville (the one with Twitter username Rockville411)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"BT\" . ?e_1 <Twitter username> ?pv . ?pv <pred:value> \"bt\" . ?e_2 <pred:name> Rockville . ?e_2 <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"Rockville411\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Saxony (whose nominal GDP is 1.13e+11) and Germany (whose nominal GDP is 3.43995e+12)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saxony\" . ?e_1 <nominal GDP> ?pv . ?pv <pred:value> \"1.13e+11\" . ?e_2 <pred:name> Germany . ?e_2 <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"3.43995e+12\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kanagawa Prefecture (with FIPS 10-4 code JA19) and Penang (with FIPS 10-4 code MY09)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kanagawa Prefecture\" . ?e_1 <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"JA19\" . ?e_2 <pred:name> Penang . ?e_2 <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"MY09\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Peterborough United F.C. (the one with an official website of https://www.theposh.com/) and Peterborough (the one with an official website of http://www.peterborough.gov.uk/)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peterborough United F.C.\" . ?e_1 <official website> ?pv . ?pv <pred:value> \"https://www.theposh.com/\" . ?e_2 <pred:name> Peterborough . ?e_2 <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.peterborough.gov.uk/\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between macOS (the one with Stack Exchange tag https://stackoverflow.com/tags/osx) and Unix (the one with Stack Exchange tag https://unix.stackexchange.com/tags/historical-unix)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"macOS\" . ?e_1 <Stack Exchange tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/osx\" . ?e_2 <pred:name> Unix . ?e_2 <Stack Exchange tag> ?pv_1 . ?pv_1 <pred:value> \"https://unix.stackexchange.com/tags/historical-unix\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What software has the nickname Longhorn and was created on 2007-01-30?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <nickname> ?pv . ?pv <pred:value> \"Longhorn\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2007-01-30\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]