[{"question": "What is the connection between Jersey (the one with an inception date of 1651-12-12) and Jersey (the one with a FIPS 10-4 code of JE)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jersey\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1651-12-12\"^^xsd:date . ?e_2 <pred:name> \"Jersey\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"JE\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bahrain (which was established on 1971-08-14) and the demonym \"bahrainer\"?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bahrain\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1971-08-14\"^^xsd:date . ?e_2 <pred:name> \"Bahrain\" . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"bahrainer\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Shakira (born on 1977-02-02) and Shakira (whose official website is http://empire.shakira.com/)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shakira\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1977-02-02\"^^xsd:date . ?e_2 <pred:name> \"Shakira\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://empire.shakira.com/\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Barrow-in-Furness (the one whose inception date is 1974-04-01) and Barrow-in-Furness (the one whose OS grid reference is SD198690)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Barrow-in-Furness\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Barrow-in-Furness\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SD198690\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Cyprus (the one whose inception date is 1960-01-01) and Cyprus (the one with the demonym \u043a\u0456\u043f\u0440\u0456\u043e\u0442\u043a\u0430)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cyprus\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Cyprus\" . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"\u043a\u0456\u043f\u0440\u0456\u043e\u0442\u043a\u0430\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Norwalk (the one with an inception date of 1640-02-26) and Norwalk (the one with a Dewey Decimal Classification of 2--79493)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Norwalk\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1640-02-26\"^^xsd:date . ?e_2 <pred:name> \"Norwalk\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79493\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Belize (which was established on 1981-09-21) and Belize (which has an IOC country code of BIZ)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Belize\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1981-09-21\"^^xsd:date . ?e_2 <pred:name> \"Belize\" . ?e_2 <IOC_country_code> ?pv_1 . ?pv_1 <pred:value> \"BIZ\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Oldham (the one with an inception date of 1974-04-01) and Oldham (the one with an OS grid reference of SD922053)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oldham\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Oldham\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SD922053\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Transylvania (published in 2006-01-01) to Transylvania (the one whose Dewey Decimal Classification is 2--4984543)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Transylvania\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2006-01-01\"^^xsd:date . ?e_2 <pred:name> \"Transylvania\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4984543\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Lithuania (the one whose inception date is 1918-02-16) to Lithuania (the one whose FIPS 10-4 code is LH)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lithuania\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1918-02-16\"^^xsd:date . ?e_2 <pred:name> \"Lithuania\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"LH\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mozambique (inception date: 1975-06-25) and the British Museum person-institution with a value of 179887?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mozambique\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1975-06-25\"^^xsd:date . ?e_2 <pred:name> \"Mozambique\" . ?e_2 <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"179887\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Niger (the one with an inception date of 1960-01-01) and Niger (the one with a Dewey Decimal Classification of 2--6626)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Niger\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Niger\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6626\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Edmonton (the one whose inception date is 1892-01-09) and Edmonton (the one with an OS grid reference of TQ335925)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Edmonton\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1892-01-09\"^^xsd:date . ?e_2 <pred:name> \"Edmonton\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ335925\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Walsall (the one with an inception date of 1974-04-01) and Walsall (the one with an OS grid reference of SP0198)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Walsall\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Walsall\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SP0198\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Manhattan (published on 1979-08-30) and Manhattan (the one with FIPS 6-4 code 36061)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Manhattan\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1979-08-30\"^^xsd:date . ?e_2 <pred:name> \"Manhattan\" . ?e_2 <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"36061\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Malibu (published on 2017-05-11) and Malibu (the one with WOEID 2444458)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Malibu\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2017-05-11\"^^xsd:date . ?e_2 <pred:name> \"Malibu\" . ?e_2 <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2444458\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Victoria (the one with an inception date of 1851-01-01) and Victoria (the one with a British Museum person-institution value of 49731)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Victoria\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1851-01-01\"^^xsd:date . ?e_2 <pred:name> \"Victoria\" . ?e_2 <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"49731\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Skyfall (published on 2012-10-23) and the ISWC T-915.499.391-6?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Skyfall\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2012-10-23\"^^xsd:date . ?e_2 <pred:name> \"Skyfall\" . ?e_2 <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-915.499.391-6\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Montana (the one with a publication date of 1950-01-01) and Montana (the one with a Dewey Decimal Classification of 2--786)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Montana\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1950-01-01\"^^xsd:date . ?e_2 <pred:name> \"Montana\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--786\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Philadelphia (the one with a publication date of 1994-02-24) and the British Museum person-institution with a value of 88716?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Philadelphia\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1994-02-24\"^^xsd:date . ?e_2 <pred:name> \"Philadelphia\" . ?e_2 <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"88716\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the book Dune (published on 1984-12-14) and the movie Dune (with the title Dune)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dune\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1984-12-14\"^^xsd:date . ?e_2 <pred:name> \"Dune\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Dune\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Saxony (the one dissolved, abolished or demolished on 1952-07-25) and Saxony (the one with Dewey Decimal Classification 2--4321)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saxony\" . ?e_1 <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1952-07-25\"^^xsd:date . ?e_2 <pred:name> \"Saxony\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4321\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Greece (the one whose inception date is 1821-03-25) and Greece (the one whose GS1 country code is 520)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Greece\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1821-03-25\"^^xsd:date . ?e_2 <pred:name> \"Greece\" . ?e_2 <GS1_country_code> ?pv_1 . ?pv_1 <pred:value> \"520\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Brooklyn (published on 2016-01-21) and Brooklyn (the one with FIPS 6-4 code 36047)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brooklyn\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2016-01-21\"^^xsd:date . ?e_2 <pred:name> \"Brooklyn\" . ?e_2 <FIPS_6-4_(US_counties)> ?pv_1 . ?pv_1 <pred:value> \"36047\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Daredevil (published on 2003-02-09) and Daredevil (whose birth name is Matthew Michael Murdock)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Daredevil\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2003-02-09\"^^xsd:date . ?e_2 <pred:name> \"Daredevil\" . ?e_2 <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Matthew Michael Murdock\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Chrysler (incepted on 1925-06-06) and the official website http://www.chrysler.com/?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chrysler\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1925-06-06\"^^xsd:date . ?e_2 <pred:name> \"Chrysler\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.chrysler.com/\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the band Yes (published on 1969-07-25) and the band Yes (with ISNI 0000 0001 1939 0123)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Yes\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1969-07-25\"^^xsd:date . ?e_2 <pred:name> \"Yes\" . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1939 0123\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the Catwoman publication on 2004-08-17 and the Catwoman Nintendo GameID GCZE69?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Catwoman\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2004-08-17\"^^xsd:date . ?e_2 <pred:name> \"Catwoman\" . ?e_2 <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"GCZE69\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Crash (which started on 2008-10-17) and its official website http://www.crashfilm.com?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Crash\" . ?e_1 <start_time> ?pv . ?pv <pred:date> \"2008-10-17\"^^xsd:date . ?e_2 <pred:name> \"Crash\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.crashfilm.com\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Morocco (the one whose inception date is 1956-04-07) and the entity with ISNI 0000 0001 2170 3280?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Morocco\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1956-04-07\"^^xsd:date . ?e_2 <pred:name> \"Morocco\" . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2170 3280\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Hawaii (the one with a publication date of 2010-05-12) and Hawaii (the one with a Dewey Decimal Classification of 2--969)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hawaii\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2010-05-12\"^^xsd:date . ?e_2 <pred:name> \"Hawaii\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--969\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Joseon (the one dissolved, abolished or demolished on 1897-10-12) and Joseon (the one with McCune-Reischauer romanization Chos\u014fn)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Joseon\" . ?e_1 <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1897-10-12\"^^xsd:date . ?e_2 <pred:name> \"Joseon\" . ?e_2 <McCune-Reischauer_romanization> ?pv_1 . ?pv_1 <pred:value> \"Chos\u014fn\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Footloose (published on 2011-10-20) and the song Footloose?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Footloose\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2011-10-20\"^^xsd:date . ?e_2 <pred:name> \"Footloose\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Footloose\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Helen (born on 1938-11-21) and Helen (whose Caverphone value is ALN111)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Helen\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1938-11-21\"^^xsd:date . ?e_2 <pred:name> \"Helen\" . ?e_2 <Caverphone> ?pv_1 . ?pv_1 <pred:value> \"ALN111\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mauritania (the one whose inception date is 1960-01-01) and Mauritania (the one whose FIPS 10-4 code is MR)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mauritania\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Mauritania\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"MR\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Antarctica (published in 1983-01-01) and Antarctica (the one with FIPS 10-4 code AY)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Antarctica\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1983-01-01\"^^xsd:date . ?e_2 <pred:name> \"Antarctica\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"AY\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the town named Preston (which was established on 1974-04-01) and the town with a TOID of 4000000074574696?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Preston\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Preston\" . ?e_2 <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074574696\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Watchmen (published on 2009-02-23) and its official website http://www.dccomics.com/watchmen?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Watchmen\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2009-02-23\"^^xsd:date . ?e_2 <pred:name> \"Watchmen\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.dccomics.com/watchmen\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Peru (the one whose inception date is 1821-01-01) and Peru (the one whose INSEE countries and foreign territories code is 99422)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Peru\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1821-01-01\"^^xsd:date . ?e_2 <pred:name> \"Peru\" . ?e_2 <INSEE_countries_and_foreign_territories_code> ?pv_1 . ?pv_1 <pred:value> \"99422\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Madagascar (which was established on 1960-01-01) and Madagascar (which has a Dewey Decimal Classification of 2--691)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Madagascar\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Madagascar\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--691\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Splash (published on 1984-03-09) and the title \"Splash\"?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Splash\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1984-03-09\"^^xsd:date . ?e_2 <pred:name> \"Splash\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Splash\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Illinois (published on 2005-07-04) and Illinois (whose Dewey Decimal Classification is 2--773)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Illinois\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2005-07-04\"^^xsd:date . ?e_2 <pred:name> \"Illinois\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--773\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Austria (the one whose inception date is 1918-11-12) and Austria (the one with an IOC country code of AUT)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Austria\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1918-11-12\"^^xsd:date . ?e_2 <pred:name> \"Austria\" . ?e_2 <IOC_country_code> ?pv_1 . ?pv_1 <pred:value> \"AUT\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bury (the one whose inception date is 1974-04-01) and Bury (the one with an OS grid reference of SD805105)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bury\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Bury\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SD805105\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Hulk (the one born on 1986-07-25) and Hulk (whose birth name is Bruce Banner)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hulk\" . ?e_1 <date_of_birth> ?pv . ?pv <pred:date> \"1986-07-25\"^^xsd:date . ?e_2 <pred:name> \"Hulk\" . ?e_2 <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Bruce Banner\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Taken (published on 2008-01-01) and its official website http://www.takenmovie.com?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Taken\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2008-01-01\"^^xsd:date . ?e_2 <pred:name> \"Taken\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.takenmovie.com\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the Ramones (published on 1976-04-23) and the Ramones (whose Giphy username is ramones)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ramones\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1976-04-23\"^^xsd:date . ?e_2 <pred:name> \"Ramones\" . ?e_2 <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"ramones\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Psycho (published on 1998-01-01) and the book Psycho (with the title Psycho)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Psycho\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1998-01-01\"^^xsd:date . ?e_2 <pred:name> \"Psycho\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Psycho\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Paris (the one with a publication date of 1929-01-01) and Paris (the one with an ISO_3166-2_code of FR-75)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paris\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1929-01-01\"^^xsd:date . ?e_2 <pred:name> \"Paris\" . ?e_2 <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"FR-75\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guyana (the one whose inception date is 1966-01-01) and Guyana (the one whose INSEE countries and foreign territories code is 99428)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guyana\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1966-01-01\"^^xsd:date . ?e_2 <pred:name> \"Guyana\" . ?e_2 <INSEE_countries_and_foreign_territories_code> ?pv_1 . ?pv_1 <pred:value> \"99428\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the book Frankenstein (published on 1818-01-01) and the movie Frankenstein (with the title Frankenstein)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Frankenstein\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1818-01-01\"^^xsd:date . ?e_2 <pred:name> \"Frankenstein\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Frankenstein\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Brazil (which was established on 1822-01-01) and the demonym \"brasilianer\"?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brazil\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1822-01-01\"^^xsd:date . ?e_2 <pred:name> \"Brazil\" . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"brasilianer\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an organization with an ISNI of 0000 0001 2172 7549 that has 80.0 seats?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <number_of_seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2172 7549\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2172 7549\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a democracy with a Human Development Index of 0.424 and a British Museum person-institution value of 180889?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.424\"^^xsd:double . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"180889\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British_Museum_person-institution> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"180889\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the number of episodes for filmmaking equal to 56.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"filmmaking\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"56.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an activity with 20 participants and a Twitter username of SerieA?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <number_of_participants> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"SerieA\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"SerieA\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]