[{"question": "What is the language of work or name for Aude (the one whose inception date is 1790-03-04) and has a pronunciation audio file named Oc-Aude.ogg?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Aude\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-03-04\"^^xsd:date . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Oc-Aude.ogg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.city.milwaukee.gov/ website regarding Milwaukee (the one whose inception date is 1846-01-31)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Milwaukee\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1846-01-31\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.city.milwaukee.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Sapporo (the one with a local dialing code of 011) start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sapporo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1868-01-01\"^^xsd:date . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"011\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local_dialing_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.hobokennj.org/ regarding Hoboken (the one whose inception date is 1849-04-09)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hoboken\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1849-04-09\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.hobokennj.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the city Norwalk (incepted on 1640-02-26) with the official website http://www.norwalkct.org/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Norwalk\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1640-02-26\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.norwalkct.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the movie \"Glory\" (published on 2018-01-04) start using exploitation visa number 146422?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Glory\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2018-01-04\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"146422\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of Pran (the one who died on 2013-07-12)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Pran\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"2013-07-12\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.pransikand.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the movie \"Inception\" (published on 2010-07-08) start using the exploitation visa number 126718?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Inception\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-07-08\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"126718\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Canal+ (the one with the motto \"Canal+, cr\u00e9ateur original de programmes originaux\") end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Canal+\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1984-11-04\"^^xsd:date . ?e <motto_text> ?pv . ?pv <pred:value> \"Canal+, cr\u00e9ateur original de programmes originaux\" . [ <pred:fact_h> ?e ; <pred:fact_r> <motto_text> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 132830 for the movie Tyrannosaur start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Tyrannosaur\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-10-13\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"132830\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Twitter account \"eigapaddington\" have for the movie Paddington (published on 2014-11-23)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Paddington\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2014-11-23\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"eigapaddington\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.ci.eureka.ca.gov website regarding the city Eureka (which was established on 1850-05-13)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Eureka\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1850-05-13\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ci.eureka.ca.gov\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Missouri start using the motto \"Salus populi suprema lex esto\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Missouri\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-08-10\"^^xsd:date . ?e <motto_text> ?pv . ?pv <pred:value> \"Salus populi suprema lex esto\" . [ <pred:fact_h> ?e ; <pred:fact_r> <motto_text> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 147540 for Detroit (the one with a publication date of 2017-11-23) start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Detroit\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2017-11-23\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"147540\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Hugo (born on 1981-08-06) have on Twitter with the username HugoOfficial?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hugo\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1981-08-06\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"HugoOfficial\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the movie Gattaca (published on 1997-09-07)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Gattaca\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1997-09-07\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sonypictures.com/movies/gattaca/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Piedmont have a population of 4.36756e+06 and a Dewey Decimal Classification of 2--451?", "sparql": "ASK { ?e <pred:name> \"Piedmont\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.36756e+06\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--451\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Cardiff 361,468 and does it have an ISO 3166-2 code of GB-CRF?", "sparql": "ASK { ?e <pred:name> \"Cardiff\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"361468.0\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"GB-CRF\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Zambia have a Human Development Index of 0.403 and a Dewey Decimal Classification of 2--6894?", "sparql": "ASK { ?e <pred:name> \"Zambia\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.403\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6894\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the language with the Ethnologue.com language code \"chr\" Cherokee and has a number of speakers equal to 12300.0?", "sparql": "ASK { ?e <pred:name> \"Cherokee\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"12300.0\"^^xsd:double . ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"chr\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Groningen equal to 582,728 and does it have a NUTS code of NL11?", "sparql": "ASK { ?e <pred:name> \"Groningen\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"582728.0\"^^xsd:double . ?e <NUTS_code> ?pv . ?pv <pred:value> \"NL11\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Dorset equal to 744041.0 and does it have a FIPS 10-4 code of UKD6?", "sparql": "ASK { ?e <pred:name> \"Dorset\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"744041.0\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"UKD6\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the X-Men series have exactly 76 episodes?", "sparql": "ASK { ?e <pred:name> \"X-Men\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"76.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"76.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Qantas have an Australian Business Number of 16009661901 and 29596.0 employees?", "sparql": "ASK { ?e <pred:name> \"Qantas\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29596.0\"^^xsd:double . ?e <Australian_Business_Number> ?pv . ?pv <pred:value> \"16009661901\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does malaria have a DiseasesDB value of 7728 and a number of cases equal to 881730.0?", "sparql": "ASK { ?e <pred:name> \"malaria\" . ?e <number_of_cases> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"881730.0\"^^xsd:double . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"7728\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Messina 236,962 and does it have a Dewey Decimal Classification of 2--458111?", "sparql": "ASK { ?e <pred:name> \"Messina\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"236962.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--458111\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Alton 30496 and does it have an official website of http://www.alton-il.com?", "sparql": "ASK { ?e <pred:name> \"Alton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"30496.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.alton-il.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Leicestershire equal to 1.0438e+06 and does it have an ISO 3166-2 code of GB-LEC?", "sparql": "ASK { ?e <pred:name> \"Leicestershire\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0438e+06\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"GB-LEC\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Williamsburg 15206.0 and does it have a Dewey Decimal Classification of 2--7554252?", "sparql": "ASK { ?e <pred:name> \"Williamsburg\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"15206.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--7554252\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Appleton 72623 and does it have an official website of http://www.appleton.org?", "sparql": "ASK { ?e <pred:name> \"Appleton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"72623.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.appleton.org\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Ciara's name in native language also Ciara and does she have 1 child?", "sparql": "ASK { ?e <pred:name> \"Ciara\" . ?e <number_of_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Ciara\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Spartacus have 33 episodes and a duration of 50 minutes?", "sparql": "ASK { ?e <pred:name> \"Spartacus\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"33.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"50.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Lincolnshire equal to 1.0661e+06 and does it have a NUTS code of UKF3?", "sparql": "ASK { ?e <pred:name> \"Lincolnshire\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0661e+06\"^^xsd:double . ?e <NUTS_code> ?pv . ?pv <pred:value> \"UKF3\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Futurama have 140 episodes that are each 22 minutes long?", "sparql": "ASK { ?e <pred:name> \"Futurama\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"140.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"22.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Anchorage's population 226,338 and its Dewey Decimal Classification 2--79835?", "sparql": "ASK { ?e <pred:name> \"Anchorage\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"226338.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79835\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ecuador have a Human Development Index of 0.603 and a Dewey Decimal Classification of 2--866?", "sparql": "ASK { ?e <pred:name> \"Ecuador\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.603\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--866\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Mangalore 623,841 and its local dialing code 824?", "sparql": "ASK { ?e <pred:name> \"Mangalore\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"623841.0\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"824\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Regina equal to 215106 and does it have an ISNI of 0000 0001 0693 892X?", "sparql": "ASK { ?e <pred:name> \"Regina\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"215106.0\"^^xsd:double . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0693 892X\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Mississauga 721,599 and the elevation above sea level 156?", "sparql": "ASK { ?e <pred:name> \"Mississauga\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"721599.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"156.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Claremont 34926 and does it have an official website of http://www.ci.claremont.ca.us?", "sparql": "ASK { ?e <pred:name> \"Claremont\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"34926.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ci.claremont.ca.us\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Thuringia 2.161e+06 and the area 16171.0?", "sparql": "ASK { ?e <pred:name> \"Thuringia\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.161e+06\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"16171.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Shanxi equal to 3.65e+07 and does it have an ISO 3166-2 code of CN-14?", "sparql": "ASK { ?e <pred:name> \"Shanxi\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.65e+07\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"CN-14\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Brockton 93810 and the elevation above sea level 34?", "sparql": "ASK { ?e <pred:name> \"Brockton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"93810.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"34.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Magdeburg 22676.0 and does it have a Dewey Decimal Classification of 2--431822?", "sparql": "ASK { ?e <pred:name> \"Magdeburg\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"22676.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--431822\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Minnesota 2.98248e+06 and does it have a Dewey Decimal Classification of 2--776?", "sparql": "ASK { ?e <pred:name> \"Minnesota\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.98248e+06\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--776\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Liverpool 478600 and does it have an ISO 3166-2 code of GB-LIV?", "sparql": "ASK { ?e <pred:name> \"Liverpool\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"478600.0\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"GB-LIV\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Greenland 52700.0 and does it have a Dewey Decimal Classification of 2--982?", "sparql": "ASK { ?e <pred:name> \"Greenland\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"52700.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--982\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Burundi have a Human Development Index of 0.328 and a Dewey Decimal Classification of 2--67572?", "sparql": "ASK { ?e <pred:name> \"Burundi\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.328\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--67572\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Wolverhampton 250,970 and does it have a native label equal to Wolverhampton?", "sparql": "ASK { ?e <pred:name> \"Wolverhampton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"250970.0\"^^xsd:double . ?e <native_label> ?pv . ?pv <pred:value> \"Wolverhampton\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Berkeley 122,324 and does it have a Dewey Decimal Classification of 2--79467?", "sparql": "ASK { ?e <pred:name> \"Berkeley\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"122324.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79467\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Vicenza 112,408 and does it have an official website of http://www.comune.vicenza.it?", "sparql": "ASK { ?e <pred:name> \"Vicenza\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112408.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.comune.vicenza.it\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Gabon have a Human Development Index of 0.673 and a Dewey Decimal Classification of 2--6721?", "sparql": "ASK { ?e <pred:name> \"Gabon\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.673\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6721\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Peoria 115,007 and its local dialing code 309?", "sparql": "ASK { ?e <pred:name> \"Peoria\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"115007.0\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"309\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Yangon 5.20954e+06 and the elevation above sea level 15.0?", "sparql": "ASK { ?e <pred:name> \"Yangon\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.20954e+06\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"15.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nintendo have 5120 employees and a Twitter username of Nintendo?", "sparql": "ASK { ?e <pred:name> \"Nintendo\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5120.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Nintendo\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Heroes\" have 78 episodes and a duration of 42 minutes per episode?", "sparql": "ASK { ?e <pred:name> \"Heroes\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"78.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"42.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Worthing 104,600 and the elevation above sea level 7.0?", "sparql": "ASK { ?e <pred:name> \"Worthing\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"104600.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"7.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Yonkers 195976 and the elevation above sea level 25?", "sparql": "ASK { ?e <pred:name> \"Yonkers\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"195976.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"25.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bismarck 61272 and the area 87.3817?", "sparql": "ASK { ?e <pred:name> \"Bismarck\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"61272.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"87.3817\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Chile have a Human Development Index of 0.699 and a Dewey Decimal Classification of 2--83?", "sparql": "ASK { ?e <pred:name> \"Chile\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.699\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--83\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Plovdiv equal to \"\u041f\u043b\u043e\u0432\u0434\u0438\u0432\" and its population 333,206?", "sparql": "ASK { ?e <pred:name> \"Plovdiv\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"333206.0\"^^xsd:double . ?e <native_label> ?pv . ?pv <pred:value> \"\u041f\u043b\u043e\u0432\u0434\u0438\u0432\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pas-de-Calais have an annual number of weddings equal to 5315.0 and a SIREN number of 226200012?", "sparql": "ASK { ?e <pred:name> \"Pas-de-Calais\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5315.0\"^^xsd:double . ?e <SIREN_number> ?pv . ?pv <pred:value> \"226200012\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Thailand have a Human Development Index of 0.539 and a Dewey Decimal Classification of 2--593?", "sparql": "ASK { ?e <pred:name> \"Thailand\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.539\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--593\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Mogadishu 2.12e+06 and the elevation above sea level 9.0?", "sparql": "ASK { ?e <pred:name> \"Mogadishu\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.12e+06\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"9.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]