[{"question": "When did the island with ISO 3166-2 code NZ-N cease to exist?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-N\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"NZ-N\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the play with the official website http://aladdinthemusical.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://aladdinthemusical.com\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://aladdinthemusical.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the subreddit that is related to both reggae and dancehall?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"dancehall\" . ?e <subreddit> ?pv . ?pv <pred:value> \"dancehall\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the capital with Dewey Decimal Classification 2--43712 and ISO 3166-2 code CZ-PR end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43712\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the hex triplet value for the color orange?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"orange\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"FFD700\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"FFD700\" . [ <pred:fact_h> ?e ; <pred:fact_r> <sRGB_color_hex_triplet> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What writing system is used for the dynasty with the name in native language \"\u0411\u043e\u0440\u0436\u0438\u0433\u0438\u043d\" and \"\u182a\u1823\u1837\u1835\u1822\u182d\u1822\u1828\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"\u0411\u043e\u0440\u0436\u0438\u0433\u0438\u043d\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"\u182a\u1823\u1837\u1835\u1822\u182d\u1822\u1828\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <writing_system> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the interdisciplinarity classification code for the program with the code 05.0207?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"interdisciplinarity\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"05.0207\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"05.0207\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Classification_of_Instructional_Programs_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the metropolis with a Dewey Decimal Classification of 2--71428 and an official website of http://ville.montreal.qc.ca/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--71428\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://ville.montreal.qc.ca/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the conservatory with the ISNI 0000 0001 2223 4754 and the short name \u0421\u041f\u0431\u041a end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2223 4754\" . ?e <short_name> ?pv . ?pv <pred:value> \"\u0421\u041f\u0431\u041a\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.coloradocollege.edu website regarding the college with a 0000 0001 0657 7781 ISNI?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0657 7781\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.coloradocollege.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.speaker.gov website regarding the speaker who has the official website http://www.speaker.gov/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.speaker.gov/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.speaker.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for the clarinet (Hornbostel-Sachs classification 422.211.2-71)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"clarinet\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"422.211.2-71\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"788.65\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the technology with the pronunciation audio \"LL-Q150 (fra)-X-Javier-technologie de l'information.wav\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"technology\" . ?e <pronunciation_audio> ?pv_1 . ?pv_1 <pred:value> \"LL-Q150 (fra)-X-Javier-technologie de l'information.wav\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"LL-Q150 (fra)-X-Javier-technologie de l'information.wav\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for the human with a CANTIC-ID of a19144258 and a British Museum person-institution of 17780?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"17780\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a19144258\" . [ <pred:fact_h> ?e ; <pred:fact_r> <CANTIC-ID> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://windows.microsoft.com/en-us/windows/products/windows-xp website regarding the industry with the Stack Exchange tag https://stackoverflow.com/tags/windows-xp?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/windows-xp\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://windows.microsoft.com/en-us/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Stack Exchange tag for engineering and the IPTC Newscode for mediatopic/20000760?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"engineering\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://engineering.stackexchange.com/tags/civil-engineering\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000760\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for the author with ISCO occupation code 2451?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"E1102\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.ucc.org website regarding Protestantism (the one with ISNI 0000 0004 0508 6616)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ucc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the initialism with Dewey Decimal Classification 306.7663 and subreddit \"lesbians\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the neighborhood with a local dialing code of 818 and an official website of http://www.tarzananc.org/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"818\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tarzananc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the tragedy that has a value of 809.2523?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"tragedy\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"809.2523\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Serbo-Croatian?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"491.83\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"491.83\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the subreddit that is related to both trance and psytrance?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . ?e <subreddit> ?pv . ?pv <pred:value> \"psytrance\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the landform with ISO 3166-2 code NZ-N end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-N\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"NZ-N\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for the merchant with the code D1201?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"merchant\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"D1201\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"D1201\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the philosophy subreddit with the value \"Conservative\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Conservative\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Conservative\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the phenomenon with IPTC_Newscode mediatopic/20000441 and subreddit nature?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000441\" . ?e <subreddit> ?pv . ?pv <pred:value> \"nature\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the subreddit \"photocritique\" regarding the art with a Dewey Decimal Classification of 770?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"770\" . ?e <subreddit> ?pv . ?pv <pred:value> \"photocritique\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the drama genre?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drama\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"809.2523\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the subreddit that is related to both techno and minimal?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" . ?e <subreddit> ?pv . ?pv <pred:value> \"minimal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation that follows \"94\" in folklore and precedes \"95\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"folklore\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"94\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the KldB-2010_occupation_code for the chemist with a value of 41284?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemist\" . ?e <KldB-2010_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"41284\" . ?e <KldB-2010_occupation_code> ?pv . ?pv <pred:value> \"41284\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KldB-2010_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What regular expression format does the color with a short name of \"W\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"color\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"W\" . ?e <short_name> ?pv . ?pv <pred:value> \"W\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <format_as_a_regular_expression> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the transliteration of \u0627\u0644\u0634\u0650\u0651\u064a\u0639\u064e\u0629 in Islam (the one with Dewey Decimal Classification 297.82)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"297.82\" . ?e <native_label> ?pv . ?pv <pred:value> \"\u0627\u0644\u0634\u0650\u0651\u064a\u0639\u064e\u0629\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <transliteration> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for the doctrine with an IAB code of 454?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"doctrine\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"454\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"211.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the state with IPTC_Newscode mediatopic/20000801 and pronunciation audio LL-Q5146 (por)-NMaia-pobreza.wav?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000801\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"LL-Q5146 (por)-NMaia-pobreza.wav\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What part does the demonym \"Byzantin\" apply to in the empire with the demonym \"bizantino\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"bizantino\" . ?e <demonym> ?pv . ?pv <pred:value> \"Byzantin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for the sport with the code 498?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"498\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"498\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the researcher's ISCO occupation code and KldB-2010 occupation code?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <KldB-2010_occupation_code> ?pv . ?pv <pred:value> \"41284\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KldB-2010_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the https://www.oscars.org/ website regarding the association with a 0000 0004 1936 7478 ISNI?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1936 7478\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.oscars.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for the screenwriter with ISCO occupation code 2451?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"screenwriter\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"E1102\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the drum with a value of 211.261.1?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"211.261.1\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"211.261.1\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.wharton.upenn.edu website regarding the school with a 0000 0001 2322 6561 ISNI?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2322 6561\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.wharton.upenn.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the saxophone?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"saxophone\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"422.212-71\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"422.212-71\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.state.nj.us/governor/ website regarding the governor?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.state.nj.us/governor/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.state.nj.us/governor/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for literature with a value of 820?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literature\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"820\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"820\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UMLS CUI for the psychosis with DiseasesDB ID 11890?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"psychosis\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"11890\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0036341\" . [ <pred:fact_h> ?e ; <pred:fact_r> <UMLS_CUI> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for travel?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"travel\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"672\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"672\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the Twitter username \"Pontifex\" regarding the monarch with an IPTC_Newscode of \"mediatopic/20000704\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"monarch\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000704\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Pontifex\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for music?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"368\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"368\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the National Heritage List for England number for the palace with the number 1117776?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"palace\" . ?e <National_Heritage_List_for_England_number> ?pv_1 . ?pv_1 <pred:value> \"1117776\" . ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1117776\" . [ <pred:fact_h> ?e ; <pred:fact_r> <National_Heritage_List_for_England_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OSM tag or key for Calvinism that has the value \"Tag:denomination=presbyterian\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Calvinism\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:denomination=presbyterian\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:denomination=presbyterian\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the concept with M.49 code 001?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"concept\" . ?e <M.49_code> ?pv_1 . ?pv_1 <pred:value> \"001\" . ?e <M.49_code> ?pv . ?pv <pred:value> \"001\" . [ <pred:fact_h> ?e ; <pred:fact_r> <M.49_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]