[{"question": "What is the official name of Bhubaneswar?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bhubaneswar\" . ?e <official_name> ?pv . ?pv <pred:value> \"Bhubaneswar\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the Swedish Literature Bank AuthorID for Voltaire?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Voltaire\" . ?e <Swedish_Literature_Bank_AuthorID> ?pv . ?pv <pred:value> \"Voltaire\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Swedish_Literature_Bank_AuthorID> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username of easyJet?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"easyJet\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"easyJet\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Kaohsiung?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Kaohsiung\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Kaohsiung\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Maryland?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Maryland\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Maryland\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in native language of Pran?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Pran\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Pran\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dictionary of Medieval Names from European Sources entry for the name Norman?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Norman\" . ?e <Dictionary_of_Medieval_Names_from_European_Sources_entry> ?pv . ?pv <pred:value> \"Norman\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dictionary_of_Medieval_Names_from_European_Sources_entry> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Pasadena?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Pasadena\" . ?e <official_name> ?pv . ?pv <pred:value> \"Pasadena\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Trenton?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Trenton\" . ?e <native_label> ?pv . ?pv <pred:value> \"Trenton\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Aspen?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Aspen\" . ?e <official_name> ?pv . ?pv <pred:value> \"Aspen\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Atlanta?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Atlanta\" . ?e <official_name> ?pv . ?pv <pred:value> \"Atlanta\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Nickelodeon?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nickelodeon\" . ?e <title> ?pv . ?pv <pred:value> \"Nickelodeon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Ulm?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ulm\" . ?e <official_name> ?pv . ?pv <pred:value> \"Ulm\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Forbes have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Forbes\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Forbes\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Nuremberg?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nuremberg\" . ?e <title> ?pv . ?pv <pred:value> \"Nuremberg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Sheffield?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sheffield\" . ?e <official_name> ?pv . ?pv <pred:value> \"Sheffield\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the short name of Spain?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Spain\" . ?e <short_name> ?pv . ?pv <pred:value> \"Spain\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Odense?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Odense\" . ?e <native_label> ?pv . ?pv <pred:value> \"Odense\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Trier?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Trier\" . ?e <official_name> ?pv . ?pv <pred:value> \"Trier\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Africa?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Africa\" . ?e <title> ?pv . ?pv <pred:value> \"Africa\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Linz?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Linz\" . ?e <native_label> ?pv . ?pv <pred:value> \"Linz\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Philippines\" in the Philippines?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Philippines\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Philippines\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Iowa\" in Iowa?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Iowa\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Iowa\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Dorset?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Dorset\" . ?e <native_label> ?pv . ?pv <pred:value> \"Dorset\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Bethesda?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bethesda\" . ?e <official_name> ?pv . ?pv <pred:value> \"Bethesda\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Quebec\" related to Quebec?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Quebec\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Quebec\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Apple have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Apple\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Apple\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Ohio?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ohio\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Ohio\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who has the title \"Elizabeth\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Elizabeth\" . ?e <title> ?pv . ?pv <pred:value> \"Elizabeth\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Doncaster?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Doncaster\" . ?e <native_label> ?pv . ?pv <pred:value> \"Doncaster\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Z\u00fcrich?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Z\u00fcrich\" . ?e <official_name> ?pv . ?pv <pred:value> \"Z\u00fcrich\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Kaunas?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Kaunas\" . ?e <native_label> ?pv . ?pv <pred:value> \"Kaunas\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Arizona\" in Arizona?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Arizona\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Arizona\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Alberta\" related to Alberta?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Alberta\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Alberta\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the organization that was caused by the National Park Service Organic Act and has an inception date of 1916-08-25?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1916-08-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <has_cause> ?qpv . ?qpv <pred:value> \"National Park Service Organic Act\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the demonym of the democracy that has an inception date earlier than 1584?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <demonym> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the activity that was published on 2006-11-30 and is available on Xbox 360?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv_1 ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" . ?e <language_of_work_or_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the dynasty, which has a statement with a Gregorian date earlier than 1584 as its instance of, dissolve, abolish, or demolish?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1485-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved,_abolished_or_demolished> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What country is associated with the crime that ended on 1799-11-09 and is referred to as \"18 Brumaire\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1799-11-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <end_time> ; <pred:fact_t> ?pv_1 ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"18 Brumaire\" . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the director of the anime that was published in Germany on 2010-09-16?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-09-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv_1 ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <director> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the instance of the war that ended before 1337-01-01 (the one whose instance of is a statement with Gregorian date earlier than 1584)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1337-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <end_time> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <pred:instance_of> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the demonym of the republic that has an inception date earlier than 1584 (the one whose inception date is 0697-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <demonym> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital city that has a time of earliest written record of 1067-01-01 and is an instance of a statement with Gregorian date earlier than 1584?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"1067-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <time_of_earliest_written_record> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <capital_of> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Instagram username of the agent whose inception is caused by the National Park Service Organic Act and occurred on 1916-08-25?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1916-08-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <has_cause> ?qpv . ?qpv <pred:value> \"National Park Service Organic Act\" . ?e <Instagram_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the miniseries published on 1990-11-18 in the United States of America?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1990-11-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv_1 ] <country> ?qpv . ?qpv <pred:value> \"United States of America\" . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member in the film that was published in Germany on 2001-08-16?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv_1 ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the state dissolved, abolished, or demolished in the United States of America?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1865-12-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved,_abolished_or_demolished> ; <pred:fact_t> ?pv_1 ] <country> ?qpv . ?qpv <pred:value> \"United States of America\" . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which school has an inception date earlier than 1584 (according to the Gregorian calendar) and is located in a country?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1572-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the TeX string for the currency that applies to demand deposit and was introduced on 1999-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <applies_to_part> ?qpv . ?qpv <pred:value> \"demand deposit\" . ?e <TeX_string> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of the city that has an inception date earlier than 1584 (the one whose inception date is 0200-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0200-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which university has an inception date earlier than 1584 and has an IPv6 routing prefix?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1558-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <IPv6_routing_prefix> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the platform for the entertainment with a publication date of 2006-11-30 and is an instance of Xbox 360?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv_1 ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" . ?e <pred:instance_of> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the empire, which is a statement with a Gregorian date earlier than 1584, dissolved, abolished, or demolished?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1526-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Harlem have a subreddit called \"Harlem\" and an area of 3.871?", "sparql": "ASK { ?e <pred:name> \"Harlem\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Harlem\" . ?e <area> ?pv . ?pv <pred:value> \"3.871\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Buddhism have a subreddit called \"Buddhism\" and a Dewey Decimal Classification of 294.3?", "sparql": "ASK { ?e <pred:name> \"Buddhism\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Buddhism\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"294.3\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Dharmendra's name in native language Dharmendra and does he have an ISNI of 0000 0000 7840 7274?", "sparql": "ASK { ?e <pred:name> \"Dharmendra\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Dharmendra\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7840 7274\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Jakarta \"Jakarta\" and does it have a Dewey Decimal Classification of 2--59822?", "sparql": "ASK { ?e <pred:name> \"Jakarta\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Jakarta\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--59822\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"2046\" with a duration of 129.0 minutes?", "sparql": "ASK { ?e <pred:name> \"2046\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"2046\" . ?e <duration> ?pv . ?pv <pred:value> \"129.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the cost of the movie Casablanca 950000.0?", "sparql": "ASK { ?e <pred:name> \"Casablanca\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Casablanca\" . ?e <cost> ?pv . ?pv <pred:value> \"950000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Washington have a subreddit named \"Washington\" and a British Museum person-institution ID of 100674?", "sparql": "ASK { ?e <pred:name> \"Washington\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Washington\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"100674\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the subreddit \"snowboarding\" have an IAB code of 504?", "sparql": "ASK { ?e <pred:name> \"snowboarding\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"snowboarding\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"504\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of the movie Silkwood 131.0?", "sparql": "ASK { ?e <pred:name> \"Silkwood\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Silkwood\" . ?e <duration> ?pv . ?pv <pred:value> \"131.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of the show MASH 116.0?", "sparql": "ASK { ?e <pred:name> \"MASH\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"MASH\" . ?e <duration> ?pv . ?pv <pred:value> \"116.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of Nickelodeon 122.0?", "sparql": "ASK { ?e <pred:name> \"Nickelodeon\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Nickelodeon\" . ?e <duration> ?pv . ?pv <pred:value> \"122.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Erfurt \"Erfurt\" and does it have a Dewey Decimal Classification of 2--432248?", "sparql": "ASK { ?e <pred:name> \"Erfurt\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Erfurt\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--432248\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]