[{"question": "Is there a republic that was established on 1822-01-07 and has a British Museum person-institution ID of 180889?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-07\"^^xsd:date . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"180889\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the division with the official name \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" dissolved on 2015-09-16?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2015-09-16\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Northern Dancer a taxon with a date of birth of 1961-05-27?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1961-05-27\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a capital city with an inception date of June 24, 1571 and a FIPS 10-4 code of RPD9?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1571-06-24\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"RPD9\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the agent with ISNI 0000 0000 9987 0743 established on 1946-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9987 0743\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a country that was established on December 15, 1954 and has a Dewey Decimal Classification of 2--492?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-12-15\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--492\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the manga with a publication date of 1952-04-01 and an official website of http://tezukaosamu.net?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1952-04-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the college with an inception date of 1824-01-01 and an ISNI of 0000 0001 0719 5427 exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0719 5427\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anthology with a publication date of April 11, 1960 and an OCLC control number of 357792?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-04-11\"^^xsd:date . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"357792\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the song published on 1995-05-30 and has a duration of 238.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1995-05-30\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"238.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a miniseries with a publication date of 1999-10-16 and a duration of 177.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1999-10-16\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"177.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did marketing have a first flight on 1967-04-09 and a RIA_Novosti_reference of 61684885?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <first_flight> ?pv_1 . ?pv_1 <pred:date> \"1967-04-09\"^^xsd:date . ?e <RIA_Novosti_reference> ?pv . ?pv <pred:value> \"61684885\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the person with ISNI 0000 0001 0873 3741 born on 1934-08-18 an occupation?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the comedy end on 1992-05-09 and have a duration of 25.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1992-05-09\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"25.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a neighborhood with an inception date of 1630-09-28 and a postal code of 02119?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-28\"^^xsd:date . ?e <postal_code> ?pv . ?pv <pred:value> \"02119\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the soundtrack titled \"Iron Man 2\" published on April 19, 2010?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-04-19\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Iron Man 2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a newspaper with an inception date of 1851-09-18 and an Alexa rank of 112.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1851-09-18\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:value> \"112.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the army with ISNI 0000 0004 0498 1870 established on 1947-08-15?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-08-15\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0498 1870\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the CANTIC-ID of Mormonism equal to a11336638 and was it founded on 1830-04-06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1830-04-06\"^^xsd:date . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11336638\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a cemetery located at Avenue Samson, 37 that was established on January 1, 1825?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e <located_at_street_address_(DEPRECATED)> ?pv . ?pv <pred:value> \"Avenue Samson, 37\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a film with a publication date of 2001-08-16 and a duration of 98.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2001-08-16\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"98.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the newscast with the Instagram username \"todayshow\" first performed on January 14, 1952?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <Instagram_username> ?pv . ?pv <pred:value> \"todayshow\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a state that was dissolved, abolished, or demolished on 1991-08-24 and had an area of 603700.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1991-08-24\"^^xsd:date . ?e <area> ?pv . ?pv <pred:value> \"603700.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an opera with a date of first performance on January 25, 1909 and only one part?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1909-01-25\"^^xsd:date . ?e <number_of_parts_of_this_work_of_art> ?pv . ?pv <pred:value> \"1.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the governor, whose inception date is 1792-06-04, associated with the official website http://governor.ky.gov/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1792-06-04\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://governor.ky.gov/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label \"Speaker of the United States House of Representatives\" associated with a politician whose inception date is 1789-04-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-01\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Speaker of the United States House of Representatives\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a painting with an inception date of 1906-01-01 and a height of 99.6?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"painting\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1906-01-01\"^^xsd:date . ?e <height> ?pv . ?pv <pred:value> \"99.6\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the genre with an inception date of 1876-01-01 associated with the official website http://harvardlampoon.com/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1876-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://harvardlampoon.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the musical with the official website http://aladdinthemusical.com first performed on 2011-07-07?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"2011-07-07\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://aladdinthemusical.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a single with the publication date of 1998-11-24 and the ISWC of T-070.942.427-0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-11-24\"^^xsd:date . ?e <ISWC> ?pv . ?pv <pred:value> \"T-070.942.427-0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did US 66 end on June 27, 1985?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1985-06-27\"^^xsd:date . ?e <road_number> ?pv . ?pv <pred:value> \"US 66\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the writer with ISNI 0000 0001 0873 3741 born on 1934-08-18?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the business with ISNI 0000 0000 8338 5874 established on 1887-03-04?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1887-03-04\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8338 5874\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a school with an inception date of 1611-01-01 and an ARCHON code of 1143?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1611-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"1143\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the religion with ISNI 0000 0004 0508 6616 established on 1957-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0508 6616\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the play with the date of first performance on 2011-07-07 and the official website http://aladdinthemusical.com?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"2011-07-07\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://aladdinthemusical.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the award with ISNI 0000 0004 0644 5609 established on 1983-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0644 5609\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a museum with an inception date of 1824-01-01 and an ARCHON code of 345?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the currency with ISO 4217 code GBP start on 1694-07-27?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1694-07-27\"^^xsd:date . ?e <ISO_4217_code> ?pv . ?pv <pred:value> \"GBP\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the person with ISNI 0000 0000 5930 3891 born on September 21, 1931?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1931-09-21\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 5930 3891\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the conservatory with an inception date of 1921-01-01 and an ISNI of 0000 0001 2189 390X exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1921-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2189 390X\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an association with an ARCHON code of 397 and an inception date of 1768-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1768-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"397\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Northern Dancer an animal with a date of birth of 1961-05-27?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animal\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1961-05-27\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the news with the Instagram username \"todayshow\" first performed on 1952-01-14?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <Instagram_username> ?pv . ?pv <pred:value> \"todayshow\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the city with an inception date of 1850-01-01 and an area of 187.7?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1850-01-01\"^^xsd:date . ?e <area> ?pv . ?pv <pred:value> \"187.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Instagram username \"vp\" associated with a position that was established on 1789-04-21?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-21\"^^xsd:date . ?e <Instagram_username> ?pv . ?pv <pred:value> \"vp\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the software with an inception date of 2009-07-22 associated with the Stack Exchange tag https://stackoverflow.com/tags/windows-7?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2009-07-22\"^^xsd:date . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/windows-7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a university with an inception date of 1963-09-29 and an ARCHON code of 1187?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1963-09-29\"^^xsd:date . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"1187\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the entertainment with the publication date of 1996-07-31 and the official website http://www.bitmap-brothers.co.uk/our-games/past/z.htm?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1996-07-31\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.bitmap-brothers.co.uk/our-games/past/z.htm\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a landform with an inception date of 1898-01-01 and a FIPS 10-4 code of GQ?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"GQ\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"United States Secretary of State\" a profession with an inception date of 1789-04-06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-06\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"United States Secretary of State\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a foundation with an inception date of 1999-06-01 and an ACM Classification Code (2012) of 10011263?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-06-01\"^^xsd:date . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10011263\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the campus with an inception date of 1893-01-01 and an official website of https://www.hopkinsmedicine.org/som/index.html?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1893-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.hopkinsmedicine.org/som/index.html\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a facility with an ARCHON code of 345 that was established on January 1, 1824?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manifestation that was established on July 1, 1867 and has 107.0 constituencies?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <number_of_constituencies> ?pv . ?pv <pred:value> \"107.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the band with ISNI 0000 0001 1089 9660 formed on January 1, 1969?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1969-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1089 9660\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an airline with a Corporate Number (Japan) of 3700150005378 and a work period start date of 1926-04-06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <work_period_(start)> ?pv_1 . ?pv_1 <pred:date> \"1926-04-06\"^^xsd:date . ?e <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"3700150005378\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label \"Speaker of the United States House of Representatives\" associated with a speaker whose inception date is 1789-04-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-01\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Speaker of the United States House of Representatives\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the organization with an Alexa rank of 360.0 on 2017-11-20 ranked 378.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"360.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"378.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "On January 1, 2013, did the democracy with an annual number of weddings equal to 238592.0 and a Human Development Index of 0.848 exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:value> \"238592.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <annual_number_of_weddings> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2013-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.848\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the town with the official name \"\u0411\u0440\u044e\u043d\u043d\" cease to exist, with a population of 344218.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"\u0411\u0440\u044e\u043d\u043d\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <end_time> ?qpv . ?qpv <pred:date> \"1918-10-28\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"344218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the island with ISO 3166-2 code NZ-S and a population of 1.1158e+06 end?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <end_time> ?qpv . ?qpv <pred:date> \"2015-11-27\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1158e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What was the population of the metropolis on January 1, 2011?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"1.64952e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.70469e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of the village on January 1, 2010?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6323.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6323.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What was the population of the city/town on January 1, 2014, if its population was 757,594?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"758400.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"757594.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]