[{"question": "Does the language with the Glottolog code aust1298 have the name English?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"English\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"aust1298\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"aust1298\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the volleyball have an IAB code of 548?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"volleyball\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"548\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"548\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a doctrine with a Dewey Decimal Classification of 211.7?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"doctrine\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"211.7\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"211.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"Iron Man 2\" the title of a soundtrack?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" . ?e <title> ?pv . ?pv <pred:value> \"Iron Man 2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the mythology have an Iconclass notation of 95?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the award http://www.grammy.com/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.grammy.com/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.grammy.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the sound with IAB code 344 have the same IAB code as 344?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"344\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"344\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the language with the Glottolog code fili1244 have the name Tagalog?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"fili1244\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"fili1244\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Serbo-Croatian have a Dewey Decimal Classification of 491.82?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"491.82\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"491.82\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the concept with IPTC Newscode \"worldregion/r001\" have the same value for IPTC Newscode?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"concept\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"worldregion/r001\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"worldregion/r001\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the currency with ISO 4217 code INR have the same ISO 4217 code as INR?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <ISO_4217_code> ?pv_1 . ?pv_1 <pred:value> \"INR\" . ?e <ISO_4217_code> ?pv . ?pv <pred:value> \"INR\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a pome with a Dewey Decimal Classification of 634.11?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"pome\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"634.11\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"634.11\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the sport with IAB code 498 have the same IAB code as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"498\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"498\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the travel have an IAB code of 672?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"travel\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"672\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"672\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is biology classified under Dewey Decimal Classification 590?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"biology\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"590\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"590\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the song with ISWC T-010.162.677-0 have the same ISWC value?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-010.162.677-0\" . ?e <ISWC> ?pv . ?pv <pred:value> \"T-010.162.677-0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the crematory with the National Heritage List for England number 1001575 have the same number as its National Heritage List for England number?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"crematory\" . ?e <National_Heritage_List_for_England_number> ?pv_1 . ?pv_1 <pred:value> \"1001575\" . ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1001575\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the facility with an ARCHON code of 2919 also have an ARCHON code of 2919?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"2919\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"2919\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a chemist with an ISCO occupation code of 2212?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemist\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2212\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the metropolis with WOEID 2211096 have the same WOEID value as 2211096?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2211096\" . ?e <WOEID> ?pv . ?pv <pred:value> \"2211096\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a researcher with an ISCO occupation code of 2212?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2212\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an entity that belongs to the category \"LGBT\" and has a Dewey Decimal Classification of 306.7663?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.7663\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the method with IPTC Newscode \"mediatopic/20000037\" have the same IPTC Newscode?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"method\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000037\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000037\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an opera with only one part?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <number_of_parts_of_this_work_of_art> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . ?e <number_of_parts_of_this_work_of_art> ?pv . ?pv <pred:value> \"1.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the piano classified as Hornbostel-Sachs classification 511?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"piano\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"511\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"511\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the minister https://www.treasury.gov/about/Pages/Secretary.aspx?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the trance subreddit have the value \"psytrance\" for both its subreddit and its subreddit?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . ?e <subreddit> ?pv . ?pv <pred:value> \"psytrance\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a country with a Dewey Decimal Classification of 2--9623?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--9623\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--9623\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the entertainment entity have a Nintendo GameID of R9GEWR?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"R9GEWR\" . ?e <Nintendo_GameID> ?pv . ?pv <pred:value> \"R9GEWR\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the town with an OS grid reference of TQ510887 also have an OS grid reference of TQ510887?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ510887\" . ?e <OS_grid_reference> ?pv . ?pv <pred:value> \"TQ510887\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does a dog have a catalog code of 111?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <catalog_code> ?pv_1 . ?pv_1 <pred:value> \"111\" . ?e <catalog_code> ?pv . ?pv <pred:value> \"111\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a medication with MeSH Code D27.505.954.427.040?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <MeSH_Code> ?pv_1 . ?pv_1 <pred:value> \"D27.505.954.427.040\" . ?e <MeSH_Code> ?pv . ?pv <pred:value> \"D27.505.954.427.040\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the color with the sRGB color hex triplet FF2400?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"color\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"FF2400\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"FF2400\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the disease with DiseasesDB ID 14226 have the same DiseasesDB ID as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"14226\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"14226\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a war with a KulturNav-id of f0a37482-3736-4dd0-b56c-c7d26fb32a95?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . ?e <KulturNav-id> ?pv . ?pv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the anthology with OCLC control number 357792 have the same OCLC control number?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"357792\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an airline with an IATA airline designator of U2?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <IATA_airline_designator> ?pv_1 . ?pv_1 <pred:value> \"U2\" . ?e <IATA_airline_designator> ?pv . ?pv <pred:value> \"U2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Calvinism tagged as denomination=presbyterian in OSM?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Calvinism\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:denomination=presbyterian\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:denomination=presbyterian\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Brunei become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brunei\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5955\" . ?e_2 <pred:name> \"Brunei\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1984-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Kiribati become a country with the FIPS 10-4 code KR?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kiribati\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"KR\" . ?e_2 <pred:name> \"Kiribati\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1979-07-12\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Togo become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Togo\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6681\" . ?e_2 <pred:name> \"Togo\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Tunisia become a country with a Dewey Decimal Classification of 2--611?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tunisia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--611\" . ?e_2 <pred:name> \"Tunisia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-03-20\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the narrative location where Kansas is located (the one whose inception date is 1861-01-29)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kansas\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Kansas\" . ?e_2 <pred:name> \"Kansas\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1861-01-29\"^^xsd:date . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the Batman game with the MAME ROM name \"batman\" that is based on the Batman character?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Batman\" . ?e_1 <MAME_ROM_name> ?pv . ?pv <pred:value> \"batman\" . ?e_2 <pred:name> \"Batman\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1989-10-20\"^^xsd:date . ?e_1 <based_on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based_on> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Guildford (the one with a native label of Guildford) become located in the administrative territorial entity Guildford (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Guildford\" . ?e_1 <native_label> ?pv . ?pv <pred:value> \"Guildford\" . ?e_2 <pred:name> \"Guildford\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the author of Hellboy (the one whose birth name is Anung un Rama) and when was it published?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Hellboy\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"Anung un Rama\" . ?e_2 <pred:name> \"Hellboy\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2004-01-01\"^^xsd:date . ?e_1 <present_in_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <present_in_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Caravaggio (the one who died on 1610-07-18) and what is its main subject?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Caravaggio\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Caravaggio\" . ?e_2 <pred:name> \"Caravaggio\" . ?e_2 <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1610-07-18\"^^xsd:date . ?e_1 <main_subject> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <main_subject> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Tanzania become a country with FIPS 10-4 code TZ?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Tanzania\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"TZ\" . ?e_2 <pred:name> \"Tanzania\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Paraguay (the one with Dewey Decimal Classification 2--892) become a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Paraguay\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--892\" . ?e_2 <pred:name> \"Paraguay\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1811-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the time of the earliest written record for Munich (the one with the license plate code AIB) which is also the capital of Munich?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Munich\" . ?e_1 <licence_plate_code> ?pv . ?pv <pred:value> \"AIB\" . ?e_2 <pred:name> \"Munich\" . ?e_2 <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"1158-06-14\"^^xsd:date . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the derivative work of Slaughterhouse-Five (the one with the official website http://www.vonnegut.com/)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Slaughterhouse-Five\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.vonnegut.com/\" . ?e_2 <pred:name> \"Slaughterhouse-Five\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1972-03-15\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Forbes (the one with ISSN 0015-6914) become a part of Forbes (the one that was established on 1917-09-15)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Forbes\" . ?e_1 <ISSN> ?pv . ?pv <pred:value> \"0015-6914\" . ?e_2 <pred:name> \"Forbes\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1917-09-15\"^^xsd:date . ?e_1 <part_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <part_of> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Zambia become a country with Dewey Decimal Classification 2--6894?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Zambia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6894\" . ?e_2 <pred:name> \"Zambia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Ethiopia become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ethiopia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--63\" . ?e_2 <pred:name> \"Ethiopia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1941-05-05\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the derivative work of the book \"300\" (with ISBN-10 1-56971-402-9) that was published on 2007-03-09?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"300\" . ?e_1 <ISBN-10> ?pv . ?pv <pred:value> \"1-56971-402-9\" . ?e_2 <pred:name> \"300\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-03-09\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Singapore become the capital of Singapore (the one whose CIVICUS_Monitor_country_entry is singapore)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Singapore\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"singapore\" . ?e_2 <pred:name> \"Singapore\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1965-01-01\"^^xsd:date . ?e_1 <capital_of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital_of> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did England (whose demonym is angol) become a country and when was it dissolved, abolished, or demolished?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"England\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"angol\" . ?e_2 <pred:name> \"England\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1707-04-30\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Nicaragua become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nicaragua\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--7285\" . ?e_2 <pred:name> \"Nicaragua\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of Shakira's notable work (whose birth name is Shakira Isabel Mebarak Ripoll)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Shakira\" . ?e_1 <birth_name> ?pv . ?pv <pred:value> \"Shakira Isabel Mebarak Ripoll\" . ?e_2 <pred:name> \"Shakira\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2014-03-21\"^^xsd:date . ?e_1 <notable_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <notable_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native language name of Elektra (the one whose publication date is 2005-03-10)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Elektra\" . ?e_1 <name_in_native_language> ?pv . ?pv <pred:value> \"Elektra\" . ?e_2 <pred:name> \"Elektra\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-03-10\"^^xsd:date . ?e_1 <present_in_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <present_in_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Myanmar become a country with Dewey Decimal Classification 2--591?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Myanmar\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--591\" . ?e_2 <pred:name> \"Myanmar\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1948-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the start time of Normandy (the one with native label Normandie) that is different from the Normandy with a start time of 2016-01-01?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Normandy\" . ?e_1 <native_label> ?pv . ?pv <pred:value> \"Normandie\" . ?e_2 <pred:name> \"Normandy\" . ?e_2 <start_time> ?pv_1 . ?pv_1 <pred:date> \"2016-01-01\"^^xsd:date . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]