[{"question": "What is the common property of red (with sRGB color hex triplet B30033) and B30033 (with sRGB color hex triplet B30033)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"red\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"B30033\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"B30033\" . [ <pred:fact_h> ?e ; <pred:fact_r> <sRGB_color_hex_triplet> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.arlingtoncemetery.mil website regarding the cemetery with a 0000 0004 0517 3656 ISNI?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0517 3656\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.arlingtoncemetery.mil/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.hds.harvard.edu/ website regarding the seminary?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"seminary\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.hds.harvard.edu/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.hds.harvard.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) and ISCO occupation code for a musician with the code L1202 and 2453 respectively?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musician\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"L1202\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2453\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.tridelta.org regarding the sorority?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sorority\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tridelta.org\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tridelta.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of the horse named Northern Dancer?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://www.hopkinsmedicine.org/som/index.html regarding the campus?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.hopkinsmedicine.org/som/index.html\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.hopkinsmedicine.org/som/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the road number of the road with the name US 66?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <road_number> ?pv_1 . ?pv_1 <pred:value> \"US 66\" . ?e <road_number> ?pv . ?pv <pred:value> \"US 66\" . [ <pred:fact_h> ?e ; <pred:fact_r> <road_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the basketball subreddit with an IAB code of 489 and a subreddit value of CollegeBasketball?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"489\" . ?e <subreddit> ?pv . ?pv <pred:value> \"CollegeBasketball\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the drug with the subreddit \"trees\" and \"Marijuana\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"trees\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for fiction?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fiction\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the https://www.united.com/ website regarding the airline with a Corporate Number (Japan) of 3700150005378?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <Corporate_Number_(Japan)> ?pv_1 . ?pv_1 <pred:value> \"3700150005378\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.united.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the pronunciation audio for vegetarianism (the one with OSM tag or key Key:diet:vegan)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"vegetarianism\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Key:diet:vegan\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"LL-Q5146 (por)-NMaia-veganismo.wav\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://www.metmuseum.org/ regarding the museum with an ARCHON code of 1321?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"1321\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.metmuseum.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name of the song with ISWC T-010.162.677-0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-010.162.677-0\" . ?e <ISWC> ?pv . ?pv <pred:value> \"T-010.162.677-0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv ] <named_as> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the property with the value of \"31E21\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"property\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"31E21\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"31E21\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.today.com website regarding the news with an Instagram username of todayshow?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.today.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What jurisdiction does the software with the Stack Exchange tag https://android.stackexchange.com/tags/windows and Twitter username Windows apply to?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://android.stackexchange.com/tags/windows\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Windows\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <applies_to_jurisdiction> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://www.treasury.gov/about/Pages/Secretary.aspx regarding the minister?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the violin?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"violin\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322-71\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322-71\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for the impresario with the code L1303?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"impresario\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"L1303\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1303\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the method with Iconclass notation 48C2 and IPTC Newscode mediatopic/20000037 related to?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"method\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"48C2\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000037\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for the scientist with KldB-2010 occupation code 41284?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <KldB-2010_occupation_code> ?pv . ?pv <pred:value> \"41284\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KldB-2010_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OSM tag or key for a restaurant that has the value \"Tag:shop=deli\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"restaurant\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:shop=deli\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:shop=deli\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode and Iconclass notation for the medicine related to mediatopic/20000712?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medicine\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000712\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"49G6131\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.nymag.com website regarding the manifestation with an ISSN of 0028-7369?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <ISSN> ?pv_1 . ?pv_1 <pred:value> \"0028-7369\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.nymag.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the KulturNav-id of the war with the id f0a37482-3736-4dd0-b56c-c7d26fb32a95?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . ?e <KulturNav-id> ?pv . ?pv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KulturNav-id> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.ucc.org website regarding Christianity (the one with ISNI 0000 0004 0508 6616)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ucc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the subreddit \"italodisco\" regarding the instance of \"disco\" with the subreddit \"italodisco\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . ?e <subreddit> ?pv . ?pv <pred:value> \"italodisco\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the heritage designation of the crematory with National Heritage List for England numbers 1064865 and 1001575?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crematory\" . ?e <National_Heritage_List_for_England_number> ?pv_1 . ?pv_1 <pred:value> \"1064865\" . ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1001575\" . [ <pred:fact_h> ?e ; <pred:fact_r> <National_Heritage_List_for_England_number> ; <pred:fact_t> ?pv ] <heritage_designation> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the subreddit that is related to both funk and electro?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"funk\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"electro\" . ?e <subreddit> ?pv . ?pv <pred:value> \"electro\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for the announcer with the code E1106?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"announcer\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"E1106\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"E1106\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.oscars.org regarding the award?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.oscars.org\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.oscars.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the mythology that has an Iconclass notation of 94 and 95?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"94\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for a critic?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"critic\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for death?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"death\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"31E21\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"31E21\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) and ISCO occupation code for a writer with the code E1102 and 2451 respectively?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"E1102\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the final with the short name \"The Finals\" and the official name \"Basketball Association of America World Championship Series\" end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"final\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"The Finals\" . ?e <official_name> ?pv . ?pv <pred:value> \"Basketball Association of America World Championship Series\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the manga that has the official website http://tezukaosamu.net?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the Malay language stop using the ISO 639-1 code \"in\" and the Ethnologue.com language code \"ind\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <Ethnologue.com_language_code> ?pv_1 . ?pv_1 <pred:value> \"ind\" . ?e <ISO_639-1_code> ?pv . ?pv <pred:value> \"in\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_639-1_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for the mathematician with ISCO occupation code 2122?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematician\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2122\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"M1403\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.boeing.com/boeing/commercial/737family/ website regarding marketing?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.boeing.com/boeing/commercial/737family/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.boeing.com/boeing/commercial/737family/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Glottolog code for the Chinese language?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Chinese\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"mand1415\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"mand1415\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Stack Exchange tag associated with the management instance that has the value \"https://stackoverflow.com/tags/project-management\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"management\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/project-management\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/project-management\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Stack_Exchange_tag> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode for the instance of homicide with the value \"mediatopic/20000135\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"homicide\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000135\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000135\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IETF language tag for Tagalog (the one with ISO 639-2 code \"fil\")?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <IETF_language_tag> ?pv_1 . ?pv_1 <pred:value> \"fil\" . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"fil\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_639-2_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the city/town with the Dewey Decimal Classification of 2--4779 and the official name of Lw\u00f3w cease to exist?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4779\" . ?e <official_name> ?pv . ?pv <pred:value> \"Lw\u00f3w\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the family that has the official website http://www.sachsen-coburg-gotha.de/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"family\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sachsen-coburg-gotha.de/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sachsen-coburg-gotha.de/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Wikimedia language code for English with an IETF language tag of en-CA?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"English\" . ?e <IETF_language_tag> ?pv_1 . ?pv_1 <pred:value> \"en-CA\" . ?e <Wikimedia_language_code> ?pv . ?pv <pred:value> \"en-ca\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Wikimedia_language_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification and USDA NDB number for the pome with a Dewey Decimal Classification of 634.11 and a USDA NDB number of 09005?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pome\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"634.11\" . ?e <USDA_NDB_number> ?pv . ?pv <pred:value> \"09005\" . [ <pred:fact_h> ?e ; <pred:fact_r> <USDA_NDB_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the profession with SOC Code (2010) 11-1021 equal to 11-1021?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <SOC_Code_(2010)> ?pv_1 . ?pv_1 <pred:value> \"11-1021\" . [ <pred:fact_h> ?e ; <pred:fact_r> <SOC_Code_(2010)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"11-1021\" . ?e <SOC_Code_(2010)> ?pv . ?pv <pred:value> \"11-1021\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the foundation with the official website https://www.apache.org classified under ACM Classification Code (2012) 10011263?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.apache.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://www.apache.org\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10011263\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is http://www.medalofhonor.com the official website of an activity?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.medalofhonor.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.medalofhonor.com\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.medalofhonor.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]