[{"question": "What language pertains to the official website https://www.metmuseum.org/ regarding the facility?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.metmuseum.org/\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.metmuseum.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://windows.microsoft.com/en-us/windows/products/windows-xp website regarding the industry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://windows.microsoft.com/en-us/windows/products/windows-xp\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://windows.microsoft.com/en-us/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the synthesizer?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"synthesizer\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"54\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"54\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for volleyball?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"volleyball\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"548\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"548\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Library of Congress Classification for the law with the HV4708 code?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"law\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"HV4708\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"HV4708\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Library_of_Congress_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the food with the pronunciation audio \"Nl-varkensvlees.ogg\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"food\" . ?e <pronunciation_audio> ?pv_1 . ?pv_1 <pred:value> \"Nl-varkensvlees.ogg\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Nl-varkensvlees.ogg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.watchimage.com website regarding the business with the official website http://www.watchimage.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.watchimage.com\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.watchimage.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.sega.com/ironman2/us/index.html website regarding the entertainment category?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sega.com/ironman2/us/index.html\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sega.com/ironman2/us/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Wikimedia language code for English (the one with the value en-ca)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"English\" . ?e <Wikimedia_language_code> ?pv_1 . ?pv_1 <pred:value> \"en-ca\" . ?e <Wikimedia_language_code> ?pv . ?pv <pred:value> \"en-ca\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Wikimedia_language_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the zither?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"zither\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"314.122-5\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"314.122-5\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the doctrine that has a Dewey Decimal Classification of 211.7?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"doctrine\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"211.7\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"211.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the mapping relation type for the disease with UMLS CUI C0008354?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <UMLS_CUI> ?pv_1 . ?pv_1 <pred:value> \"C0008354\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0008354\" . [ <pred:fact_h> ?e ; <pred:fact_r> <UMLS_CUI> ; <pred:fact_t> ?pv ] <mapping_relation_type> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the country with NUTS code UKM start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"UKM\" . ?e <NUTS_code> ?pv . ?pv <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS_code> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.msmnyc.edu regarding the conservatory?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.msmnyc.edu\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.msmnyc.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode for bobsleigh?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"bobsleigh\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20001055\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20001055\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the subreddit \"Yorkies\" regarding the dog?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Yorkies\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://amphilsoc.org/ regarding the association?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://amphilsoc.org/\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://amphilsoc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://www.state.gov/secretary/index.htm?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.state.gov/secretary/index.htm\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.state.gov/secretary/index.htm\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for folklore?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"folklore\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name of the method of suicide that involves being hanged by the neck until dead?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"suicide\" . ?e <name> ?pv_1 . ?pv_1 <pred:value> \"hanged by the neck until dead\" . ?e <name> ?pv . ?pv <pred:value> \"hanged by the neck until dead\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What jurisdiction does the newspaper with the official website https://www.nytimes.com/ apply to?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.nytimes.com/\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.nytimes.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <applies_to_jurisdiction> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode for the engineering topic?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"engineering\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000760\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000760\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for screenwriters?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"screenwriter\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the relationship between pain (with UMLS_CUI C0000737) and the entity with UMLS_CUI C0000737?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pain\" . ?e <UMLS_CUI> ?pv_1 . ?pv_1 <pred:value> \"C0000737\" . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0000737\" . [ <pred:fact_h> ?e ; <pred:fact_r> <UMLS_CUI> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the drug with the subreddit \"Marijuana\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Marijuana\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for authors?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.dccomics.com/watchmen regarding the novel?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.dccomics.com/watchmen\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dccomics.com/watchmen\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the PermID of the currency with the PermID 500269?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"500269\" . ?e <PermID> ?pv . ?pv <pred:value> \"500269\" . [ <pred:fact_h> ?e ; <pred:fact_r> <PermID> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://www.metmuseum.org/ of the museum?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.metmuseum.org/\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.metmuseum.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What part does the demonym \"Byzantin\" apply to in the empire with the demonym \"Byzantin\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Byzantin\" . ?e <demonym> ?pv . ?pv <pred:value> \"Byzantin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for a lawyer?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"lawyer\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2421\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2421\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for melodrama?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"melodrama\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the RIA Novosti reference for the government with a reference of 43219727?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"government\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"43219727\" . ?e <RIA_Novosti_reference> ?pv . ?pv <pred:value> \"43219727\" . [ <pred:fact_h> ?e ; <pred:fact_r> <RIA_Novosti_reference> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the duo with ISNI 0000 0001 0728 0445?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"duo\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0728 0445\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0728 0445\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What subreddit is related to both post-hardcore and Emo?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Emo\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the biology term with the pronunciation audio \"Ru-\u044d\u043a\u043e\u043b\u043e\u0433\u0438\u044f.ogg\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"biology\" . ?e <pronunciation_audio> ?pv_1 . ?pv_1 <pred:value> \"Ru-\u044d\u043a\u043e\u043b\u043e\u0433\u0438\u044f.ogg\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Ru-\u044d\u043a\u043e\u043b\u043e\u0433\u0438\u044f.ogg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the guitar?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322-5\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322-5\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the heritage designation of the crematory with the National Heritage List for England number 1001575?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crematory\" . ?e <National_Heritage_List_for_England_number> ?pv_1 . ?pv_1 <pred:value> \"1001575\" . ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1001575\" . [ <pred:fact_h> ?e ; <pred:fact_r> <National_Heritage_List_for_England_number> ; <pred:fact_t> ?pv ] <heritage_designation> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.ucc.org regarding the religion?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ucc.org/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ucc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for mathematicians with the code M1403?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematician\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"M1403\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"M1403\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the album with the official website http://thefall.gorillaz.com/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://thefall.gorillaz.com/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://thefall.gorillaz.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the newscast with the Twitter username TODAYshow have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"TODAYshow\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the short name of the physician with the value \"MUDr.\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"physician\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"MUDr.\" . ?e <short_name> ?pv . ?pv <pred:value> \"MUDr.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the product with the pronunciation audio file \"Nl-varkensvlees.ogg\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"product\" . ?e <pronunciation_audio> ?pv_1 . ?pv_1 <pred:value> \"Nl-varkensvlees.ogg\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Nl-varkensvlees.ogg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.ucc.org/ website regarding Protestantism?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ucc.org/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ucc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the abjad that has an ISO 15924 numeric code of 160?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"abjad\" . ?e <ISO_15924_numeric_code> ?pv_1 . ?pv_1 <pred:value> \"160\" . ?e <ISO_15924_numeric_code> ?pv . ?pv <pred:value> \"160\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_15924_numeric_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the interdisciplinarity classification code for the program with code 05.0207?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"interdisciplinarity\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"05.0207\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"05.0207\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Classification_of_Instructional_Programs_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the symptom with MeSH Code C14.907.585.187?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" . ?e <MeSH_Code> ?pv_1 . ?pv_1 <pred:value> \"C14.907.585.187\" . ?e <MeSH_Code> ?pv . ?pv <pred:value> \"C14.907.585.187\" . [ <pred:fact_h> ?e ; <pred:fact_r> <MeSH_Code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the method that has an IPTC Newscode of mediatopic/20000037?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"method\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000037\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000037\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the residue with the value of 41B152?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"residue\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"41B152\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"41B152\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the initialism with the subreddit \"lesbians\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the town with the official name \"\u0411\u0440\u044e\u043d\u043d\" stop having the official name \"\u0411\u0440\u044e\u043d\u043d\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"\u0411\u0440\u044e\u043d\u043d\" . ?e <official_name> ?pv . ?pv <pred:value> \"\u0411\u0440\u044e\u043d\u043d\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://wikimediafoundation.org/ regarding the foundation?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://wikimediafoundation.org/\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://wikimediafoundation.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the transliteration of \u0627\u0644\u0634\u0650\u0651\u064a\u0639\u064e\u0629 in Islam?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"\u0627\u0644\u0634\u0650\u0651\u064a\u0639\u064e\u0629\" . ?e <native_label> ?pv . ?pv <pred:value> \"\u0627\u0644\u0634\u0650\u0651\u064a\u0639\u064e\u0629\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <transliteration> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]