[
    {
        "question": "When did Ali's exploitation visa start with the visa number 104842?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Ali . ?e <exploitation visa number> ?pv_1 . ?pv_1 <pred:value> \"104842\" . ?e <exploitation visa number> ?pv . ?pv <pred:value> \"104842\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation visa number> ; <pred:fact_t> ?pv ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for Hokkaido (whose native label is ) having a population of 5.31056e+06?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Hokkaid . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"\" . ?e <population> ?pv . ?pv <pred:value> \"5.31056e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the population of Kinshasa 6.786e+06 (the one whose FIPS 10-4 code is CG06)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Kinshasa . ?e <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"CG06\" . ?e <population> ?pv . ?pv <pred:value> \"6.786e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the population of Worthing 104600 and had an OS grid reference of SU775075?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Worthing . ?e <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"SU775075\" . ?e <population> ?pv . ?pv <pred:value> \"104600.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for Libya's Human Development Index, which is 0.731 and has a Dewey Decimal Classification of 2--612?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Libya . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--612\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.731\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for Wolverhampton (the one with FIPS 10-4 code UKQ3) having a population of 249900.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Wolverhampton . ?e <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"UKQ3\" . ?e <population> ?pv . ?pv <pred:value> \"249900.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about bassoon with Hornbostel-Sachs classification 422.112-71?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> bassoon . ?e <Hornbostel-Sachs classification> ?pv_1 . ?pv_1 <pred:value> \"422.112-71\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"422.112-71\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs classification> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of episodes in the last season of Damages?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Damages . ?e <number of seasons> ?pv_1 . ?pv_1 <pred:value> \"5.0\" . ?e <number of seasons> ?pv . ?pv <pred:value> \"5.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seasons> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate for the fact that Selma has a population of 20756 and an elevation above sea level of 38?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Selma . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"20756.0\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"38.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a publication with the name Chico on January 17th, 2002?",
        "sparql": "ASK { ?e <pred:name> Chico . ?e <publication date> ?pv . ?pv <pred:date> \"2002-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Vojvodina founded on July 31st, 1944?",
        "sparql": "ASK { ?e <pred:name> Vojvodina . ?e <inception> ?pv . ?pv <pred:date> \"1944-07-31\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Brantford founded on May 31st, 1877?",
        "sparql": "ASK { ?e <pred:name> Brantford . ?e <inception> ?pv . ?pv <pred:date> \"1877-05-31\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Nagesh born on September 27th, 1933?",
        "sparql": "ASK { ?e <pred:name> Nagesh . ?e <date of birth> ?pv . ?pv <pred:date> \"1933-09-27\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Coronado published on April 22, 2004?",
        "sparql": "ASK { ?e <pred:name> Coronado . ?e <publication date> ?pv . ?pv <pred:date> \"2004-04-22\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Waukesha founded on January 1st, 1834?",
        "sparql": "ASK { ?e <pred:name> Waukesha . ?e <inception> ?pv . ?pv <pred:date> \"1834-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Portishead formed on January 1st, 1991?",
        "sparql": "ASK { ?e <pred:name> Portishead . ?e <inception> ?pv . ?pv <pred:date> \"1991-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Yanni's date of birth November 14th, 1954?",
        "sparql": "ASK { ?e <pred:name> Yanni . ?e <date of birth> ?pv . ?pv <pred:date> \"1954-11-14\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Glitch founded on January 1st, 2005?",
        "sparql": "ASK { ?e <pred:name> glitch . ?e <inception> ?pv . ?pv <pred:date> \"2005-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publisher of the book Awakenings (published on 1990-01-01)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Awakenings . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1990-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Awakenings . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the publication of the movie Radio on 2003-10-24?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Radio . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2003-10-24\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Radio . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Washington, which was founded on 1889-11-11?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Washington . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1889-11-11\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> Washington . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the publication titled JFK (published on 1991-12-20)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> JFK . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1991-12-20\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> JFK . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Taiwan's inception and demonym?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Taiwan . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-01-01\"^^xsd:date . ?e <demonym> ?pv . ?pv <pred:value> Taiwan . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the title Kinsey, which was published on 2004-01-01?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Kinsey . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2004-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Kinsey . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publication date of Catch-22 (the one whose title is also Catch-22)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Catch-22 . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1961-11-10\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Catch-22 . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Austin, which was founded on 1835-01-01?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Austin . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1835-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> Austin . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the start time of Monk (the one whose title is also Monk and start time is 2002-07-12)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Monk . ?e <start time> ?pv_1 . ?pv_1 <pred:date> \"2002-07-12\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Monk . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What quality does NATO have on Twitter (whose username is NATO) and was founded on 1949-04-04?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> NATO . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1949-04-04\"^^xsd:date . ?e <Twitter username> ?pv . ?pv <pred:value> NATO . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <has quality> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Henry King (whose name in native language is also Henry King) and Allentown (the one with a population of 118032.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Henry King\" . ?e_1 <name in native language> ?pv . ?pv <pred:value> \"Henry King\" . ?e_2 <pred:name> Allentown . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"118032.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the United States of America (whose native label is also United States of America) and Louisiana (the one with a population of 4.67072e+06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"United States of America\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"United States of America\" . ?e_2 <pred:name> Louisiana . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.67072e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between On Her Majesty's Secret Service and Bern (the one with a population of 140567.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"On Her Majesty's Secret Service\" . ?e_1 <title> ?pv . ?pv <pred:value> \"On Her Majesty's Secret Service\" . ?e_2 <pred:name> Bern . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"140567.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Alaska (the one with subreddit \"Alaska\") and Juneau (the one with a population of 32756.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alaska\" . ?e_1 <subreddit> ?pv . ?pv <pred:value> \"Alaska\" . ?e_2 <pred:name> Juneau . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"32756.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Aberdeen (the one with a native label of Aberdeen) and Regensburg (the one with a number of households of 60905.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Aberdeen\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"Aberdeen\" . ?e_2 <pred:name> Regensburg . ?e_2 <number of households> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"60905.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Allium cepa (the one with a taxon name of Allium cepa) and L-Arginine (the one with a pKa of 12.48)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Allium cepa\" . ?e_1 <taxon name> ?pv . ?pv <pred:value> \"Allium cepa\" . ?e_2 <pred:name> L-Arginine . ?e_2 <pKa> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"12.48\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Mobile (the one with a native label of Mobile) and Rostov-on-Don (the one with a population of 997800.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mobile\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"Mobile\" . ?e_2 <pred:name> Rostov-on-Don . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"997800.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Atlanta (the one with an official name of Atlanta) and Fukuoka (the one with a population of 1.56719e+06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Atlanta\" . ?e_1 <official name> ?pv . ?pv <pred:value> \"Atlanta\" . ?e_2 <pred:name> Fukuoka . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.56719e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between France (whose native label is France) and Vanuatu (the one with a population of 204135.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"France\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"France\" . ?e_2 <pred:name> Vanuatu . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"204135.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Brandenburg (the one with a native label of Brandenburg) and Potsdam (the one with a population of 171810.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brandenburg\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"Brandenburg\" . ?e_2 <pred:name> Potsdam . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"171810.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which facility had a total revenue of 2.44382e+08 on January 1st, 2017?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <total revenue> ?pv . ?pv <pred:value> \"2.44382e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <total revenue> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2017-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entertainment received a review score of 6/10 on 2005-10-26?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <review score> ?pv . ?pv <pred:value> \"6/10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <review score> ; <pred:fact_t> ?pv ] <publication date> ?qpv . ?qpv <pred:date> \"2005-10-26\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which industry had a public key fingerprint of \"C07B F5E3 10AE 64BF 6120  B0F6 36A7 C05F E1EC F9BB\" that ended on 2017-07-08?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <public key fingerprint> ?pv . ?pv <pred:value> \"C07B F5E3 10AE 64BF 6120  B0F6 36A7 C05F E1EC F9BB\" . [ <pred:fact_h> ?e ; <pred:fact_r> <public key fingerprint> ; <pred:fact_t> ?pv ] <end time> ?qpv . ?qpv <pred:date> \"2017-07-08\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which neighborhood had a population of 91982 on January 1st, 2010?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <population> ?pv . ?pv <pred:value> \"91982.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What taxon was published in 1835 with the name \"Cichlidae\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> taxon . ?e <taxon name> ?pv . ?pv <pred:value> \"Cichlidae\" . [ <pred:fact_h> ?e ; <pred:fact_r> <taxon name> ; <pred:fact_t> ?pv ] <year of taxon name publication> ?qpv . ?qpv <pred:date> \"1835-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which agent has the official website http://www.zimcricket.org and was retrieved on 2015-01-03?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <official website> ?pv . ?pv <pred:value> \"http://www.zimcricket.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <retrieved> ?qpv . ?qpv <pred:date> \"2015-01-03\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was ranked 1.0 on August 18th, 2008 and is classified as a human?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <ranking> ?pv . ?pv <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2008-08-18\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the band with Twitter username \"depechemode\" start?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> band . ?e <Twitter username> ?pv . ?pv <pred:value> \"depechemode\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <start time> ?qpv . ?qpv <pred:date> \"2009-03-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which state had a NUTS code of GR and ended on 2011-12-31?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <NUTS code> ?pv . ?pv <pred:value> \"GR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS code> ; <pred:fact_t> ?pv ] <end time> ?qpv . ?qpv <pred:date> \"2011-12-31\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]