[{"question": "When did Turkey become a country according to the CIVICUS Monitor country entry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Turkey\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"turkey\" . ?e_2 <pred:name> \"Turkey\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1923-10-29\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Metallica start performing as a performer with the title Metallica?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Metallica\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Metallica\" . ?e_2 <pred:name> \"Metallica\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1982-10-28\"^^xsd:date . ?e_1 <performer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <performer> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Spain become a country (the one whose CANTIC-ID is a11466121)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Spain\" . ?e_1 <CANTIC-ID> ?pv . ?pv <pred:value> \"a11466121\" . ?e_2 <pred:name> \"Spain\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1812-03-19\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Greece become a country according to the CIVICUS Monitor country entry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Greece\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"greece\" . ?e_2 <pred:name> \"Greece\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-03-25\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the derivative work of Atonement (the one with OCLC control number 248628819)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Atonement\" . ?e_1 <OCLC_control_number> ?pv . ?pv <pred:value> \"248628819\" . ?e_2 <pred:name> \"Atonement\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-08-28\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Leeds (the one with a local dialing code of 0113) become located in the administrative territorial entity Leeds (which was established on 1974-04-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Leeds\" . ?e_1 <local_dialing_code> ?pv . ?pv <pred:value> \"0113\" . ?e_2 <pred:name> \"Leeds\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Solihull (the one with an OS grid reference of SP1579) become located in the administrative territorial entity Solihull (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Solihull\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"SP1579\" . ?e_2 <pred:name> \"Solihull\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Nauru become a country and what is the demonym for Nauru?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Nauru\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"nauruan\" . ?e_2 <pred:name> \"Nauru\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Birmingham (the one with Dewey Decimal Classification 2--42496) start being located in Birmingham (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Birmingham\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--42496\" . ?e_2 <pred:name> \"Birmingham\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Iraq become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Iraq\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--567\" . ?e_2 <pred:name> \"Iraq\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1932-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the derivative work of Holes (the one with ISBN-13 978-0-440-41480-3)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Holes\" . ?e_1 <ISBN-13> ?pv . ?pv <pred:value> \"978-0-440-41480-3\" . ?e_2 <pred:name> \"Holes\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2003-04-18\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the filming of California (the one with the title \"California\") take place?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"California\" . ?e_1 <title> ?pv . ?pv <pred:value> \"California\" . ?e_2 <pred:name> \"California\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1850-09-09\"^^xsd:date . ?e_1 <filming_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <filming_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the date of inception for the entity with the official website http://www.chrysler.com/ that is different from the entity named Chrysler (the one with an inception date of 1925-06-06)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chrysler\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.chrysler.com/\" . ?e_2 <pred:name> \"Chrysler\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1925-06-06\"^^xsd:date . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Alaska and when did it come into existence?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Alaska\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Alaska\" . ?e_2 <pred:name> \"Alaska\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1959-01-03\"^^xsd:date . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the derivative work of Moonraker (the one with OCLC control number 432905955)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Moonraker\" . ?e_1 <OCLC_control_number> ?pv . ?pv <pred:value> \"432905955\" . ?e_2 <pred:name> \"Moonraker\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1979-08-18\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Ukraine (the one whose inception date is 1991-08-24)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ukraine\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--477\" . ?e_2 <pred:name> \"Ukraine\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-24\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Venezuela become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Venezuela\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--87\" . ?e_2 <pred:name> \"Venezuela\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1811-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Grenada become a country and what is the demonym for Grenada?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Grenada\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"\u063a\u0631\u064a\u0646\u0644\u0627\u0646\u062f\u064a\u0648\u0646\" . ?e_2 <pred:name> \"Grenada\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Finland become a country according to the CIVICUS Monitor country entry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Finland\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"finland\" . ?e_2 <pred:name> \"Finland\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1917-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Turkmenistan become a country with the Dewey Decimal Classification of 2--585?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Turkmenistan\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--585\" . ?e_2 <pred:name> \"Turkmenistan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-10-27\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Aachen start being located in the administrative territorial entity Aachen (the one whose Dewey Decimal Classification is 2--435511)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Aachen\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--435511\" . ?e_2 <pred:name> \"Aachen\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"2009-10-21\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Guatemala become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Guatemala\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--7281\" . ?e_2 <pred:name> \"Guatemala\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Egypt become a country with the FIPS 10-4 code \"EG\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Egypt\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"EG\" . ?e_2 <pred:name> \"Egypt\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1953-06-18\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the Spider-Man comic that is present in the work whose official website is http://www.marvel.com/comics/Spider-Man?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Spider-Man\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.marvel.com/comics/Spider-Man\" . ?e_2 <pred:name> \"Spider-Man\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2018-09-07\"^^xsd:date . ?e_1 <present_in_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <present_in_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Goa (the one with the inception date of 1987-05-29) in Tamil?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Goa\" . ?e_1 <title> ?pv . ?pv <pred:value> \"\u0b95\u0bcb\u0bb5\u0bbe\" . ?e_2 <pred:name> \"Goa\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1987-05-29\"^^xsd:date . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Thuringia follow the entity that was dissolved, abolished, or demolished on 1952-07-25 and has an ISO 3166-2 code of DE-TH?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Thuringia\" . ?e_1 <ISO_3166-2_code> ?pv . ?pv <pred:value> \"DE-TH\" . ?e_2 <pred:name> \"Thuringia\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1952-07-25\"^^xsd:date . ?e_1 <follows> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <follows> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Oldham (the one with WOEID 31017) become located in the administrative territorial entity Oldham?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Oldham\" . ?e_1 <WOEID> ?pv . ?pv <pred:value> \"31017\" . ?e_2 <pred:name> \"Oldham\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Zimbabwe become a country according to the Dewey Decimal Classification?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Zimbabwe\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6891\" . ?e_2 <pred:name> \"Zimbabwe\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1980-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the derivative work of Rango (the one with the official website http://www.rangomovie.com/)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Rango\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.rangomovie.com/\" . ?e_2 <pred:name> \"Rango\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-03-01\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Argentina become a country according to the CIVICUS Monitor country entry with a value of \"argentina\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Argentina\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"argentina\" . ?e_2 <pred:name> \"Argentina\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1816-07-09\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Botswana become a country with the Dewey Decimal Classification of 2--6883?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Botswana\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6883\" . ?e_2 <pred:name> \"Botswana\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Lithuania become a country according to the CIVICUS Monitor country entry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Lithuania\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"lithuania\" . ?e_2 <pred:name> \"Lithuania\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-02-16\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Samoa become a country with FIPS 10-4 code WS?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Samoa\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"WS\" . ?e_2 <pred:name> \"Samoa\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Bolivia (the one with Dewey Decimal Classification 2--84) become a country?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bolivia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--84\" . ?e_2 <pred:name> \"Bolivia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the derivative work of Watchmen (the one with the official website http://www.dccomics.com/watchmen)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Watchmen\" . ?e_1 <official_website> ?pv . ?pv <pred:value> \"http://www.dccomics.com/watchmen\" . ?e_2 <pred:name> \"Watchmen\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-02-23\"^^xsd:date . ?e_1 <derivative_work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative_work> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Preston (the one with a population of 141801.0) and Preston (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Preston\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"141801.0\"^^xsd:double . ?e_2 <pred:name> \"Preston\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Myanmar (the one with a Human Development Index of 0.536) and Myanmar (the one with an inception date of 1948-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Myanmar\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.536\"^^xsd:double . ?e_2 <pred:name> \"Myanmar\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1948-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Samoa (the one with a Human Development Index of 0.679) and Samoa (the one with an inception date of 1962-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Samoa\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.679\"^^xsd:double . ?e_2 <pred:name> \"Samoa\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the city of Bradford (with a population of 293277.0) and its inception date of 1974-04-01?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bradford\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"293277.0\"^^xsd:double . ?e_2 <pred:name> \"Bradford\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bangladesh (the one with a Human Development Index of 0.563) and Bangladesh (the one with an inception date of 1971-03-26)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bangladesh\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.563\"^^xsd:double . ?e_2 <pred:name> \"Bangladesh\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-03-26\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Lebanon (the one with a Human Development Index of 0.761) and Lebanon (the one with an inception date of 1943-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lebanon\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.761\"^^xsd:double . ?e_2 <pred:name> \"Lebanon\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1943-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Vietnam (the one with a Human Development Index of 0.666) and Vietnam (the one with an inception date of 1945-09-02)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vietnam\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.666\"^^xsd:double . ?e_2 <pred:name> \"Vietnam\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1945-09-02\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Benin (the one with a Human Development Index of 0.344) and Benin (the one with an inception date of 1960-08-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Benin\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.344\"^^xsd:double . ?e_2 <pred:name> \"Benin\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-08-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Russia (the one with a Human Development Index of 0.795) and Russia (the one with an inception date of 1917-10-25)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Russia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.795\"^^xsd:double . ?e_2 <pred:name> \"Russia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1917-10-25\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Jersey (the one with a population of 87186.0) and Jersey (the one with an inception date of 1651-12-12)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jersey\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"87186.0\"^^xsd:double . ?e_2 <pred:name> \"Jersey\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1651-12-12\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Batman (the one with 120.0 episodes) and Batman (the one born on 1939-05-27)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Batman\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"120.0\"^^xsd:double . ?e_2 <pred:name> \"Batman\" . ?e_2 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1939-05-27\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Afghanistan (the one with a Human Development Index of 0.295) and Afghanistan (the one with an inception date of 1747-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Afghanistan\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.295\"^^xsd:double . ?e_2 <pred:name> \"Afghanistan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1747-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bolivia (the one with a Human Development Index of 0.572) and Bolivia (the one with an inception date of 1825-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bolivia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.572\"^^xsd:double . ?e_2 <pred:name> \"Bolivia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Brno (the one with a population of 344218.0) and Brno (the one with a time of earliest written record of 1091-01-17)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brno\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"344218.0\"^^xsd:double . ?e_2 <pred:name> \"Brno\" . ?e_2 <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"1091-01-17\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Senegal (the one whose Human Development Index is 0.422) and Senegal (the one whose inception date is 1960-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Senegal\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.422\"^^xsd:double . ?e_2 <pred:name> \"Senegal\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Cameroon (the one whose Human Development Index is 0.436) and Cameroon (the one whose inception date is 1960-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]