[
    {
        "question": "What is the connection between Steven Soderbergh and Atlanta (the one with an official name of Atlanta)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Steven Soderbergh\" . ?e_2 <pred:name> Atlanta . ?e_2 <official name> ?pv . ?pv <pred:value> Atlanta . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Valencia CF and Valencia (the one with an official name of Valencia)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Valencia CF\" . ?e_2 <pred:name> Valencia . ?e_2 <official name> ?pv . ?pv <pred:value> Valencia . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Prague and Helsinki (the one whose native label is Helsinki)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Prague\" . ?e_2 <pred:name> Helsinki . ?e_2 <native label> ?pv . ?pv <pred:value> Helsinki . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the movie Election and the subreddit for Nebraska?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Election\" . ?e_2 <pred:name> Nebraska . ?e_2 <subreddit> ?pv . ?pv <pred:value> Nebraska . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin for sumo (the one with RIA Novosti reference 54395272)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> sumo . ?e <RIA Novosti reference> ?pv_1 . ?pv_1 <pred:value> \"54395272\" . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ATC code for glycine?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> glycine . ?e <ATC code> ?pv_1 . ?pv_1 <pred:value> \"B05CX03\" . ?e <ATC code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Gatineau?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Gatineau . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--714221\" . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Corporate Number (Japan) of Kagoshima?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Kagoshima . ?e <Corporate Number (Japan)> ?pv_1 . ?pv_1 <pred:value> \"1000020462012\" . ?e <Corporate Number (Japan)> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification for Sofia?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Sofia . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4999\" . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the area of Ahmedabad?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Ahmedabad . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"464.165\" . ?e <area> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin for curling (the one with IPTC Newscode mediatopic/20000890)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> curling . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000890\" . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a cast member in the movie Crossroads (the one with a title of \"Crossroads\")?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Crossroads . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Crossroads\" . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the WOEID of Amritsar?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Amritsar . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2295388\" . ?e <WOEID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the UN/LOCODE of Zrich and what is its Dewey Decimal Classification?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Zrich . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4945726\" . ?e <UN/LOCODE> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What landform was established on January 1st, 1898 and is located in the country or region with FIPS 10-4 code GQ?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> landform . ?e <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"GQ\" . [ <pred:fact_h> ?e ; <pred:fact_r> <FIPS 10-4 (countries and regions)> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"GQ\" . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a single with the ISWC code T-070.942.427-0 that was published on 1998-11-24?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> single . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-070.942.427-0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"T-070.942.427-0\" . ?e <publication date> ?pv . ?pv <pred:date> \"1998-11-24\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the manifestation that was established on 1867-07-01 and has 107 constituencies with a value of 107.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <number of constituencies> ?pv_1 . ?pv_1 <pred:value> \"107.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of constituencies> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"107.0\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a subreddit related to trance music that has an inception date of 1995-01-01 and is also related to psytrance?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> trance . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"psytrance\" . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the comedy show with an end time of 1992-05-09 and a number of episodes of 1 have an episode length of 180.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> comedy . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1992-05-09\"^^xsd:date . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"180.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a conservatory with an inception date of 1862-09-20 and 75 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1862-09-20\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"75.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a museum that opened on 1819-11-19 and has 2.69667e+06 visitors per year?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <date of official opening> ?pv_1 . ?pv_1 <pred:date> \"1819-11-19\"^^xsd:date . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.69667e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an association with an inception date of 1768-01-01 and 80 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> association . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1768-01-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the business dissolved, abolished or demolished on March 1st, 2012 and had 500 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"2012-03-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the newscast, which first aired on 1952-01-14 and has 66.0 seasons, categorized as a newscast?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> newscast . ?e <date of first performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <number of seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a landform that was established on 1898-01-01 and has a population of 133553.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> landform . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"133553.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the activity that ended on 2008-07-27 have 145 participants?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"2008-07-27\"^^xsd:date . ?e <number of participants> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"145.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a cemetery with an inception date of 1825-01-01 and 20,000 graves?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> cemetery . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e <number of graves> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film has a box office of 8.96911e+08 and a fact t of the same value?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <box office> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which comedy has 25 episodes each lasting 25 minutes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> comedy . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"25.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which island has a population of 4170.0 and an area of 4170.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4170.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"4170.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which language has 1.6e+07 speakers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.6e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.6e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which disease has 20 million cases with a unit of 1?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> disease . ?e <number of cases> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of cases> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity belongs to the genre category and has a number of pages equal to 218.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of pages> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"218.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which college has a student count of 18000.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> college . ?e <students count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"18000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students count> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"18000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an anthology with a publication date of 1960-04-11?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> anthology . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1960-04-11\"^^xsd:date . ?e <publication date> ?pv . ?pv <pred:date> \"1960-04-11\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a country that was founded on December 15th, 1954?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-12-15\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1954-12-15\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a city whose inception date is 1850-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1850-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1850-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the comedy with an end time of 1992-05-09 have an end time of 1992-05-09?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> comedy . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1992-05-09\"^^xsd:date . ?e <end time> ?pv . ?pv <pred:date> \"1992-05-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the inception date of the rockabilly instance 1978-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> rockabilly . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1978-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a dynasty that was dissolved, abolished or demolished on January 1st, 1780?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> dynasty . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1780-01-01\"^^xsd:date . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"1780-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an airline that started working on 1926-04-06 and is still working?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <work period (start)> ?pv_1 . ?pv_1 <pred:date> \"1926-04-06\"^^xsd:date . ?e <work period (start)> ?pv . ?pv <pred:date> \"1926-04-06\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the army that has an ISNI of 0000 0004 0498 1870 and was established on 1947-08-15?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> army . ?e <inception> ?pv . ?pv <pred:date> \"1947-08-15\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0498 1870\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the soundtrack titled and published on 2010-04-19 for the movie Iron Man 2?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> soundtrack . ?e <publication date> ?pv . ?pv <pred:date> \"2010-04-19\"^^xsd:date . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is the author with ISNI 0000 0001 0873 3741 and was born on 1934-08-18?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> author . ?e <date of birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which dynasty was dissolved, abolished or demolished on January 1st, 1780 and has a Dewey Decimal Classification of 929.736?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> dynasty . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"1780-01-01\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"929.736\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the conservatory with an ISNI of 0000 0001 2189 390X and an inception date of 1921-01-01?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <inception> ?pv . ?pv <pred:date> \"1921-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2189 390X\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What part does the absolute magnitude of 4.83 and temperature of 5e+06 apply to for a star?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> star . ?e <absolute magnitude> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.83\"^^xsd:double . ?e <temperature> ?pv . ?pv <pred:value> \"5e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <temperature> ; <pred:fact_t> ?pv ] <applies to part> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the language whose IETF language tag is \"es\", has 4.37e+08 speakers, and is a type of language?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.37e+08\"^^xsd:double . ?e <IETF language tag> ?pv . ?pv <pred:value> \"es\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IETF language tag> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]