[{"question": "What language pertains to the http://newtontownhall.com/ website regarding Newton (the one whose inception date is 1864-04-11)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Newton\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1864-04-11\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://newtontownhall.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 92647 for Godzilla (published on 1998-07-17) start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Godzilla\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-07-17\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"92647\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Kitchener (formerly known as Berlin) change its official name?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Kitchener\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1833-11-30\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Berlin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for NBC (the one with an official opening date of 1926-11-15 and an official website of https://www.nbc.com/)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"NBC\" . ?e <date_of_official_opening> ?pv_1 . ?pv_1 <pred:date> \"1926-11-15\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.nbc.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for Freeform (the one whose inception date is 1977-04-29)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Freeform\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1977-04-29\"^^xsd:date . ?e <Giphy_username> ?pv . ?pv <pred:value> \"freeform\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Giphy_username> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Moonraker (published on 1979-06-29) start being associated with exploitation visa number 49675?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Moonraker\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1979-06-29\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"49675\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 118697 for Stardust (published on 2007-10-18) start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Stardust\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-10-18\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"118697\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Burgundy (the one with the INSEE region code 26) end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Burgundy\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1972-07-09\"^^xsd:date . ?e <INSEE_region_code> ?pv . ?pv <pred:value> \"26\" . [ <pred:fact_h> ?e ; <pred:fact_r> <INSEE_region_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Twitter account \"pasdecalais62\" have for Pas-de-Calais (which was established on 1790-03-04)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Pas-de-Calais\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-03-04\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"pasdecalais62\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the author of the book \"August\" published on January 1, 1996?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"August\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1996-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"August\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.philips.com website regarding Philips (the one whose inception date is 1891-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Philips\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1891-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.philips.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the city of Boston (inception date: 1630-09-07) with the official website http://www.cityofboston.gov/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Boston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityofboston.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPI name number for Fergie (the one born on 1975-03-27)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Fergie\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1975-03-27\"^^xsd:date . ?e <IPI_name_number> ?pv . ?pv <pred:value> \"340675175\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPI_name_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of the work or name for Ghostbusters (published on 1985-01-25 and has an official website of http://www.ghostbusters.com/)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ghostbusters\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1985-01-25\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ghostbusters.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Twitter account with the username FargoFX have for the show Fargo (which started on 2014-04-15)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Fargo\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2014-04-15\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"FargoFX\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the Bahamas (the one with an Instagram username of bahamasmusic) born?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bahamas\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1981-04-28\"^^xsd:date . ?e <Instagram_username> ?pv . ?pv <pred:value> \"bahamasmusic\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Instagram_username> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name that Drake (the one born on 1986-10-24) is known as according to the IPI name number 00529397022?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Drake\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1986-10-24\"^^xsd:date . ?e <IPI_name_number> ?pv . ?pv <pred:value> \"00529397022\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPI_name_number> ; <pred:fact_t> ?pv ] <named_as> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Macau (with ISO 3166-2 code CN-92) end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Macau\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-12-20\"^^xsd:date . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"CN-92\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of the official website http://www.espn.co.uk/ for ESPN (the one with an inception date of 1979-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"ESPN\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1979-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.espn.co.uk/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <country> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the subreddit that is related to breakbeat (which was created on 1988-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"breakbeat\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1988-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"breakbeat\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.cityofames.org website regarding Ames (the one whose inception date is 1864-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ames\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1864-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityofames.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the city of Petaluma (which was established on 1858-04-12) and has an official website of http://cityofpetaluma.net/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Petaluma\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1858-04-12\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://cityofpetaluma.net/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the Minnesota official website (https://mn.gov/) that was established on 1858-05-11?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Minnesota\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1858-05-11\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://mn.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person with the birth name \"C. Octavius C.f.\" and died on August 19, 0014?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Augustus\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"0014-08-19\"^^xsd:date . ?e <birth_name> ?pv . ?pv <pred:value> \"C. Octavius C.f.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <birth_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the movie Ghost (published on 1990-01-01) start using the exploitation visa number 74677?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ghost\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1990-01-01\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"74677\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Cher (born on 1946-05-20) have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Cher\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1946-05-20\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"cher\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of Penang (the one with postal code 10000-14400)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Penang\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1786-01-01\"^^xsd:date . ?e <postal_code> ?pv . ?pv <pred:value> \"10000\u201314400\" . [ <pred:fact_h> ?e ; <pred:fact_r> <postal_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.dreamworkspictures.com website regarding DreamWorks (the one whose inception date is 1994-10-12)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"DreamWorks\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1994-10-12\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dreamworkspictures.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://muse.mu/ website regarding the band Muse (whose inception date is 1994-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Muse\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1994-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://muse.mu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Jersey (the one with an ISO 3166-2 code of GB-JSY) end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Jersey\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1651-12-12\"^^xsd:date . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"GB-JSY\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Eminem (born on 1972-10-17) have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Eminem\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1972-10-17\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"eminem\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.bayonnenj.org/ regarding Bayonne (which was established on 1861-04-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bayonne\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1861-04-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.bayonnenj.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Brittany (the one with ISO 3166-2 code FR-E) end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Brittany\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1972-07-09\"^^xsd:date . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"FR-E\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 125419 for the movie Pina start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Pina\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-02-13\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"125419\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Florida (which was established on 1845-03-03)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Florida\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1845-03-03\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--759\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Alameda (the one whose inception date is 1853-06-06)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Alameda\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1853-06-06\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79465\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 114879 for Paris (the one with a publication date of 2008-07-17) start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Paris\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-07-17\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"114879\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does P!nk (born on 1979-09-08) have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"P!nk\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1979-09-08\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Pink\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Intel start using the IPv4 routing prefix 143.181.0.0/16?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Intel\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-07-18\"^^xsd:date . ?e <IPv4_routing_prefix> ?pv . ?pv <pred:value> \"143.181.0.0/16\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4_routing_prefix> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Taiwan (the one with an inception date of 1912-01-01) stop having the IOC country code ROC?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Taiwan\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-01-01\"^^xsd:date . ?e <IOC_country_code> ?pv . ?pv <pred:value> \"ROC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IOC_country_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the publication with the name \"Armageddon\" and publication date of 1998-07-01?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Armageddon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-07-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Armageddon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.ci.salinas.ca.us regarding the city Salinas (which was established on 1874-03-04)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Salinas\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1874-03-04\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ci.salinas.ca.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.wilkes-barre.pa.us website regarding Wilkes-Barre (the one whose inception date is 1769-01-01)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Wilkes-Barre\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1769-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.wilkes-barre.pa.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Eve (born on 1978-11-10) have on Twitter with the username TheRealEve?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Eve\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1978-11-10\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TheRealEve\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Aaliyah (the one who died on 2001-08-25)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Aaliyah\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"2001-08-25\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 5958 5374\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person with ISNI 0000 0001 1450 8479 and died on 1995-03-04?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Iftekhar\" . ?e <date_of_death> ?pv_1 . ?pv_1 <pred:date> \"1995-03-04\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1450 8479\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the band Rush (inception date: 1968-01-01) have on Twitter (username: rushtheband)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Rush\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-01-01\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"rushtheband\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the city Escondido (incepted on 1888-01-01) with the official website http://www.escondido.org?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Escondido\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1888-01-01\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.escondido.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Ronaldo (born on 1976-09-22) have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ronaldo\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1976-09-22\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Ronaldo\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Beetlejuice (born on 1968-06-02) have on Twitter with the username \"Beetlepimp\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Beetlejuice\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1968-06-02\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Beetlepimp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 134856 for Skyfall (published on 2012-10-26) start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Skyfall\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2012-10-26\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"134856\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Australia start using exploitation visa number 67156?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Australia\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1989-01-01\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"67156\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the exploitation visa number 116424 for Eragon (published on 2006-12-14) start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Eragon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-12-14\"^^xsd:date . ?e <exploitation_visa_number> ?pv . ?pv <pred:value> \"116424\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation_visa_number> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.city.greensburg.pa.us/ website regarding the city Greensburg (whose inception date is 1799-02-09)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Greensburg\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1799-02-09\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.city.greensburg.pa.us/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the author of the book \"Helen\" published on 2009-01-16?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Helen\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-16\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Helen\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]