[{"question": "Is the title of the publication \"Sicko\" with a publication date of 2007-10-11?", "sparql": "ASK { ?e <pred:name> \"Sicko\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-10-11\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Sicko\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Goldfinger\" published on March 23, 1959?", "sparql": "ASK { ?e <pred:name> \"Goldfinger\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1959-03-23\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Goldfinger\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Fresno\" published on 1986-01-01 in Fresno?", "sparql": "ASK { ?e <pred:name> \"Fresno\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1986-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Fresno\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the show Bewitched and was it published on 1945-01-01?", "sparql": "ASK { ?e <pred:name> \"Bewitched\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1945-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Bewitched\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the publication \"Julia\" with a publication date of 2013-08-31?", "sparql": "ASK { ?e <pred:name> \"Julia\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2013-08-31\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Julia\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Bones\" published on 2001-01-01?", "sparql": "ASK { ?e <pred:name> \"Bones\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2001-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Bones\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Ontario \"Ontario\" and was it established on July 1, 1867?", "sparql": "ASK { ?e <pred:name> \"Ontario\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Ontario\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Wakefield\" published on 2017-07-06 about the city named Wakefield?", "sparql": "ASK { ?e <pred:name> \"Wakefield\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2017-07-06\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Wakefield\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Centurion and its publication date 2010-08-26?", "sparql": "ASK { ?e <pred:name> \"Centurion\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-08-26\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Centurion\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Alias end on May 22, 2006?", "sparql": "ASK { ?e <pred:name> \"Alias\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2006-05-22\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Alias\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Miami\" published on 1924-01-01 in Miami?", "sparql": "ASK { ?e <pred:name> \"Miami\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1924-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Miami\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of iOS \"iOS\" and was it published on 2007-06-29?", "sparql": "ASK { ?e <pred:name> \"iOS\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-06-29\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"iOS\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Nigeria's subreddit \"Nigeria\" and was it established on 1960-01-01?", "sparql": "ASK { ?e <pred:name> \"Nigeria\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Nigeria\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Zodiac\" published on 2007-03-02?", "sparql": "ASK { ?e <pred:name> \"Zodiac\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-03-02\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Zodiac\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the book with the title \"Catch-22\" published on 1961-11-10?", "sparql": "ASK { ?e <pred:name> \"Catch-22\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1961-11-10\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Catch-22\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Popeye\" published on 1980-12-12?", "sparql": "ASK { ?e <pred:name> \"Popeye\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1980-12-12\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Popeye\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Evita\" published on January 9, 1997?", "sparql": "ASK { ?e <pred:name> \"Evita\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1997-01-09\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Evita\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the show Constantine end on February 13, 2015?", "sparql": "ASK { ?e <pred:name> \"Constantine\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2015-02-13\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Constantine\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the publication date of the movie Titanic 1943-01-01 and the title of the movie also Titanic?", "sparql": "ASK { ?e <pred:name> \"Titanic\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1943-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Titanic\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Western\" published on 2017-08-24?", "sparql": "ASK { ?e <pred:name> \"Western\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2017-08-24\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Western\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the book Seabiscuit published on 2003-09-25 also Seabiscuit?", "sparql": "ASK { ?e <pred:name> \"Seabiscuit\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2003-09-25\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Seabiscuit\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a subreddit named \"Beetlejuice\" that was published on 1988-11-10?", "sparql": "ASK { ?e <pred:name> \"Beetlejuice\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1988-11-10\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Beetlejuice\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Kick-Ass and was it published on 2010-03-12?", "sparql": "ASK { ?e <pred:name> \"Kick-Ass\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-03-12\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Kick-Ass\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Frost/Nixon and its publication date 2009-01-29?", "sparql": "ASK { ?e <pred:name> \"Frost/Nixon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-29\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Frost/Nixon\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the book titled \"Good\" published on January 1, 2008?", "sparql": "ASK { ?e <pred:name> \"Good\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Good\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Vermont\" associated with the state of Vermont (which was established on 1791-03-04)?", "sparql": "ASK { ?e <pred:name> \"Vermont\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1791-03-04\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Vermont\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the name in native language of the person born on 1821-01-01 Christian?", "sparql": "ASK { ?e <pred:name> \"Christian\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Christian\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the book titled \"Bird\" published on January 1, 1988?", "sparql": "ASK { ?e <pred:name> \"Bird\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1988-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Bird\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie \"Poltergeist\" and was it published on 2015-05-28?", "sparql": "ASK { ?e <pred:name> \"Poltergeist\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2015-05-28\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Poltergeist\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Hancock\" published on June 16, 2008?", "sparql": "ASK { ?e <pred:name> \"Hancock\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-06-16\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Hancock\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Gibraltar\" published on 1964-01-01 in Gibraltar?", "sparql": "ASK { ?e <pred:name> \"Gibraltar\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Gibraltar\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Arizona\" published on January 1, 1918 in Arizona?", "sparql": "ASK { ?e <pred:name> \"Arizona\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1918-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Arizona\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Ulm \"Ulm\" and was it founded on January 1, 1181?", "sparql": "ASK { ?e <pred:name> \"Ulm\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1181-01-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Ulm\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book titled \"Moonraker\" published on August 18, 1979?", "sparql": "ASK { ?e <pred:name> \"Moonraker\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1979-08-18\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Moonraker\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Reds\" published on 1981-01-01?", "sparql": "ASK { ?e <pred:name> \"Reds\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1981-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Reds\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the publication date of the book \"Thirteen\" on November 13, 2003?", "sparql": "ASK { ?e <pred:name> \"Thirteen\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2003-11-13\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Thirteen\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a publication titled \"Super\" with a publication date of 2010-01-01?", "sparql": "ASK { ?e <pred:name> \"Super\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Super\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Canberra \"Canberra\" and was it established on 0250-03-12?", "sparql": "ASK { ?e <pred:name> \"Canberra\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0250-03-12\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Canberra\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Zimbabwe's subreddit \"Zimbabwe\" and was it established on January 1, 1980?", "sparql": "ASK { ?e <pred:name> \"Zimbabwe\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1980-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Zimbabwe\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Twitter hashtag for Catalonia \"Catalonia\" and was it established on 1978-12-29?", "sparql": "ASK { ?e <pred:name> \"Catalonia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-12-29\"^^xsd:date . ?e <Twitter_hashtag> ?pv . ?pv <pred:value> \"Catalonia\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book titled \"Jerusalem\" published on 1998-07-02?", "sparql": "ASK { ?e <pred:name> \"Jerusalem\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-07-02\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Jerusalem\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"50/50\" released on May 3, 2012?", "sparql": "ASK { ?e <pred:name> \"50/50\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2012-05-03\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"50/50\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book titled \"Airport\" published on 1970-03-25?", "sparql": "ASK { ?e <pred:name> \"Airport\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1970-03-25\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Airport\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a subreddit named \"Togo\" that was created on 1960-01-01?", "sparql": "ASK { ?e <pred:name> \"Togo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Togo\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Brunei's demonym also Brunei and its inception date 1984-01-01?", "sparql": "ASK { ?e <pred:name> \"Brunei\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1984-01-01\"^^xsd:date . ?e <demonym> ?pv . ?pv <pred:value> \"Brunei\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is MSNBC's Twitter username \"MSNBC\" and was it founded on July 15, 1996?", "sparql": "ASK { ?e <pred:name> \"MSNBC\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1996-07-15\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"MSNBC\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Twitter username of NBC \"NBC\" and the date of official opening 1926-11-15?", "sparql": "ASK { ?e <pred:name> \"NBC\" . ?e <date_of_official_opening> ?pv_1 . ?pv_1 <pred:date> \"1926-11-15\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"NBC\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Twitter username of CBS \"CBS\" and was CBS founded on September 18, 1927?", "sparql": "ASK { ?e <pred:name> \"CBS\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1927-09-18\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"CBS\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book titled \"Flight\" published on January 1, 1929?", "sparql": "ASK { ?e <pred:name> \"Flight\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1929-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Flight\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"W.\" released on January 1, 2008?", "sparql": "ASK { ?e <pred:name> \"W.\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"W.\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Alice (born on 1954-09-26) also known by the pseudonym Alice?", "sparql": "ASK { ?e <pred:name> \"Alice\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1954-09-26\"^^xsd:date . ?e <pseudonym> ?pv . ?pv <pred:value> \"Alice\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Split\" released on February 22, 2017?", "sparql": "ASK { ?e <pred:name> \"Split\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2017-02-22\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Split\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Muskegon\" associated with the city Muskegon (which was established on 1837-01-01)?", "sparql": "ASK { ?e <pred:name> \"Muskegon\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1837-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Muskegon\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie \"Beginners\" and its publication date 2011-06-09?", "sparql": "ASK { ?e <pred:name> \"Beginners\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-06-09\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Beginners\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Romania\" related to the country Romania (which was established on 1859-01-24)?", "sparql": "ASK { ?e <pred:name> \"Romania\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1859-01-24\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Romania\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Budapest equal to \"Budapest\" and was it founded on November 17, 1873?", "sparql": "ASK { ?e <pred:name> \"Budapest\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1873-11-17\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Budapest\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Napoleon\" published on 1996-12-19 about Napoleon?", "sparql": "ASK { ?e <pred:name> \"Napoleon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1996-12-19\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Napoleon\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Timbaland's name in native language Timbaland and was he born on 1972-03-10?", "sparql": "ASK { ?e <pred:name> \"Timbaland\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1972-03-10\"^^xsd:date . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Timbaland\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book titled \"Cleopatra\" published on January 1, 1917?", "sparql": "ASK { ?e <pred:name> \"Cleopatra\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1917-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Cleopatra\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Georgia\" published on January 1, 1995 in Georgia?", "sparql": "ASK { ?e <pred:name> \"Georgia\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Georgia\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit for Delaware \"Delaware\" and was it established on December 7, 1787?", "sparql": "ASK { ?e <pred:name> \"Delaware\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1787-12-07\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Delaware\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Kiel \"Kiel\" and was it established on 1201-01-01?", "sparql": "ASK { ?e <pred:name> \"Kiel\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1201-01-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Kiel\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie \"Transamerica\" and was it published on January 1, 2005?", "sparql": "ASK { ?e <pred:name> \"Transamerica\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Transamerica\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie \"Armageddon\" and was it published on July 1, 1998?", "sparql": "ASK { ?e <pred:name> \"Armageddon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-07-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Armageddon\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Avatar and its publication date 2004-01-01?", "sparql": "ASK { ?e <pred:name> \"Avatar\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2004-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Avatar\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Secretariat\" published on 2011-05-19?", "sparql": "ASK { ?e <pred:name> \"Secretariat\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-05-19\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Secretariat\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Sydney \"Sydney\" and was it established on January 1, 1788?", "sparql": "ASK { ?e <pred:name> \"Sydney\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-01-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Sydney\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Yentl and its publication date 1984-03-30?", "sparql": "ASK { ?e <pred:name> \"Yentl\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1984-03-30\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Yentl\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Z\" published on 1969-01-01?", "sparql": "ASK { ?e <pred:name> \"Z\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1969-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Z\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Pakistan's subreddit \"Pakistan\" and was it founded on August 14, 1947?", "sparql": "ASK { ?e <pred:name> \"Pakistan\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-08-14\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Pakistan\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Transylvania\" published on 2006-01-01 in Transylvania?", "sparql": "ASK { ?e <pred:name> \"Transylvania\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Transylvania\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show \"Fringe\" end on January 18, 2013?", "sparql": "ASK { ?e <pred:name> \"Fringe\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2013-01-18\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Fringe\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Sting's Twitter username \"Sting\" and was he born on March 20, 1959?", "sparql": "ASK { ?e <pred:name> \"Sting\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1959-03-20\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Sting\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Goodfellas and its publication date 1990-01-01?", "sparql": "ASK { ?e <pred:name> \"Goodfellas\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1990-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Goodfellas\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of Rushmore \"Rushmore\" and was it published on 1998-09-17?", "sparql": "ASK { ?e <pred:name> \"Rushmore\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-09-17\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Rushmore\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Silkwood published on 1983-01-01 also Silkwood?", "sparql": "ASK { ?e <pred:name> \"Silkwood\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Silkwood\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Providence\" published on 1977-01-25 in Providence?", "sparql": "ASK { ?e <pred:name> \"Providence\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1977-01-25\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Providence\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Jersey equal to \"Jersey\" and was it established on 1651-12-12?", "sparql": "ASK { ?e <pred:name> \"Jersey\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1651-12-12\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Jersey\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]