[
    {
        "question": "When did Boston become a part of the United States of America (whose inception date is 1776-07-04)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Boston\" . ?e_2 <pred:name> \"United States of America\" . ?e_2 <inception> ?pv . ?pv <pred:date> \"1776-07-04\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is the author of the book that Harry Potter and the Goblet of Fire is based on, which was published on 2000-07-08?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <publication date> ?pv . ?pv <pred:date> \"2000-07-08\"^^xsd:date . ?e_1 <based on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based on> ; <pred:fact_t> ?e_2 ] <author> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the city of Boston (whose inception date is 1630-09-07) and has an official website of http://www.cityofboston.gov/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Boston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://www.cityofboston.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cameroon have a Human Development Index of 0.436 and a Dewey Decimal Classification of 2--6711?",
        "sparql": "ASK { ?e <pred:name> \"Cameroon\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6711\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the Bharatiya Janata Party's member count 1.1e+08 and is it associated with the British Museum person-institution with ID 8433?",
        "sparql": "ASK { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <member count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1e+08\"^^xsd:double . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"8433\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Harry Potter and the Goblet of Fire have a box office of 8.96911e+08?",
        "sparql": "ASK { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <box office> ?pv . ?pv <pred:value> \"8.96911e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many type of business entities have an ISNI of 0000 0004 0502 5178?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"type of business entity\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0502 5178\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many national association football teams have a ranking of 136.0?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <ranking> ?pv . ?pv <pred:value> \"136.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many visual artworks have the title \"Malcolm X\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <title> ?pv . ?pv <pred:value> \"Malcolm X\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many science awards have a review score of 0.8?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science award\" . ?e <review score> ?pv . ?pv <pred:value> \"0.8\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the agent with less than arg1 seats and exactly 59 seats?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <number of seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"arg1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seats> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"59.0\" . ?e <number of seats> ?pv . ?pv <pred:value> \"59.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has an area of 37.5618 and a population of 25514.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv . ?pv <pred:value> \"37.5618\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25514.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a city in the United States that was founded on 1630-09-07 and has an elevation above sea level of 43.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"43.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the person born on 1931-09-21 with Munzinger IBA 00000016518 exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1931-09-21\"^^xsd:date . ?e <Munzinger IBA> ?pv . ?pv <pred:value> \"00000016518\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the film with a publication date of 2008-01-01 and a duration of 160.0 exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"160.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the theatrical genre with an end time of 1968-03-25 and 58.0 number of episodes exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1968-03-25\"^^xsd:date . ?e <number of episodes> ?pv . ?pv <pred:value> \"58.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the 40th Academy Awards ceremony take place on April 10th, 1968?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <point in time> ?pv_1 . ?pv_1 <pred:date> \"1968-04-10\"^^xsd:date . ?e <edition number> ?pv . ?pv <pred:value> \"40\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the video game console model discontinued on January 4th, 2013 and priced at 299.99?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <discontinued date> ?pv_1 . ?pv_1 <pred:date> \"2013-01-04\"^^xsd:date . ?e <price> ?pv . ?pv <pred:value> \"299.99\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the capital with the LAU code CZ554782 first mentioned in written records on 0965-01-17?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"0965-01-17\"^^xsd:date . ?e <LAU> ?pv . ?pv <pred:value> \"CZ554782\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What form of government had a nominal GDP of 2.77008e+09 on January 1st, 2004 and a Human Development Index of 0.473?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"form of government\" . ?e <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"2.77008e+09\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal GDP> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2004-01-01\"^^xsd:date . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.473\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the agent with an IPv4 routing prefix of 204.123.0.0/16, whose start time is 1994-08-16, and has an employee with a salary of 66000.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <IPv4 routing prefix> ?pv_1 . ?pv_1 <pred:value> \"204.123.0.0/16\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4 routing prefix> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1994-08-16\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a U.S. city with a population of 40 and a population less than arg3?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"40.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an anime with 13 episodes and less than arg3 total number of episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13.0\"^^xsd:double . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a single with a beats per minute of 72.0 and a beats per minute less than arg3?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <beats per minute> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"72.0\"^^xsd:double . ?e <beats per minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the agent with 59.0 seats have less than arg3 seats?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <number of seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"59.0\"^^xsd:double . ?e <number of seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an award with a quantity of 1 and a value less than \"arg3\" and a quantity of 1 and a value of 84.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <quantity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"84.0\"^^xsd:double . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a first-level administrative country subdivision with a Human Development Index of 0.761 and another Human Development Index value less than arg3?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.761\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a natural satellite with an albedo of 0.136 and another albedo less than arg3?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"natural satellite\" . ?e <albedo> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.136\"^^xsd:double . ?e <albedo> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a chemical compound with two pKa values, one of which is 4.752 and the other is less than arg3?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemical compound\" . ?e <pKa> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.752\"^^xsd:double . ?e <pKa> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a disease with 881730.0 cases and less than arg3 cases?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <number of cases> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"881730.0\"^^xsd:double . ?e <number of cases> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an astronomical object type with an absolute magnitude of 4.83 and another absolute magnitude less than arg3?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"astronomical object type\" . ?e <absolute magnitude> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.83\"^^xsd:double . ?e <absolute magnitude> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a geographic region with a total fertility rate of 2.3 and another total fertility rate less than arg3?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"geographic region\" . ?e <total fertility rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.3\"^^xsd:double . ?e <total fertility rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a dead language with 100% of its speakers having less than arg3 speakers?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dead language\" . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"100.0\"^^xsd:double . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the British Museum person-institution of Fred Astaire (whose name in native language is also Fred Astaire)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fred Astaire\" . ?e <name in native language> ?pv_1 . ?pv_1 <pred:value> \"Fred Astaire\" . ?e <British Museum person-institution> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Stuttgart and what is its Twitter hashtag?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Stuttgart\" . ?e <Twitter hashtag> ?pv_1 . ?pv_1 <pred:value> \"Stuttgart\" . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the PhilPapers topic for heterosexuality?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"heterosexuality\" . ?e <PhilPapers topic> ?pv_1 . ?pv_1 <pred:value> \"heterosexuality\" . ?e <PhilPapers topic> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of the metropolitan area with a population of 2.71049e+06 as of 2014-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.71049e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <country> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the attendance for the film that ended on 2018-05-30 and had an attendance of 8446.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8446.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date . ?e <attendance> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has an area of 9.244e+07?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv . ?pv <pred:value> \"9.244e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity is related to engineering and has an IPTC Newscode of mediatopic/20000716?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"engineering\" . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000716\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which class of instruments has a Hornbostel-Sachs classification of 111.242?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of instruments\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"111.242\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which form of government has a British Museum person-institution value of 180889?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"form of government\" . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"180889\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which town is a market town and has an OS grid reference of SE455215?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"market town\" . ?e <OS grid reference> ?pv . ?pv <pred:value> \"SE455215\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which human has a height of 183.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <height> ?pv . ?pv <pred:value> \"183.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which real property has an OSM tag or key of \"Tag:shop=art\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"real property\" . ?e <OSM tag or key> ?pv . ?pv <pred:value> \"Tag:shop=art\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which Golden Globe Award ceremony has an edition number of 60?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Golden Globe Award ceremony\" . ?e <edition number> ?pv . ?pv <pred:value> \"60\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What activity is associated with the PhilPapers topic of heterosexuality?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <PhilPapers topic> ?pv . ?pv <pred:value> \"heterosexuality\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]