[{"question": "Is the population of Rochester 106769?", "sparql": "ASK { ?e <pred:name> \"Rochester\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Rochester\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"106769.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Weeds\" have a title equal to \"Weeds\" and a number of episodes equal to 102.0?", "sparql": "ASK { ?e <pred:name> \"Weeds\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Weeds\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"102.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Philadelphia have a native label equal to \"Philadelphia\" and a population of 1,560,300?", "sparql": "ASK { ?e <pred:name> \"Philadelphia\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Philadelphia\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.5603e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Portland have a subreddit named \"Portland\" and a population of 583,776?", "sparql": "ASK { ?e <pred:name> \"Portland\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Portland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"583776.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Dehradun have a subreddit with the value \"Dehradun\" and a population of 578420.0?", "sparql": "ASK { ?e <pred:name> \"Dehradun\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Dehradun\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"578420.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Tarzan's nickname also Tarzan?", "sparql": "ASK { ?e <pred:name> \"Tarzan\" . ?e <nickname> ?pv . ?pv <pred:value> \"Tarzan\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the subreddit \"astrology\" belong to the topic of astrology?", "sparql": "ASK { ?e <pred:name> \"astrology\" . ?e <subreddit> ?pv . ?pv <pred:value> \"astrology\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"Shackleton\" the title of a person named Shackleton?", "sparql": "ASK { ?e <pred:name> \"Shackleton\" . ?e <title> ?pv . ?pv <pred:value> \"Shackleton\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"Q-Tip\" a pseudonym for Q-Tip?", "sparql": "ASK { ?e <pred:name> \"Q-Tip\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Q-Tip\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"Prince\" a pseudonym of Prince?", "sparql": "ASK { ?e <pred:name> \"Prince\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Prince\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a title called \"Giant\" that has the same name as its value?", "sparql": "ASK { ?e <pred:name> \"Giant\" . ?e <title> ?pv . ?pv <pred:value> \"Giant\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a Dictionary of Medieval Names from European Sources entry for the name Laura?", "sparql": "ASK { ?e <pred:name> \"Laura\" . ?e <Dictionary_of_Medieval_Names_from_European_Sources_entry> ?pv . ?pv <pred:value> \"Laura\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a person named Ali who also has the title Ali?", "sparql": "ASK { ?e <pred:name> \"Ali\" . ?e <title> ?pv . ?pv <pred:value> \"Ali\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Lawrence?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lawrence\" . ?e <native_label> ?pv . ?pv <pred:value> \"Lawrence\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit related to Uganda?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Uganda\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Uganda\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the short name of Fiji?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Fiji\" . ?e <short_name> ?pv . ?pv <pred:value> \"Fiji\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the demonym for Taiwan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Taiwan\" . ?e <demonym> ?pv . ?pv <pred:value> \"Taiwan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Cleveland?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Cleveland\" . ?e <official_name> ?pv . ?pv <pred:value> \"Cleveland\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of York?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"York\" . ?e <official_name> ?pv . ?pv <pred:value> \"York\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Nairobi?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nairobi\" . ?e <official_name> ?pv . ?pv <pred:value> \"Nairobi\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Mobile?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mobile\" . ?e <official_name> ?pv . ?pv <pred:value> \"Mobile\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Madison?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Madison\" . ?e <native_label> ?pv . ?pv <pred:value> \"Madison\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of \u0130zmir?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"\u0130zmir\" . ?e <native_label> ?pv . ?pv <pred:value> \"\u0130zmir\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Alaska\" related to Alaska?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Alaska\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Alaska\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Hobart officially become known as Hobart?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hobart\" . ?e <official_name> ?pv . ?pv <pred:value> \"Hobart\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Cambridge?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Cambridge\" . ?e <native_label> ?pv . ?pv <pred:value> \"Cambridge\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did macOS start being the official name?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"macOS\" . ?e <official_name> ?pv . ?pv <pred:value> \"macOS\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit related to Hawaii?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hawaii\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Hawaii\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit related to chemistry?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"chemistry\" . ?e <subreddit> ?pv . ?pv <pred:value> \"chemistry\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit related to snowboarding?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"snowboarding\" . ?e <subreddit> ?pv . ?pv <pred:value> \"snowboarding\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Paramaribo?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Paramaribo\" . ?e <native_label> ?pv . ?pv <pred:value> \"Paramaribo\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Moscow?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Moscow\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Moscow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the real name of T-Pain?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"T-Pain\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"T-Pain\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pseudonym> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the topic that is related to ethics according to PhilPapers?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"ethics\" . ?e <PhilPapers_topic> ?pv . ?pv <pred:value> \"ethics\" . [ <pred:fact_h> ?e ; <pred:fact_r> <PhilPapers_topic> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Egypt\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Egypt\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Egypt\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Riyadh?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Riyadh\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Riyadh\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Hunan\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hunan\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Hunan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Tucson?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Tucson\" . ?e <native_label> ?pv . ?pv <pred:value> \"Tucson\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Guildford?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Guildford\" . ?e <native_label> ?pv . ?pv <pred:value> \"Guildford\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Lynn?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lynn\" . ?e <native_label> ?pv . ?pv <pred:value> \"Lynn\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Blondie\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Blondie\" . ?e <title> ?pv . ?pv <pred:value> \"Blondie\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is Rockville named after?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Rockville\" . ?e <official_name> ?pv . ?pv <pred:value> \"Rockville\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <named_after> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Karachi?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Karachi\" . ?e <native_label> ?pv . ?pv <pred:value> \"Karachi\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of France?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"France\" . ?e <native_label> ?pv . ?pv <pred:value> \"France\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Twitter account \"Toulouse\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Toulouse\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Toulouse\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter hashtag for Indonesia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Indonesia\" . ?e <Twitter_hashtag> ?pv . ?pv <pred:value> \"Indonesia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_hashtag> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who has the title \"Bird\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bird\" . ?e <title> ?pv . ?pv <pred:value> \"Bird\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Paterson\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Paterson\" . ?e <title> ?pv . ?pv <pred:value> \"Paterson\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the author of the book titled \"Anonymous\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Anonymous\" . ?e <title> ?pv . ?pv <pred:value> \"Anonymous\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of the subreddit for Zimbabwe?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Zimbabwe\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Zimbabwe\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in native language of Buckethead?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Buckethead\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Buckethead\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Dordrecht?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Dordrecht\" . ?e <native_label> ?pv . ?pv <pred:value> \"Dordrecht\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Reno?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Reno\" . ?e <title> ?pv . ?pv <pred:value> \"Reno\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Chemnitz?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Chemnitz\" . ?e <official_name> ?pv . ?pv <pred:value> \"Chemnitz\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Manhattan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Manhattan\" . ?e <native_label> ?pv . ?pv <pred:value> \"Manhattan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Princeton?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Princeton\" . ?e <native_label> ?pv . ?pv <pred:value> \"Princeton\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person with the title \"Chuck\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Chuck\" . ?e <title> ?pv . ?pv <pred:value> \"Chuck\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in native language of Nico?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nico\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Nico\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Kent?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Kent\" . ?e <official_name> ?pv . ?pv <pred:value> \"Kent\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Budapest?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Budapest\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Budapest\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Sacramento?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sacramento\" . ?e <official_name> ?pv . ?pv <pred:value> \"Sacramento\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Duisburg?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Duisburg\" . ?e <native_label> ?pv . ?pv <pred:value> \"Duisburg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Tianjin?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Tianjin\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Tianjin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Alton?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Alton\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Alton\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Viacom have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Viacom\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Viacom\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Memphis?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Memphis\" . ?e <official_name> ?pv . ?pv <pred:value> \"Memphis\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Turku?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Turku\" . ?e <native_label> ?pv . ?pv <pred:value> \"Turku\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Philadelphia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Philadelphia\" . ?e <title> ?pv . ?pv <pred:value> \"Philadelphia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the show Scrubs?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Scrubs\" . ?e <title> ?pv . ?pv <pred:value> \"Scrubs\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does CNBC have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"CNBC\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"CNBC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Turkey\" in Turkey?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Turkey\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Turkey\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the Twitter hashtag \"Catalonia\" related to?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Catalonia\" . ?e <Twitter_hashtag> ?pv . ?pv <pred:value> \"Catalonia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_hashtag> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the topic that is related to existentialism according to PhilPapers?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"existentialism\" . ?e <PhilPapers_topic> ?pv . ?pv <pred:value> \"existentialism\" . [ <pred:fact_h> ?e ; <pred:fact_r> <PhilPapers_topic> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person with the pseudonym \"Seal\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Seal\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Seal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pseudonym> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the real name of Q-Tip?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Q-Tip\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Q-Tip\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pseudonym> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]