[
    {
        "question": "Which cruise ship has an IMO ship number of 5059953?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cruise ship\" . ?e <IMO ship number> ?pv . ?pv <pred:value> \"5059953\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which theatrical genre has 58 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <number of episodes> ?pv . ?pv <pred:value> \"58.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entertainment has a Nintendo GameID of RGHJ52?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Nintendo GameID> ?pv . ?pv <pred:value> \"RGHJ52\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which video game developer has a Corporate Number (Japan) of 6120901008215?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e <Corporate Number (Japan)> ?pv . ?pv <pred:value> \"6120901008215\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which metropolitan area has a nighttime view of \"Long Beach, CA at night.jpg\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <nighttime view> ?pv . ?pv <pred:value> \"Long Beach, CA at night.jpg\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which female given name has a Caverphone code of ARR111?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"female given name\" . ?e <Caverphone> ?pv . ?pv <pred:value> \"ARR111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which biological process has a spoken text audio named \"Simple en Evolution.oga\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"biological process\" . ?e <spoken text audio> ?pv . ?pv <pred:value> \"Simple en Evolution.oga\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which television series episode has a production code of 111?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <production code> ?pv . ?pv <pred:value> \"111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which body fluid has a UMLS CUI of C0229671?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"body fluid\" . ?e <UMLS CUI> ?pv . ?pv <pred:value> \"C0229671\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which disease has a DiseasesDB ID of 9651?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"9651\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which currency has an ISO 4217 code of CAD?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <ISO 4217 code> ?pv . ?pv <pred:value> \"CAD\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a U.S. city with an area of 15.661?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"15.661\" . ?e <area> ?pv . ?pv <pred:value> \"15.661\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the film have a duration of 160.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"160.0\" . ?e <duration> ?pv . ?pv <pred:value> \"160.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the town with OS grid reference SK245225 have another OS grid reference of SK245225?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"SK245225\" . ?e <OS grid reference> ?pv . ?pv <pred:value> \"SK245225\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Will the comics character with ISNI 0000 0003 5932 6542 be in the public domain in the United States of America by 2024-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comics character\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0003 5932 6542\" . ?e <public domain date> ?pv . ?pv <pred:date> \"2024-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <public domain date> ; <pred:fact_t> ?pv ] <applies to jurisdiction> ?qpv . ?qpv <pred:value> \"United States of America\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Pan Am the operator of the aircraft functional class that had a total production of 1527 and entered service on 1970-01-22?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <total produced> ?pv_1 . ?pv_1 <pred:value> \"1527.0\" . ?e <service entry> ?pv . ?pv <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast and Ivory Coast (the one whose Human Development Index is 0.415)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.415\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Vinod Khanna and Bharatiya Janata Party (the one with 117 representatives in an organization/legislature)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vinod Khanna\" . ?e_2 <pred:name> \"Bharatiya Janata Party\" . ?e_2 <number of representatives in an organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Emma Watson and Harry Potter and the Goblet of Fire (the one whose box office is 8.96911e+08)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Emma Watson\" . ?e_2 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Top Hat and Fred Astaire (the one who has 2 children)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Top Hat\" . ?e_2 <pred:name> \"Fred Astaire\" . ?e_2 <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the city of the United States with a WOEID of 2475403 and a subreddit of PortHuron?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2475403\" . ?e <subreddit> ?pv . ?pv <pred:value> \"PortHuron\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the subject's role for the town with an OS grid reference of SK245225 and a TOID of 4000000074552364?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"SK245225\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074552364\" . [ <pred:fact_h> ?e ; <pred:fact_r> <TOID> ; <pred:fact_t> ?pv ] <subject has role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the city of the United States, whose elevation above sea level is 114.0 and area is 15.661, the same as the one whose elevation above sea level is 114.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"114.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"114.0\" . ?e <area> ?pv . ?pv <pred:value> \"15.661\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Summit 21457 and its area 15.661?",
        "sparql": "ASK { ?e <pred:name> \"Summit\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"15.661\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"21457.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one whose inception is 1960-01-01) and Ivory Coast (the one whose Dewey Decimal Classification is 2--6668)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6668\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Harry Potter and the Goblet of Fire (published on 2000-07-08) and Harry Potter and the Goblet of Fire (with a duration of 151.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_1 <publication date> ?pv . ?pv <pred:date> \"2000-07-08\"^^xsd:date . ?e_2 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <duration> ?pv_1 . ?pv_1 <pred:value> \"151.0\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Max Weber (the one born on 1864-04-21) and Max Weber senior (the one with name in native language)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Max Weber\" . ?e_1 <date of birth> ?pv . ?pv <pred:date> \"1864-04-21\"^^xsd:date . ?e_2 <pred:name> \"Max Weber\" . ?e_2 <name in native language> ?pv_1 . ?pv_1 <pred:value> \"Max Weber senior\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between John Adams (the one whose end time is 2008-04-20) and John Adams (the one with Biografisch Portaal number 57767253)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Adams\" . ?e_1 <end time> ?pv . ?pv <pred:date> \"2008-04-20\"^^xsd:date . ?e_2 <pred:name> \"John Adams\" . ?e_2 <Biografisch Portaal number> ?pv_1 . ?pv_1 <pred:value> \"57767253\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon (the one with a Human Development Index of 0.436) and Cameroon (the one with a Human Development Index of 0.486)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.486\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who said \"I love you, too\" as their last words to George W. Bush and had 6 children?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <number of children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.0\"^^xsd:double . ?e <last words> ?pv . ?pv <pred:value> \"I love you, too.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <last words> ; <pred:fact_t> ?pv ] <addressee> ?qpv . ?qpv <pred:value> \"George W. Bush\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "During which period did the state of the United States with a population of 3.26674e+06 and the nickname \"The Yellowhammer State\" start using that nickname?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.26674e+06\"^^xsd:double . ?e <nickname> ?pv . ?pv <pred:value> \"The Yellowhammer State\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nickname> ; <pred:fact_t> ?pv ] <start period> ?qpv . ?qpv <pred:value> \"American Civil War\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the sovereign state with an official name of \uc870\uc120\ubbfc\uc8fc\uc8fc\uc758\uc778\ubbfc\uacf5\ud654\uad6d (the language of this statement is not specified) and a Gini coefficient of 31.0 (unit is 1) also known as Chos\u014fn Minjuju\u016di Inmin Konghwaguk (in McCune-Reischauer romanization)?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Gini coefficient> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"31.0\"^^xsd:double . ?e <official name> ?pv . ?pv <pred:value> \"\uc870\uc120\ubbfc\uc8fc\uc8fc\uc758\uc778\ubbfc\uacf5\ud654\uad6d\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv ] <McCune-Reischauer romanization> ?qpv . ?qpv <pred:value> \"Chos\u014fn Minjuju\u016di Inmin Konghwaguk\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the agent with an official website of https://www.vodafone.co.uk/ (which applies to the jurisdiction of United Kingdom) have 1 employee with a value of 107667.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107667.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"https://www.vodafone.co.uk/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <applies to jurisdiction> ?qpv . ?qpv <pred:value> \"United Kingdom\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Bharatiya Janata Party have a member count of 1.1e+08?",
        "sparql": "ASK { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <member count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Harry Potter and the Goblet of Fire have a box office revenue of 8.96911e+08?",
        "sparql": "ASK { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Liberia have a Human Development Index of 0.424?",
        "sparql": "ASK { ?e <pred:name> \"Liberia\" . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.424\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Ipswich have a population of 163,000?",
        "sparql": "ASK { ?e <pred:name> \"Ipswich\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"163000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Fred Astaire have 2 children?",
        "sparql": "ASK { ?e <pred:name> \"Fred Astaire\" . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Butler University have a student count of 4512?",
        "sparql": "ASK { ?e <pred:name> \"Butler University\" . ?e <students count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4512.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does California College of the Arts have 500 employees?",
        "sparql": "ASK { ?e <pred:name> \"California College of the Arts\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the California State Assembly have 80 seats?",
        "sparql": "ASK { ?e <pred:name> \"California State Assembly\" . ?e <number of seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Somerset have 1710.0 episodes?",
        "sparql": "ASK { ?e <pred:name> \"Somerset\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1710.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Target Corporation have an Alexa rank of 380.0 (unit: 1)?",
        "sparql": "ASK { ?e <pred:name> \"Target Corporation\" . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"380.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Gujarat have a female population of 2.89484e+07?",
        "sparql": "ASK { ?e <pred:name> \"Gujarat\" . ?e <female population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.89484e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Has PlayStation 3 sold 87 million units?",
        "sparql": "ASK { ?e <pred:name> \"PlayStation 3\" . ?e <units sold> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.7e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Limburg have an annual number of weddings equal to 3568.0?",
        "sparql": "ASK { ?e <pred:name> \"Limburg\" . ?e <annual number of weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3568.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Carlisle have 50429 households?",
        "sparql": "ASK { ?e <pred:name> \"Carlisle\" . ?e <number of households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50429.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Mars have a flattening of 0.00589?",
        "sparql": "ASK { ?e <pred:name> \"Mars\" . ?e <flattening> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.00589\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did cholera cause 143,000 deaths?",
        "sparql": "ASK { ?e <pred:name> \"cholera\" . ?e <number of deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"143000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does malaria have 881730 cases?",
        "sparql": "ASK { ?e <pred:name> \"malaria\" . ?e <number of cases> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"881730.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]