[{"question": "What is the Twitter username of Parlophone?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Parlophone\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"Parlophone\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Parlophone\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Baden-Baden and what is its official name?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Baden-Baden\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4346432\" . ?e <official_name> ?pv . ?pv <pred:value> \"Baden-Baden\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of the entity with ISNI 0000 0004 0423 7726 and name Madison?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Madison\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0423 7726\" . ?e <native_label> ?pv . ?pv <pred:value> \"Madison\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Aladdin?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Aladdin\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Aladdin\" . ?e <title> ?pv . ?pv <pred:value> \"Aladdin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the demonym for a Caribbean person from the Caribbean?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Caribbean\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Caribbean person\" . ?e <demonym> ?pv . ?pv <pred:value> \"Caribbean\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Independence?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Independence\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Independence\" . ?e <title> ?pv . ?pv <pred:value> \"Independence\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Marburg and what is its official name?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Marburg\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--434143\" . ?e <official_name> ?pv . ?pv <pred:value> \"Marburg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the movie titled Moon (the one whose official website is http://www.moon-movie.com/)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Moon\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.moon-movie.com/\" . ?e <title> ?pv . ?pv <pred:value> \"Moon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language is used in the subreddit for Iceland (the one with the CIVICUS_Monitor_country_entry value of iceland)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Iceland\" . ?e <CIVICUS_Monitor_country_entry> ?pv_1 . ?pv_1 <pred:value> \"iceland\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Iceland\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website for the movie Salt?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Salt\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sonypictures.com/homevideo/salt/\" . ?e <title> ?pv . ?pv <pred:value> \"Salt\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie \"Antichrist\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Antichrist\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Antichrist\" . ?e <title> ?pv . ?pv <pred:value> \"Antichrist\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dictionary of Medieval Names from European Sources entry for the name Christian?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Christian\" . ?e <Dictionary_of_Medieval_Names_from_European_Sources_entry> ?pv_1 . ?pv_1 <pred:value> \"Christian\" . ?e <native_label> ?pv . ?pv <pred:value> \"Christian\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Hoffa\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hoffa\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hoffa\" . ?e <title> ?pv . ?pv <pred:value> \"Hoffa\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Zaragoza and what is its native label?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Zaragoza\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--46553\" . ?e <native_label> ?pv . ?pv <pred:value> \"Zaragoza\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the PhilPapers topic that is related to bisexuality and has a subreddit value of \"bisexual\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"bisexuality\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"bisexual\" . ?e <PhilPapers_topic> ?pv . ?pv <pred:value> \"bisexuality\" . [ <pred:fact_h> ?e ; <pred:fact_r> <PhilPapers_topic> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of the town with a postal code of 20811 and a name of Bethesda?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bethesda\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"20811\" . ?e <official_name> ?pv . ?pv <pred:value> \"Bethesda\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Twitter account \"Toulouse\" have, and what is the Dewey Decimal Classification of Toulouse?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Toulouse\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--447367\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Toulouse\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the DiseasesDB code for alcoholism (the one with Iconclass notation 31B531)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"alcoholism\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"31B531\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"alcoholism\" . [ <pred:fact_h> ?e ; <pred:fact_r> <DiseasesDB> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Trabzonspor have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Trabzonspor\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"Trabzonspor\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Trabzonspor\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Rocky?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Rocky\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Rocky\" . ?e <title> ?pv . ?pv <pred:value> \"Rocky\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of the town with a TOID of 4000000074543263 and a name of Salisbury?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Salisbury\" . ?e <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074543263\" . ?e <official_name> ?pv . ?pv <pred:value> \"Salisbury\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Nelson\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nelson\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Nelson\" . ?e <title> ?pv . ?pv <pred:value> \"Nelson\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Napoleon?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Napoleon\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Napoleon\" . ?e <title> ?pv . ?pv <pred:value> \"Napoleon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website for the movie Hancock?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Hancock\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sonypictures.com/movies/hancock/\" . ?e <title> ?pv . ?pv <pred:value> \"Hancock\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Fontana?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Fontana\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Fontana\" . ?e <official_name> ?pv . ?pv <pred:value> \"Fontana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label and official name of Lucca?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lucca\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Lucca\" . ?e <official_name> ?pv . ?pv <pred:value> \"Lucca\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Battleground\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Battleground\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Battleground\" . ?e <title> ?pv . ?pv <pred:value> \"Battleground\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Solihull?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Solihull\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Solihull\" . ?e <official_name> ?pv . ?pv <pred:value> \"Solihull\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Vilnius stop being the official name of Vilnius (the one with Dewey Decimal Classification 2--4793)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Vilnius\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4793\" . ?e <official_name> ?pv . ?pv <pred:value> \"Vilnius\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the film with the official website http://www.otnemem.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Memento\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.otnemem.com\" . ?e <title> ?pv . ?pv <pred:value> \"Memento\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Stuttgart and what is its Twitter hashtag?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Stuttgart\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--434715\" . ?e <Twitter_hashtag> ?pv . ?pv <pred:value> \"Stuttgart\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_hashtag> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Americana\" published on 1983-01-01?", "sparql": "ASK { ?e <pred:name> \"Americana\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Americana\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie Aliens and its publication date 1986-07-18?", "sparql": "ASK { ?e <pred:name> \"Aliens\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1986-07-18\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Aliens\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Prince's pseudonym \"Prince\" and his date of birth 1958-06-07?", "sparql": "ASK { ?e <pred:name> \"Prince\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1958-06-07\"^^xsd:date . ?e <pseudonym> ?pv . ?pv <pred:value> \"Prince\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Apache\" published on 1954-01-01?", "sparql": "ASK { ?e <pred:name> \"Apache\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1954-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Apache\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the movie \"Rango\" and its publication date 2011-03-01?", "sparql": "ASK { ?e <pred:name> \"Rango\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-03-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Rango\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Oregon have a subreddit with the value \"Oregon\" and an inception date of 1859-02-14?", "sparql": "ASK { ?e <pred:name> \"Oregon\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1859-02-14\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Oregon\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Botswana\" related to the country Botswana (which was established on 1966-01-01)?", "sparql": "ASK { ?e <pred:name> \"Botswana\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Botswana\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the publication Hairspray and was it published on 1988-01-01?", "sparql": "ASK { ?e <pred:name> \"Hairspray\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1988-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Hairspray\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book titled \"Salvador\" published on January 1, 2006 in Salvador?", "sparql": "ASK { ?e <pred:name> \"Salvador\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Salvador\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Dnipro \"Dnipro\" and was it established on January 1, 1776?", "sparql": "ASK { ?e <pred:name> \"Dnipro\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1776-01-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Dnipro\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Massachusetts\" related to the state of Massachusetts (which was established on 1788-02-06)?", "sparql": "ASK { ?e <pred:name> \"Massachusetts\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-02-06\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Massachusetts\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Taiwan's demonym \"Taiwan\" and its inception date 1912-01-01?", "sparql": "ASK { ?e <pred:name> \"Taiwan\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-01-01\"^^xsd:date . ?e <demonym> ?pv . ?pv <pred:value> \"Taiwan\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Alexander\" published on 2005-01-14?", "sparql": "ASK { ?e <pred:name> \"Alexander\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-01-14\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Alexander\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Election\" published on 1999-04-23?", "sparql": "ASK { ?e <pred:name> \"Election\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1999-04-23\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Election\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Frankenstein\" published on January 1, 1992?", "sparql": "ASK { ?e <pred:name> \"Frankenstein\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1992-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Frankenstein\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Chuck\" published on 2016-09-02?", "sparql": "ASK { ?e <pred:name> \"Chuck\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2016-09-02\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Chuck\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book titled \"North\" published on January 1, 1994?", "sparql": "ASK { ?e <pred:name> \"North\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1994-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"North\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title \"Shackleton\" published on 2002-01-01?", "sparql": "ASK { ?e <pred:name> \"Shackleton\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2002-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Shackleton\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of the publication \"Bernie\" with a publication date of 2011-06-16?", "sparql": "ASK { ?e <pred:name> \"Bernie\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-06-16\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Bernie\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the publication date of the book \"Heartbeats\" equal to 2017-08-10?", "sparql": "ASK { ?e <pred:name> \"Heartbeats\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2017-08-10\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Heartbeats\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Egypt\" related to the country Egypt (which was established on 1953-06-18)?", "sparql": "ASK { ?e <pred:name> \"Egypt\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1953-06-18\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Egypt\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Usher's name in native language also Usher and was he born on October 14, 1978?", "sparql": "ASK { ?e <pred:name> \"Usher\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1978-10-14\"^^xsd:date . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Usher\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Odisha\" related to the state Odisha, which was established on 1950-01-26?", "sparql": "ASK { ?e <pred:name> \"Odisha\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1950-01-26\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Odisha\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Kajol's name in native language \"Kajol\" and was she born on 1975-08-05?", "sparql": "ASK { ?e <pred:name> \"Kajol\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1975-08-05\"^^xsd:date . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Kajol\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Gironde equal to \"Gironde\" and was it established on 1790-03-04?", "sparql": "ASK { ?e <pred:name> \"Gironde\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-03-04\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Gironde\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Florida\" related to the state of Florida (which was established on 1845-03-03)?", "sparql": "ASK { ?e <pred:name> \"Florida\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1845-03-03\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Florida\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the subreddit \"Oaxaca\" related to the city of Oaxaca, which was established on January 1, 1824?", "sparql": "ASK { ?e <pred:name> \"Oaxaca\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Oaxaca\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a subreddit for breakbeat music that was created on January 1, 1988?", "sparql": "ASK { ?e <pred:name> \"breakbeat\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1988-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"breakbeat\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Nas's pseudonym also Nas?", "sparql": "ASK { ?e <pred:name> \"Nas\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1973-09-14\"^^xsd:date . ?e <pseudonym> ?pv . ?pv <pred:value> \"Nas\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Mississippi\" published on January 1, 1935 in Mississippi?", "sparql": "ASK { ?e <pred:name> \"Mississippi\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1935-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Mississippi\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the title \"Lisbon\" published on 1956-01-01 in Lisbon?", "sparql": "ASK { ?e <pred:name> \"Lisbon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1956-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Lisbon\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Alien\" published on May 25, 1979?", "sparql": "ASK { ?e <pred:name> \"Alien\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1979-05-25\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Alien\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a subreddit named \"Niger\" that was created on 1960-01-01 and is related to the country Niger?", "sparql": "ASK { ?e <pred:name> \"Niger\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Niger\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Cher's name in native language \"Cher\" and was she born on May 20, 1946?", "sparql": "ASK { ?e <pred:name> \"Cher\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1946-05-20\"^^xsd:date . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Cher\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a subreddit named \"Xinjiang\" that was created on October 1, 1955?", "sparql": "ASK { ?e <pred:name> \"Xinjiang\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1955-10-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Xinjiang\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the performance titled \"Meridian\" take place in Meridian on November 14, 1994?", "sparql": "ASK { ?e <pred:name> \"Meridian\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1994-11-14\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Meridian\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Futurama end on August 10, 2013?", "sparql": "ASK { ?e <pred:name> \"Futurama\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2013-08-10\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Futurama\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Madagascar\" published on September 2, 2005?", "sparql": "ASK { ?e <pred:name> \"Madagascar\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-09-02\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Madagascar\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]