[{"question": "Is the genre with an official website of http://harvardlampoon.com/ established on January 1, 1876?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://harvardlampoon.com/\" . ?e <inception> ?pv . ?pv <pred:date> \"1876-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the musical with the official website http://aladdinthemusical.com have its first performance on 2011-07-07?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://aladdinthemusical.com\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"2011-07-07\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the single with ISWC T-070.942.427-0 published on 1998-11-24?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-070.942.427-0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-11-24\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the road with a length of 2451.0 end on 1985-06-27?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <length> ?pv_1 . ?pv_1 <pred:value> \"2451.0\" . ?e <end_time> ?pv . ?pv <pred:date> \"1985-06-27\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the writer with ISNI 0000 0001 0873 3741 born on August 18, 1934?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the school with an ARCHON code of 1143 established on January 1, 1611?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"1143\" . ?e <inception> ?pv . ?pv <pred:date> \"1611-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the religion with ISNI 0000 0004 0508 6616 start on January 1, 1957?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was \"The Crucible\" first performed on January 22, 1953?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Crucible\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1953-01-22\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the industry with the nickname \"Longhorn\" established on January 30, 2007?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Longhorn\" . ?e <inception> ?pv . ?pv <pred:date> \"2007-01-30\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the award with ISNI 0000 0004 0644 5609 established on January 1, 1983?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0644 5609\" . ?e <inception> ?pv . ?pv <pred:date> \"1983-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the museum with an ARCHON code of 345 established on January 1, 1824?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the post-hardcore genre, which has a subreddit called Emo, originate on January 1, 1987?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" . ?e <inception> ?pv . ?pv <pred:date> \"1987-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the currency with the HTML entity \"&euro;\" introduced on January 1, 1999?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <HTML_entity> ?pv_1 . ?pv_1 <pred:value> \"&euro;\" . ?e <inception> ?pv . ?pv <pred:date> \"1999-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the conservatory with ISNI 0000 0001 2189 390X established on January 1, 1921?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2189 390X\" . ?e <inception> ?pv . ?pv <pred:date> \"1921-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the association with an ARCHON code of 397 established on January 1, 1768?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"397\" . ?e <inception> ?pv . ?pv <pred:date> \"1768-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the news with Instagram username \"todayshow\" have its first performance on January 14, 1952?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1952-01-14\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the city with an area of 187.7 and an inception date of 1850-01-01 a city?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"187.7\" . ?e <inception> ?pv . ?pv <pred:date> \"1850-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the position with an Instagram username of \"vp\" established on April 21, 1789?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"vp\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-21\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was music with IAB code 368 established on January 1, 1975?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"368\" . ?e <inception> ?pv . ?pv <pred:date> \"1975-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the software with the nickname \"Longhorn\" created on January 30, 2007?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Longhorn\" . ?e <inception> ?pv . ?pv <pred:date> \"2007-01-30\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the Prime Minister a minister whose inception date is 1867-07-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Prime Minister\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the university with an ARCHON code of 1187 established on September 29, 1963?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"1187\" . ?e <inception> ?pv . ?pv <pred:date> \"1963-09-29\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the entertainment with the official website http://www.nintendo.co.jp/wii/rwsj/index.html published on 2007-11-06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.nintendo.co.jp/wii/rwsj/index.html\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-11-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the landform with FIPS 10-4 code GQ formed on January 1, 1898?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"GQ\" . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the profession \"United States Secretary of State\" established on 1789-04-06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"United States Secretary of State\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the foundation with ACM Classification Code (2012) 10011263 established on June 1, 1999?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10011263\" . ?e <inception> ?pv . ?pv <pred:date> \"1999-06-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the Byzantine Empire dissolved on January 1, 1453?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:historic:civilization=byzantine\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1453-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the campus with ISNI 0000 0001 2150 6738 established on January 1, 1893?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2150 6738\" . ?e <inception> ?pv . ?pv <pred:date> \"1893-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the facility with an ARCHON code of 345 established on January 1, 1824?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manifestation with 107.0 constituencies that was established on July 1, 1867?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <number_of_constituencies> ?pv_1 . ?pv_1 <pred:value> \"107.0\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the band with ISNI 0000 0001 1089 9660 start on January 1, 1969?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1089 9660\" . ?e <inception> ?pv . ?pv <pred:date> \"1969-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the airline with Corporate Number (Japan) 3700150005378 start operating on 1926-04-06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <Corporate_Number_(Japan)> ?pv_1 . ?pv_1 <pred:value> \"3700150005378\" . ?e <work_period_(start)> ?pv . ?pv <pred:date> \"1926-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Speaker of the United States House of Representatives a speaker whose inception date is 1789-04-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did disco music with the subreddit \"italodisco\" start on January 1, 1978?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . ?e <inception> ?pv . ?pv <pred:date> \"1978-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Hook\" published on 1992-03-26 in Germany?", "sparql": "ASK { ?e <pred:name> \"Hook\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1992-03-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Heartbeats\" published on 2017-08-10 in Germany?", "sparql": "ASK { ?e <pred:name> \"Heartbeats\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2017-08-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Spartacus published on 1960-10-08 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Spartacus\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1960-10-08\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Mulan published on 2020-03-26 in Germany?", "sparql": "ASK { ?e <pred:name> \"Mulan\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2020-03-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Gigli published on 2003-10-30 in Germany?", "sparql": "ASK { ?e <pred:name> \"Gigli\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2003-10-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Australia published in Sweden on 2008-12-25?", "sparql": "ASK { ?e <pred:name> \"Australia\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-12-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Sweden\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Coronado published in Germany on April 22, 2004?", "sparql": "ASK { ?e <pred:name> \"Coronado\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2004-04-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Western\" published on 2017-08-24 in Germany?", "sparql": "ASK { ?e <pred:name> \"Western\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2017-08-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Manhattan published on 1979-08-30 in Germany?", "sparql": "ASK { ?e <pred:name> \"Manhattan\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1979-08-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Metropolis published on 2002-10-31 in Germany?", "sparql": "ASK { ?e <pred:name> \"Metropolis\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2002-10-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Zodiac published on 2007-05-31 in Germany?", "sparql": "ASK { ?e <pred:name> \"Zodiac\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-05-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Bridesmaids published on 2011-07-21 in Germany?", "sparql": "ASK { ?e <pred:name> \"Bridesmaids\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-07-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Bird\" published on 1988-09-15 in Germany?", "sparql": "ASK { ?e <pred:name> \"Bird\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1988-09-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Amelia published on 2010-06-17 in Germany?", "sparql": "ASK { ?e <pred:name> \"Amelia\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-06-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book named \"Wilson\" published on 2017-06-29 in Germany?", "sparql": "ASK { ?e <pred:name> \"Wilson\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2017-06-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Genesis published on 2004-10-14 in Germany?", "sparql": "ASK { ?e <pred:name> \"Genesis\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2004-10-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Anaconda published in the United Kingdom on May 9, 1997?", "sparql": "ASK { ?e <pred:name> \"Anaconda\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1997-05-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United Kingdom\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Inkheart published on 2009-03-19 in Hungary?", "sparql": "ASK { ?e <pred:name> \"Inkheart\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-03-19\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Hungary\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Munich published in Germany on January 26, 2006?", "sparql": "ASK { ?e <pred:name> \"Munich\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-01-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Domino\" published on 2005-12-29 in Germany?", "sparql": "ASK { ?e <pred:name> \"Domino\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-12-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Scoop\" published on 2006-11-16 in Germany?", "sparql": "ASK { ?e <pred:name> \"Scoop\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-11-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Porto published in Germany on 2017-09-14?", "sparql": "ASK { ?e <pred:name> \"Porto\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2017-09-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Syriana\" published on 2006-02-23 in Germany?", "sparql": "ASK { ?e <pred:name> \"Syriana\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-02-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Aliens published on 1986-07-18 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Aliens\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1986-07-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Wanted\" published on 2008-09-04 in Germany?", "sparql": "ASK { ?e <pred:name> \"Wanted\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-09-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the euro, which was introduced on 1999-01-01, apply to demand deposits?", "sparql": "ASK { ?e <pred:name> \"euro\" . ?e <inception> ?pv . ?pv <pred:date> \"1999-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv . ?qpv <pred:value> \"demand deposit\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Alfie\" published on 2005-03-10 in Germany?", "sparql": "ASK { ?e <pred:name> \"Alfie\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-03-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Frankenweenie published in the United States of America on December 14, 1984?", "sparql": "ASK { ?e <pred:name> \"Frankenweenie\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1984-12-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Precious\" published on November 9, 1994 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Precious\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1994-11-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Seven published on 1995-11-23 in Germany?", "sparql": "ASK { ?e <pred:name> \"Seven\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1995-11-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Hannibal published on 2001-02-15 in Germany?", "sparql": "ASK { ?e <pred:name> \"Hannibal\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-02-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Fame\" published on 2009-12-10 in Hungary?", "sparql": "ASK { ?e <pred:name> \"Fame\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-12-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Hungary\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Patton\" published on 1970-04-02 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Patton\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1970-04-02\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Water\" published on 2006-09-07 in Germany?", "sparql": "ASK { ?e <pred:name> \"Water\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-09-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]