[{"question": "What is the connection between Botswana (the one with Dewey Decimal Classification 2--6883) and Botswana (the one with Human Development Index 0.561)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Botswana\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6883\" . ?e_2 <pred:name> \"Botswana\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.561\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Kiribati (the one with FIPS 10-4 code KR) and Kiribati (the one with a Human Development Index of 0.589)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kiribati\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"KR\" . ?e_2 <pred:name> \"Kiribati\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.589\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Jersey (the one with FIPS 10-4 code JE) and Jersey (the one with a population of 104200.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jersey\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"JE\" . ?e_2 <pred:name> \"Jersey\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"104200.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Wakefield (the one with Dewey Decimal Classification 2--42815) and Wakefield (the one with a population of 333800.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Wakefield\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--42815\" . ?e_2 <pred:name> \"Wakefield\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"333800.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Brno (the one with Dewey Decimal Classification 2--43724) and Brno (the one with a population of 376172.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brno\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--43724\" . ?e_2 <pred:name> \"Brno\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"376172.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Andorra (the one with Dewey Decimal Classification 2--4679) and Andorra (the one with Human Development Index 0.819)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Andorra\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4679\" . ?e_2 <pred:name> \"Andorra\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.819\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Myanmar (the one with Dewey Decimal Classification 2--591) and Myanmar (the one with Human Development Index 0.478)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Myanmar\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--591\" . ?e_2 <pred:name> \"Myanmar\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.478\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Scarlett (the one with a native label of Scarlett) and Scarlett (the one with one season and a value of 1.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Scarlett\" . ?e_1 <native_label> ?pv . ?pv <pred:value> \"Scarlett\" . ?e_2 <pred:name> \"Scarlett\" . ?e_2 <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Walsall (with an OS grid reference of SP0198) and Walsall (with a population of 276100.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Walsall\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"SP0198\" . ?e_2 <pred:name> \"Walsall\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"276100.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How is Tyrol, whose licence plate code is BZ and population is 739002.0, related to Tyrol?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tyrol\" . ?e_1 <licence_plate_code> ?pv . ?pv <pred:value> \"BZ\" . ?e_2 <pred:name> \"Tyrol\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"739002.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Solihull (with an OS grid reference of SP1579) and Solihull (with a population of 210400.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Solihull\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"SP1579\" . ?e_2 <pred:name> \"Solihull\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"210400.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Poland (the one with Dewey Decimal Classification 2--438) and Poland (the one with a population of 3.25483e+07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Poland\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--438\" . ?e_2 <pred:name> \"Poland\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.25483e+07\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Sudan (the one with FIPS 10-4 code SU) and Sudan (the one with a total fertility rate of 4.873)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sudan\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"SU\" . ?e_2 <pred:name> \"Sudan\" . ?e_2 <total_fertility_rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.873\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Yugoslavia (with an IOC country code of YUG and a population of 1.07e+07) to Yugoslavia?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Yugoslavia\" . ?e_1 <IOC_country_code> ?pv . ?pv <pred:value> \"YUG\" . ?e_2 <pred:name> \"Yugoslavia\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.07e+07\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bournemouth (with GSS code (2011) E06000028) and Bournemouth (with a population of 183491.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bournemouth\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E06000028\" . ?e_2 <pred:name> \"Bournemouth\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"183491.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Devon (the one with GSS code (2011) E10000008) and Devon (the one with a population of 1.1357e+06)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Devon\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E10000008\" . ?e_2 <pred:name> \"Devon\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1357e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Dominica (the one with Dewey Decimal Classification 2--729841) and Dominica (the one with Human Development Index 0.723)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dominica\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--729841\" . ?e_2 <pred:name> \"Dominica\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.723\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Barrow-in-Furness (the one with an OS grid reference of SD198690) and Barrow-in-Furness (the one with a population of 67500.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Barrow-in-Furness\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"SD198690\" . ?e_2 <pred:name> \"Barrow-in-Furness\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"67500.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bremen (the one with Dewey Decimal Classification 2--4352) and Bremen (the one with a population of 546451.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bremen\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4352\" . ?e_2 <pred:name> \"Bremen\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"546451.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guinea (the one with Dewey Decimal Classification 2--6652) and Guinea (the one with Human Development Index 0.411)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guinea\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6652\" . ?e_2 <pred:name> \"Guinea\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.411\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Oldham (the one whose FIPS 10-4 code is UKK1) and Oldham (the one with a population of 96555.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oldham\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"UKK1\" . ?e_2 <pred:name> \"Oldham\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"96555.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Gabon (the one with Dewey Decimal Classification 2--6721) and Gabon (the one with Human Development Index 0.673)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gabon\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6721\" . ?e_2 <pred:name> \"Gabon\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.673\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Iraq (the one with Dewey Decimal Classification 2--567) and Iraq (the one with a population of 1.55764e+07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Iraq\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--567\" . ?e_2 <pred:name> \"Iraq\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.55764e+07\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Lesotho (the one with Dewey Decimal Classification 2--6885) and Lesotho (the one with Human Development Index 0.469)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lesotho\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6885\" . ?e_2 <pred:name> \"Lesotho\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.469\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Yemen (the one with a British Museum person-institution value of 162332) and Yemen (the one with a total fertility rate of 4.703)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Yemen\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"162332\" . ?e_2 <pred:name> \"Yemen\" . ?e_2 <total_fertility_rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.703\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Israel (the one with Dewey Decimal Classification 2--5694) and Israel (the one with 38286.0 out-of-school children)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Israel\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5694\" . ?e_2 <pred:name> \"Israel\" . ?e_2 <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"38286.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guinea-Bissau (the one with Dewey Decimal Classification 2--6657) and Guinea-Bissau (the one with Human Development Index 0.417)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guinea-Bissau\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6657\" . ?e_2 <pred:name> \"Guinea-Bissau\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.417\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Turkey (the one with Dewey Decimal Classification 2--561) and Turkey (the one with a population of 6.50223e+07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Turkey\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--561\" . ?e_2 <pred:name> \"Turkey\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.50223e+07\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Jordan (the one with Dewey Decimal Classification 2--5695) and Jordan (the one with a total fertility rate of 3.505)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jordan\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5695\" . ?e_2 <pred:name> \"Jordan\" . ?e_2 <total_fertility_rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.505\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Stirling (the one with FIPS 10-4 code UKW6) and Stirling (the one with a population of 45750.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stirling\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"UKW6\" . ?e_2 <pred:name> \"Stirling\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"45750.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Lebanon (the one with Dewey Decimal Classification 2--5692) and Lebanon (the one with Human Development Index 0.756)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lebanon\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5692\" . ?e_2 <pred:name> \"Lebanon\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.756\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Gambia (the one with a British Museum person-institution value of 123552) and Gambia (the one with a Human Development Index of 0.44)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gambia\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"123552\" . ?e_2 <pred:name> \"Gambia\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.44\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between England (the one with a demonym of anglais) and England (the one with a population of 5.75e+06)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"England\" . ?e_1 <demonym> ?pv . ?pv <pred:value> \"anglais\" . ?e_2 <pred:name> \"England\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.75e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Rotherham (with an OS grid reference of SK4392) and Rotherham (with a population of 260800.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rotherham\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"SK4392\" . ?e_2 <pred:name> \"Rotherham\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"260800.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guyana (the one with Dewey Decimal Classification 2--881) and Guyana (the one with a population of 693051.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guyana\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--881\" . ?e_2 <pred:name> \"Guyana\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"693051.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Fiji (the one with FIPS 10-4 code FJ) and Fiji (the one with a Human Development Index of 0.722)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fiji\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"FJ\" . ?e_2 <pred:name> \"Fiji\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.722\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Preston (the one with GSS code (2011) E07000123) and Preston (the one with a population of 141801.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Preston\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E07000123\" . ?e_2 <pred:name> \"Preston\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"141801.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mozambique (the one with a British Museum person-institution value of 179887) and Mozambique (the one with a Human Development Index of 0.218)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mozambique\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"179887\" . ?e_2 <pred:name> \"Mozambique\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.218\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Namibia (the one with a British Museum person-institution value of 182503) and Namibia (the one with a Human Development Index value of 0.578)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Namibia\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"182503\" . ?e_2 <pred:name> \"Namibia\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.578\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Antwerp (the one with Dewey Decimal Classification 2--49322) and Antwerp (the one with a population of 510610.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Antwerp\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--49322\" . ?e_2 <pred:name> \"Antwerp\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"510610.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Angel (the one with the name in native language Angel) and Angel (the one with 5.0 seasons)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Angel\" . ?e_1 <name_in_native_language> ?pv . ?pv <pred:value> \"Angel\" . ?e_2 <pred:name> \"Angel\" . ?e_2 <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Chad (the one with British Museum person-institution ID 185168) and Chad (the one with Human Development Index 0.338)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chad\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"185168\" . ?e_2 <pred:name> \"Chad\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.338\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Tuvalu (the one with FIPS 10-4 code TV) and Tuvalu (the one with 504.0 out-of-school children)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tuvalu\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"TV\" . ?e_2 <pred:name> \"Tuvalu\" . ?e_2 <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"504.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Miami (the one with a title of Miami) and Miami (the one with a population of 5471.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Miami\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Miami\" . ?e_2 <pred:name> \"Miami\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5471.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Serbia (the one with Dewey Decimal Classification 2--4971) and Serbia (the one with Human Development Index 0.771)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Serbia\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4971\" . ?e_2 <pred:name> \"Serbia\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.771\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Niger (the one with British Museum person-institution value of 185173) and Niger (the one with Human Development Index value of 0.342)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Niger\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"185173\" . ?e_2 <pred:name> \"Niger\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.342\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Hildesheim (the one with Dewey Decimal Classification 2--435958) and Hildesheim (the one with a population of 105439.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hildesheim\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--435958\" . ?e_2 <pred:name> \"Hildesheim\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"105439.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Senegal (the one with a British Museum person-institution value of 185171) and Senegal (the one with a population of 7.51411e+06)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Senegal\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"185171\" . ?e_2 <pred:name> \"Senegal\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"7.51411e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which dog breed has a subreddit called \"Yorkies\" with 2394 subscribers and a catalog code of 086?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2394.0\"^^xsd:double . ?e <catalog_code> ?pv_1 . ?pv_1 <pred:value> \"086\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which instance is related to vegetarianism and has a subreddit called \"vegan\" with 189,580 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"vegetarianism\" . ?e <subreddit> ?pv . ?pv <pred:value> \"vegan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"189580.0\"^^xsd:double . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"vegan\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which philosophy has a subreddit called Conservative with 133,265 subscribers and a Dewey Decimal Classification of 320.52?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Conservative\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"133265.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"320.52\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which superhero has a subreddit called \"batman\" with 194,291 subscribers and is associated with the British Museum person-institution with a value of 153,870?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <subreddit> ?pv . ?pv <pred:value> \"batman\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"194291.0\"^^xsd:double . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"153870\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which capital city has a Twitter username of PrahaEU, has 7776.0 subscribers, and has a NUTS code of CZ01?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"PrahaEU\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"7776.0\"^^xsd:double . ?e <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"CZ01\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]