[
    {
        "question": "Is there a city with an inception date of 1810-09-25 and a population of 2.39487e+06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.39487e+06\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1810-09-25\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a software whose Alexa rank is 1.0 and inception date is 1997-09-15?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1997-09-15\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the manifestation with one constituency, a value of 107.0 and an inception date of 1867-07-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <number of constituencies> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an association that was founded on 1768-01-01 and has an employee with a value of 80.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> association . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1768-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What facility has a total revenue of 5.73753e+08 on January 1st, 2017 and an NRHP reference number of 86003556?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <total revenue> ?pv . ?pv <pred:value> \"5.73753e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <total revenue> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2017-01-01\"^^xsd:date . ?e <NRHP reference number> ?pv_1 . ?pv_1 <pred:value> \"86003556\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was ranked 1.0 in the human category on 2008-08-18 and had a doubles record of 131-72?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <ranking> ?pv . ?pv <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2008-08-18\"^^xsd:date . ?e <doubles record> ?pv_1 . ?pv_1 <pred:value> \"13172\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the position of the person whose official website is https://www.whitehouse.gov/people/mike-pence/ and whose native label is Vice President of the United States, retrieved on 2018-07-25?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> position . ?e <official website> ?pv . ?pv <pred:value> \"https://www.whitehouse.gov/people/mike-pence/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <retrieved> ?qpv . ?qpv <pred:date> \"2018-07-25\"^^xsd:date . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"Vice President of the United States\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What museum had a total revenue of 5.73753e+08 on January 1st, 2017 and has an NRHP reference number of 86003556?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <total revenue> ?pv . ?pv <pred:value> \"5.73753e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <total revenue> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2017-01-01\"^^xsd:date . ?e <NRHP reference number> ?pv_1 . ?pv_1 <pred:value> \"86003556\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official website of the conservatory whose short name is \"- \" and started on 1991-09-24?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <short name> ?pv . ?pv <pred:value> \"- \" . [ <pred:fact_h> ?e ; <pred:fact_r> <short name> ; <pred:fact_t> ?pv ] <start time> ?qpv . ?qpv <pred:date> \"1991-09-24\"^^xsd:date . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.conservatory.ru/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which country has a NUTS code of UKM, a country calling code of +44, and had a start time of January 1st, 1999?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <NUTS code> ?pv . ?pv <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS code> ; <pred:fact_t> ?pv ] <start time> ?qpv . ?qpv <pred:date> \"1999-01-01\"^^xsd:date . ?e <country calling code> ?pv_1 . ?pv_1 <pred:value> \"+44\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What manifestation has an Alexa rank of 112.0 as of November 20, 2017 and has a Pinterest username of nytimes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <Alexa rank> ?pv . ?pv <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Pinterest username> ?pv_1 . ?pv_1 <pred:value> \"nytimes\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What neighborhood had a population of 217000 on January 1st, 2010 and an area of 6.91527e+06?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <population> ?pv . ?pv <pred:value> \"217000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"6.91527e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language with an ISO 639-2 code of \"pol\", 4.02e+07 speakers as of 2007-01-01, and is an instance of \"language\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <number of speakers> ?pv . ?pv <pred:value> \"4.02e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2007-01-01\"^^xsd:date . ?e <ISO 639-2 code> ?pv_1 . ?pv_1 <pred:value> \"pol\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the democracy with a licence plate code of LB, an INSEE countries and foreign territories code of 99302, and a start time of 1967-01-01?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <licence plate code> ?pv . ?pv <pred:value> \"LB\" . [ <pred:fact_h> ?e ; <pred:fact_r> <licence plate code> ; <pred:fact_t> ?pv ] <start time> ?qpv . ?qpv <pred:date> \"1967-01-01\"^^xsd:date . ?e <INSEE countries and foreign territories code> ?pv_1 . ?pv_1 <pred:value> \"99302\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the time period and unit of measurement for the number of deaths in the war with 7.3e+07 deaths?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:value> \"7.3e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"7.3e+07\"^^xsd:double . ?e <number of deaths> ?pv . ?pv <pred:value> \"7.3e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the facility with Twitter username \"metmuseum\" and Instagram username \"metmuseum\"?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"metmuseum\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"4.47312e+06\"^^xsd:double . ?e <Instagram username> ?pv . ?pv <pred:value> \"metmuseum\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Instagram username> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the nationality of a population of 6 million, and what is the fact about this population?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> nationality . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"6e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time when a state has a Human Development Index of 0.649?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.649\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"0.649\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.649\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the newscast with Twitter username \"TODAYshow\" and how many subscribers does it have?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> newscast . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"4.42966e+06\"^^xsd:double . ?e <Twitter username> ?pv . ?pv <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the subreddit Malaria and what is the value of the Twitter hashtag Malaria for the disease instance?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> disease . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Malaria\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"50.0\"^^xsd:double . ?e <Twitter hashtag> ?pv . ?pv <pred:value> \"Malaria\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter hashtag> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which neighborhood has a population of 800000.0 and has two facts with the same population value?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"800000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"800000.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"800000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the music instance with subreddit \"numetal\" and 3795.0 subscribers?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> music . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"numetal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"3795.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"numetal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the sea subreddit with 50.0 subscribers, named MediterraneanSea?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> sea . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"MediterraneanSea\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"50.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"MediterraneanSea\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISCO occupation code for a musician and what is the instance of this code?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> musician . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2453\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2453\" . ?e <pred:instance of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the field of occupation for a designer with an ISCO occupation code of 2141?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> designer . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2141\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2141\" . ?e <field of this occupation> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is the librettist for the musical with the official website http://aladdinthemusical.com?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> musical . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://aladdinthemusical.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"http://aladdinthemusical.com\" . ?e <librettist> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the date of the first performance of the opera that has only one part and the number of parts is 1.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> opera . ?e <number of parts of this work of art> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of parts of this work of art> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.0\" . ?e <date of first performance> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official name of the island with an ISO 3166-2 code of NZ-S and a fact t value of NZ-S?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <ISO 3166-2 code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"NZ-S\" . ?e <official name> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the division with the official name \"\" dissolved, abolished or demolished?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> division . ?e <official name> ?pv_1 . ?pv_1 <pred:value> \"\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"\" . ?e <dissolved, abolished or demolished> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Glottolog code for the language with the Ethnologue.com language code \"sin\"?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <Ethnologue.com language code> ?pv_1 . ?pv_1 <pred:value> \"sin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Ethnologue.com language code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"sin\" . ?e <Glottolog code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is the occupant of the palace with ISNI 0000 0001 2149 5119?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> palace . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2149 5119\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0000 0001 2149 5119\" . ?e <occupant> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the headquarters location of the seminary with ISNI 0000 0001 2184 9191?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> seminary . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2184 9191\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0000 0001 2184 9191\" . ?e <headquarters location> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the participant of the war with KulturNav-id f0a37482-3736-4dd0-b56c-c7d26fb32a95?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KulturNav-id> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . ?e <participant> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name in kana of the lawyer with ISCO occupation code 2421?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> lawyer . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2421\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2421\" . ?e <name in kana> ?pv_1 . ?pv_1 <pred:value> \"\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which literature has a Dewey Decimal Classification of 820 and a Universal Decimal Classification of 821.111?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> literature . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"820\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"820\" . ?e <Universal Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"821.111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which volleyball entity has an IAB code of 548 and an IPTC Newscode of \"mediatopic/20001090\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> volleyball . ?e <IAB code> ?pv . ?pv <pred:value> \"548\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"548\" . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20001090\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which critic has an ISCO occupation code of 2451 and another ISCO occupation code of 2451?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> critic . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2451\" . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2451\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the foundation that has an official website of https://www.apache.org and has an ACM Classification Code (2012) of 10011263?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> foundation . ?e <official website> ?pv . ?pv <pred:value> \"https://www.apache.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"https://www.apache.org\" . ?e <ACM Classification Code (2012)> ?pv_1 . ?pv_1 <pred:value> \"10011263\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What war has the KulturNav-id of f0a37482-3736-4dd0-b56c-c7d26fb32a95?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <KulturNav-id> ?pv . ?pv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KulturNav-id> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]