[{"question": "What work is Frankenstein based on?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Frankenstein\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Frankenstein\" . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPv4 routing prefix for AOL (the one with a Twitter username of AOL)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"AOL\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"AOL\" . ?e <IPv4_routing_prefix> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Surrey (the one with a native label of Surrey)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Surrey\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Surrey\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the EPPO Code for the taxon named Cichlidae?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cichlidae\" . ?e <taxon_name> ?pv_1 . ?pv_1 <pred:value> \"Cichlidae\" . ?e <EPPO_Code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ACM Classification Code (2012) for eBay (the one with a Twitter username of eBay)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"eBay\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"eBay\" . ?e <ACM_Classification_Code_(2012)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Grenoble (the one with an official name of Grenoble)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Grenoble\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Grenoble\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of the movie titled \"Vertigo\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vertigo\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Vertigo\" . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Togo (the one with subreddit Togo)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Togo\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Togo\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member in the movie Enid?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Enid\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Enid\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Scotland?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Scotland\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Scotland\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Saskatchewan (the one with a native label of Saskatchewan)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Saskatchewan\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Saskatchewan\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Manchester (the one with a native label of Manchester)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Manchester\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Manchester\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username of the entity named Dallas?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dallas\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Dallas\" . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Assassins\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Assassins\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Assassins\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Nice (the one with a native label of Nice)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nice\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Nice\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the show Eureka?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Eureka\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Eureka\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Snatch\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Snatch\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Snatch\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Oakland (the one with a native label of Oakland)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Oakland\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Oakland\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Good\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Good\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Good\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for the subreddit related to snowboarding?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"snowboarding\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"snowboarding\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Becket receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Becket\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Becket\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie Sleepers?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sleepers\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Sleepers\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Mainz?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mainz\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Mainz\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Sunderland?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sunderland\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Sunderland\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the TV show Cheers?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cheers\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Cheers\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Wilmington (the one with a native label of Wilmington)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wilmington\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Wilmington\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Frida receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Frida\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Frida\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are some famous people in the electro subreddit?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"electro\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"electro\" . ?e <famous_people> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of the movie Titanic?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Titanic\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Titanic\" . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What work is Goldfinger named after?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Goldfinger\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Goldfinger\" . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What awards did the movie Yentl receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Yentl\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Yentl\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the band Styx?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Styx\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Styx\" . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Baltimore (the one with an official name of Baltimore)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Baltimore\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Baltimore\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Caverphone code for the name \"Gary\" (the one with a native label of \"Gary\")?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gary\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Gary\" . ?e <Caverphone> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Toledo (the one with a native label of Toledo)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Toledo\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Toledo\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the GitHub username of NPR (the one with subreddit \"NPR\")?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"NPR\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"NPR\" . ?e <GitHub_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Caverphone code for Lynn (the one whose native label is also Lynn)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lynn\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Lynn\" . ?e <Caverphone> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member in the movie \"Marley\" and also has the title \"Marley\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Marley\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Marley\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Lincoln (the one with an official name of Lincoln)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lincoln\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Lincoln\" . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the band Oasis?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Oasis\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Oasis\" . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie \"Dredd\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dredd\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Dredd\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the director/manager of EuropaCorp (the one with a Twitter username of EuropaCorp)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"EuropaCorp\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"EuropaCorp\" . ?e <director/manager> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Lausanne?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lausanne\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Lausanne\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"Striptease\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Striptease\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Striptease\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Hellboy based on?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hellboy\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hellboy\" . ?e <based_on> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Zagreb (the one with a native label of Zagreb)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Zagreb\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Zagreb\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many representatives does Catalonia have in an organization or legislature?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Catalonia\" . ?e <Twitter_hashtag> ?pv_1 . ?pv_1 <pred:value> \"Catalonia\" . ?e <number_of_representatives_in_an_organization/legislature> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the entity named Hamilton (the one with subreddit Hamilton)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hamilton\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Hamilton\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE for Verona?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Verona\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Verona\" . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ATC code for riboflavin?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"riboflavin\" . ?e <World_Health_Organisation_International_Nonproprietary_Name> ?pv_1 . ?pv_1 <pred:value> \"riboflavin\" . ?e <ATC_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Pasadena?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Pasadena\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Pasadena\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Twilight\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Twilight\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Twilight\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Fiji?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fiji\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"Fiji\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username of Seal (the one with the pseudonym Seal)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Seal\" . ?e <pseudonym> ?pv_1 . ?pv_1 <pred:value> \"Seal\" . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie xXx?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"xXx\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"xXx\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Sarajevo?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sarajevo\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Sarajevo\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Washington (the one with subreddit \"Washington\")?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Washington\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Washington\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Belfast?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Belfast\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Belfast\" . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Marseille?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Marseille\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Marseille\" . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie \"Hook\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hook\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hook\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Gigli\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gigli\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Gigli\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Chrysler (the one with a Twitter username of Chrysler)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chrysler\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"Chrysler\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Freetown (the one with an official name of Freetown)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Freetown\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Freetown\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Virginia (the one with subreddit Virginia)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Virginia\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Virginia\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Nintendo GameID for TMNT (the one with the title TMNT)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"TMNT\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"TMNT\" . ?e <Nintendo_GameID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office of the movie titled Flight?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Flight\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Flight\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie Topsy-Turvy receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Topsy-Turvy\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Topsy-Turvy\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Usher's Giphy username?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Usher\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Usher\" . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Nickelodeon?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nickelodeon\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Nickelodeon\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member in the movie Amelia and also has the title Amelia?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Amelia\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Amelia\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Buckethead (the one whose name in native language is also Buckethead)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Buckethead\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Buckethead\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What color is the title of the band Kiss?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kiss\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Kiss\" . ?e <color> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"Nine\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nine\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Nine\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What awards did the movie Moonstruck receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Moonstruck\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Moonstruck\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"Battleground\" receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Battleground\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Battleground\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie Babel receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Babel\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Babel\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie Hairspray?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hairspray\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hairspray\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Montpelier?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Montpelier\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Montpelier\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Massachusetts (the one with subreddit Massachusetts)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Massachusetts\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Massachusetts\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Valencia (the one with an official name of Valencia)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Valencia\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Valencia\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Avignon (the one with a native label of Avignon)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Avignon\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Avignon\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of the movie Alien?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Alien\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Alien\" . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Savages\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Savages\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Savages\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]