[{"question": "Which politician has a short name of IND?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <short_name> ?pv . ?pv <pred:value> \"IND\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the Stack Exchange tag \"https://engineering.stackexchange.com/tags/industrial-engineering\" in the field of engineering?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"engineering\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://engineering.stackexchange.com/tags/industrial-engineering\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which medal has an official website of http://www.ras.org.uk/awards-and-grants/awards?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which concept has an IAB code of 212 and is related to vegetarianism?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"vegetarianism\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"212\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a DiseasesDB ID of 11890 and is classified as psychosis?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"psychosis\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"11890\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which object has a Hornbostel-Sachs classification of 511 and is a piano?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"piano\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"511\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which literature has a Dewey Decimal Classification of 820?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"literature\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"820\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which activity has the Stack Exchange tag \"https://stackoverflow.com/tags/project-management\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/project-management\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which agent has an IPTC Newscode of mediatopic/20000536?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000536\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which school has a Hornbostel-Sachs classification of 211.212.1?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"211.212.1\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which sorority has an official website of http://www.tridelta.org?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sorority\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tridelta.org\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which person is a lawyer with an ISCO occupation code of 2421?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"lawyer\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2421\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which war has a KulturNav-id of f0a37482-3736-4dd0-b56c-c7d26fb32a95?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <KulturNav-id> ?pv . ?pv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which method has an IPTC Newscode of \"mediatopic/20000037\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"method\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000037\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which person is a critic with an ISCO occupation code of 2451?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"critic\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which sound has an IAB code of 344?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"344\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which association has an ISNI of 0000 0004 1936 7478?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1936 7478\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has Serbo-Croatian as its Dewey Decimal Classification of 491.82?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"491.82\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the subreddit \"minimal\" and belongs to the category \"techno\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <subreddit> ?pv . ?pv <pred:value> \"minimal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which physician has a short name of \"M.D.\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"physician\" . ?e <short_name> ?pv . ?pv <pred:value> \"M.D.\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is an abjad with an ISO 15924 alpha-4 code of Arab?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"abjad\" . ?e <ISO_15924_alpha-4_code> ?pv . ?pv <pred:value> \"Arab\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which government has an ISNI of 0000 0001 2230 8442?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"government\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2230 8442\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a RIA_Novosti_reference of 55428295 and is related to suicide?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"suicide\" . ?e <RIA_Novosti_reference> ?pv . ?pv <pred:value> \"55428295\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which governor has the official website http://governor.ky.gov/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://governor.ky.gov/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a Glottolog code of fili1244 and is associated with the language Tagalog?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"fili1244\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which division has an official name of \"\u60c5\u5831\u958b\u767a\u672c\u90e8\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <official_name> ?pv . ?pv <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which crime has an ICD-9 code of E960.1?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <ICD-9> ?pv . ?pv <pred:value> \"E960.1\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the IAB code 489 and is related to basketball?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"489\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which metropolis has a WOEID of 2211096?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <WOEID> ?pv . ?pv <pred:value> \"2211096\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a Glottolog code of aust1298 and is associated with the language English?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"English\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"aust1298\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the ICD-10 code R10 and is related to pain?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pain\" . ?e <ICD-10> ?pv . ?pv <pred:value> \"R10\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which person is an announcer with an ISCO occupation code of 2451?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"announcer\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which subject has a Classification of Instructional Programs code of 27.0301?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematics\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"27.0301\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which tragedy has a Dewey Decimal Classification of 809.2523?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"tragedy\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"809.2523\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which town has an OS grid reference of TQ510887?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <OS_grid_reference> ?pv . ?pv <pred:value> \"TQ510887\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under \"LGBT\" with a Dewey Decimal Classification of 306.7663?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.7663\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which novel has an official website of http://www.dccomics.com/watchmen?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dccomics.com/watchmen\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which duo has an ISNI of 0000 0001 0728 0445?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"duo\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0728 0445\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which soundtrack has the title \"Iron Man 2\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <title> ?pv . ?pv <pred:value> \"Iron Man 2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which residue has an Iconclass notation of 41B152?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"residue\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"41B152\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which instrument has a Hornbostel-Sachs classification of 314.122-5?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"zither\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"314.122-5\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which musician has an ISCO occupation code of 2453?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musician\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2453\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which empire is associated with the OSM tag or key \"Tag:historic:civilization=byzantine\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:historic:civilization=byzantine\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which manga has an official website of http://tezukaosamu.net?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which country has a Dewey Decimal Classification of 2--9623?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--9623\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which phenomenon has an IPTC Newscode of mediatopic/20000441?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000441\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which person is an impresario with a ROME Occupation Code (v3) of L1303?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"impresario\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1303\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which army has a name in kana of \"\u3060\u3044\u306b\u3063\u307d\u3093\u3066\u3044\u3053\u304f\u308a\u304f\u3050\u3093\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <name_in_kana> ?pv . ?pv <pred:value> \"\u3060\u3044\u306b\u3063\u307d\u3093\u3066\u3044\u3053\u304f\u308a\u304f\u3050\u3093\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which dynasty has a Swedish Anbytarforum value of 6918.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <Swedish_Anbytarforum> ?pv . ?pv <pred:value> \"6918.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a drama with a Dewey Decimal Classification of 809.2523?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drama\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"809.2523\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the subreddit \"RootsReggae\" and belongs to the category \"reggae\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <subreddit> ?pv . ?pv <pred:value> \"RootsReggae\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the Iconclass notation \"95\" and is classified as folklore?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"folklore\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which group has an OSM tag or key of \"Tag:generator:source=wind\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:generator:source=wind\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which subreddit is associated with the post-hardcore genre?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Emo\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a sRGB color hex triplet of FF2400 and is associated with the color red?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"red\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"FF2400\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which college has an ISNI of 0000 0004 0499 5877?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0499 5877\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a melodrama with an IAB code of 642?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"melodrama\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which sport has an IAB code of 498?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"498\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is related to the medicine category and has an OSM tag or key of \"Tag:healthcare:speciality=internal\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medicine\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:healthcare:speciality=internal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an official website of \"https://www.treasury.gov/about/Pages/Secretary.aspx\" and is classified as \"official\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which restaurant has the OSM tag or key \"Tag:shop=deli\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"restaurant\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:shop=deli\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which property has an Iconclass notation of 31E21?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"property\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"31E21\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the Iconclass notation \"95\" in mythology?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which drug has a subreddit called \"Marijuana\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which band has an ISNI of 0000 0001 1089 9660?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1089 9660\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which religion has a Library of Congress Classification of BR1644-1644.7?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the Iconclass notation \"31E21\" and represents death?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"death\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"31E21\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which designer has an ISCO occupation code of 2141?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"designer\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2141\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which object has a Hornbostel-Sachs classification of 211.212.11 and is a drum?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"211.212.11\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which crematory has a National Heritage List for England number of 1001575?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crematory\" . ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1001575\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which newscast has a Snapchat username of \"gma\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <Snapchat_username> ?pv . ?pv <pred:value> \"gma\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which disco genre has a subreddit called \"italodisco\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <subreddit> ?pv . ?pv <pred:value> \"italodisco\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which problem has an IPTC Newscode of mediatopic/20000800?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"problem\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000800\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under Islam with a Dewey Decimal Classification of 297.82?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"297.82\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under the ACM Classification Code (2012) \"10002979\" and is related to science?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10002979\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which manifestation is categorized under \"humanrights/free-speech-humanrights\" in Wikitribune?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <Wikitribune_category> ?pv . ?pv <pred:value> \"humanrights/free-speech-humanrights\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which horse has a native label of \"Northern Dancer\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an IAB code of 69 and is classified as equity?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"equity\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"69\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which industry has a NACE code of C?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <NACE_code> ?pv . ?pv <pred:value> \"C\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which palace has an ISNI of 0000 0001 2149 5119?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"palace\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2149 5119\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]