[
    {
        "question": "What is the Human Development Index for Kiribati and what is the connection between two entities with the name Kiribati?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Kiribati . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.589\"^^xsd:double . ?e_2 <pred:name> Kiribati . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.589\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index for Uganda and what is the fact that connects Uganda to itself?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Uganda . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.476\"^^xsd:double . ?e_2 <pred:name> Uganda . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.476\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the miniseries that ended on 1990-11-20 and had one season?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1990-11-20\"^^xsd:date . ?e <number of seasons> ?pv . ?pv <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seasons> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the facility with an inception date of 1819-01-01 and a collection or exhibition size of 932.0 measured?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1819-01-01\"^^xsd:date . ?e <collection or exhibition size> ?pv . ?pv <pred:value> \"932.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <collection or exhibition size> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the entertainment with a publication date of 2010-04-30 and an official website of http://www.sega.com/ironman2/us/index.html?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2010-04-30\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://www.sega.com/ironman2/us/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the conservatory with the short name  (which was founded on 1862-09-20) end?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1862-09-20\"^^xsd:date . ?e <short name> ?pv . ?pv <pred:value> \"\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short name> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the album whose publication date is 1976-04-23 and duration is 1744.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> album . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1976-04-23\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"1744.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Northern Dancer die?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> horse . ?e <date of death> ?pv_1 . ?pv_1 <pred:date> \"1990-11-16\"^^xsd:date . ?e <native label> ?pv . ?pv <pred:value> \"Northern Dancer\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for Christianity (whose inception date is 1957-01-01) and has an official website of http://www.ucc.org/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Christianity . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://www.ucc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the reason for the end of the comedy show that lasted for 25.0 units of time and ended on 1992-05-09?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> comedy . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1992-05-09\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"25.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the end time for the capital city with the ISO 3166-2 code CZ-PR and the earliest written record dating back to 0965-01-17?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"0965-01-17\"^^xsd:date . ?e <ISO 3166-2 code> ?pv . ?pv <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publication date of Evita (the one based on the official website http://evitaonbroadway.com/)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Evita . ?e_1 <publication date> ?pv . ?pv <pred:date> \"1997-01-09\"^^xsd:date . ?e_2 <pred:name> Evita . ?e_2 <official website> ?pv_1 . ?pv_1 <pred:value> \"http://evitaonbroadway.com/\" . ?e_1 <based on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based on> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the relationship between Finland (the one whose inception is 1917-01-01 and population is 5.10779e+06) and the fact represented by the variable qpv?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Finland . ?e_1 <inception> ?pv . ?pv <pred:date> \"1917-01-01\"^^xsd:date . ?e_2 <pred:name> Finland . ?e_2 <population> ?pv_1 . ?pv_1 <pred:value> \"5.10779e+06\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publication date of Frankenstein and what is the duration of the derivative work with the same name?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Frankenstein . ?e_1 <publication date> ?pv . ?pv <pred:date> \"1818-01-01\"^^xsd:date . ?e_2 <pred:name> Frankenstein . ?e_2 <duration> ?pv_1 . ?pv_1 <pred:value> \"123.0\" . ?e_1 <derivative work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative work> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the life expectancy of Austria and what is the fact related to it?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Austria . ?e_1 <inception> ?pv . ?pv <pred:date> \"1918-11-12\"^^xsd:date . ?e_2 <pred:name> Austria . ?e_2 <life expectancy> ?pv_1 . ?pv_1 <pred:value> \"80.8902\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with Aachen (the one whose inception is 2009-10-21) being named after Aachen (the one with Instagram username \"stadtaachen\")?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Aachen . ?e_1 <inception> ?pv . ?pv <pred:date> \"2009-10-21\"^^xsd:date . ?e_2 <pred:name> Aachen . ?e_2 <Instagram username> ?pv_1 . ?pv_1 <pred:value> \"stadtaachen\" . ?e_1 <named after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named after> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publication date of the book with ISBN-10 85-325-1773-0 that the movie Trainspotting is based on?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Trainspotting . ?e_1 <publication date> ?pv . ?pv <pred:date> \"1996-02-23\"^^xsd:date . ?e_2 <pred:name> Trainspotting . ?e_2 <ISBN-10> ?pv_1 . ?pv_1 <pred:value> \"85-325-1773-0\" . ?e_1 <based on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based on> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Mauritania's motto \"  \" and inception date of 1960-01-01?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Mauritania . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> Mauritania . ?e_2 <motto text> ?pv_1 . ?pv_1 <pred:value> \"  \" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Greece (the one whose inception is 1821-03-25 and demonym is Griechin) in relation to its country?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Greece . ?e_1 <inception> ?pv . ?pv <pred:date> \"1821-03-25\"^^xsd:date . ?e_2 <pred:name> Greece . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"Griechin\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the relationship between Myanmar (the one whose inception is 1948-01-01) and Myanmar (the one whose nominal GDP is 5.99773e+10)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Myanmar . ?e_1 <inception> ?pv . ?pv <pred:date> \"1948-01-01\"^^xsd:date . ?e_2 <pred:name> Myanmar . ?e_2 <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"5.99773e+10\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the relationship between Suriname (the one whose inception date is 1975-11-25) and Suriname (the one whose nominal GDP is 2.3345e+08)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Suriname . ?e_1 <inception> ?pv . ?pv <pred:date> \"1975-11-25\"^^xsd:date . ?e_2 <pred:name> Suriname . ?e_2 <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"2.3345e+08\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between New Brunswick (the one with WOEID 2458101) and Limerick (the one with LAU IE02302)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Brunswick\" . ?e_1 <WOEID> ?pv . ?pv <pred:value> \"2458101\" . ?e_2 <pred:name> Limerick . ?e_2 <LAU> ?pv_1 . ?pv_1 <pred:value> \"IE02302\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Midland (the one whose area is 9.244e+07) and Michigan (the one whose FIPS 5-2 numeric code is 26)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Midland\" . ?e_1 <area> ?pv . ?pv <pred:value> \"9.244e+07\" . ?e_2 <pred:name> Michigan . ?e_2 <FIPS 5-2 numeric code (US states)> ?pv_1 . ?pv_1 <pred:value> \"26\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the subreddit \"electronica\" and Dido (the one with Instagram username \"dido\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"electronica\" . ?e_1 <subreddit> ?pv . ?pv <pred:value> \"electronica\" . ?e_2 <pred:name> Dido . ?e_2 <Instagram username> ?pv_1 . ?pv_1 <pred:value> \"dido\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between John Cale (the one with ISNI 0000 0003 8291 0405) and celesta (the one with UNSPSC Code 60131004)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Cale\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0003 8291 0405\" . ?e_2 <pred:name> celesta . ?e_2 <UNSPSC Code> ?pv_1 . ?pv_1 <pred:value> \"60131004\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Steve Ditko (the one with ISNI 0000 0001 1879 8127) and Johnstown (the one with an area of 6.09)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Steve Ditko\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1879 8127\" . ?e_2 <pred:name> Johnstown . ?e_2 <area> ?pv_1 . ?pv_1 <pred:value> \"6.09\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Aachen (the one with Dewey Decimal Classification 2--435511) and Toledo (the one with Dewey Decimal Classification 2--4643)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Aachen\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--435511\" . ?e_2 <pred:name> Toledo . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4643\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between World Golf Hall of Fame (the one with Twitter username GolfHallofFame) and golf (the one with IAB code 512)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"World Golf Hall of Fame\" . ?e_1 <Twitter username> ?pv . ?pv <pred:value> \"GolfHallofFame\" . ?e_2 <pred:name> golf . ?e_2 <IAB code> ?pv_1 . ?pv_1 <pred:value> \"512\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Club Tijuana (the one with a Twitter username of \"xolos en\") and Tijuana (the one with a Dewey Decimal Classification of \"2--7223\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Club Tijuana\" . ?e_1 <Twitter username> ?pv . ?pv <pred:value> \"xolos en\" . ?e_2 <pred:name> Tijuana . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7223\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the movie Wanted (with a duration of 153.0) and Govinda (whose Instagram username is govinda herono1)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Wanted\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"153.0\" . ?e_2 <pred:name> Govinda . ?e_2 <Instagram username> ?pv_1 . ?pv_1 <pred:value> \"govinda herono1\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Club Atltico Osasuna (the one with an official website of http://www.osasuna.es) and Spain (the one with a PPP GDP per capita of 33709.7)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Club Atltico Osasuna\" . ?e_1 <official website> ?pv . ?pv <pred:value> \"http://www.osasuna.es\" . ?e_2 <pred:name> Spain . ?e_2 <PPP GDP per capita> ?pv_1 . ?pv_1 <pred:value> \"33709.7\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is AT&T associated with the British Museum person-institution with a value of 156686?",
        "sparql": "ASK { ?e <pred:name> AT&T . ?e <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"156686\" . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"156686\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does L-Threonine have a CAS Registry Number of 72-19-5?",
        "sparql": "ASK { ?e <pred:name> L-Threonine . ?e <CAS Registry Number> ?pv_1 . ?pv_1 <pred:value> \"72-19-5\" . ?e <CAS Registry Number> ?pv . ?pv <pred:value> \"72-19-5\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Mako have a Twitter username of manya02?",
        "sparql": "ASK { ?e <pred:name> Mako . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"manya02\" . ?e <Twitter username> ?pv . ?pv <pred:value> \"manya02\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the area of Harlem 3.871?",
        "sparql": "ASK { ?e <pred:name> Harlem . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"3.871\" . ?e <area> ?pv . ?pv <pred:value> \"3.871\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Guelph have a Statistics Canada Geographic code of 3523008?",
        "sparql": "ASK { ?e <pred:name> Guelph . ?e <Statistics Canada Geographic code> ?pv_1 . ?pv_1 <pred:value> \"3523008\" . ?e <Statistics Canada Geographic code> ?pv . ?pv <pred:value> \"3523008\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the autoharp classified as 314.122-5 in the Hornbostel-Sachs classification system?",
        "sparql": "ASK { ?e <pred:name> autoharp . ?e <Hornbostel-Sachs classification> ?pv_1 . ?pv_1 <pred:value> \"314.122-5\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"314.122-5\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of Gladiator 98.0?",
        "sparql": "ASK { ?e <pred:name> Gladiator . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" . ?e <duration> ?pv . ?pv <pred:value> \"98.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Belleville's Statistics Canada Geographic code 3512005?",
        "sparql": "ASK { ?e <pred:name> Belleville . ?e <Statistics Canada Geographic code> ?pv_1 . ?pv_1 <pred:value> \"3512005\" . ?e <Statistics Canada Geographic code> ?pv . ?pv <pred:value> \"3512005\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a film with a box office of 8.96911e+08 and a publication date of 2005-11-06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <publication date> ?pv . ?pv <pred:date> \"2005-11-06\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an award that had 441290 visitors per year, was founded on 1983-01-01, and belongs to the instance of award?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> award . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"441290.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1983-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a war that ended on November 11, 1918 and had a number of deaths equal to 1.7e+07?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.7e+07\"^^xsd:double . ?e <end time> ?pv . ?pv <pred:date> \"1918-11-11\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a conservatory with an inception date of 1921-01-01 and a student count of 900.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <students count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"900.0\"^^xsd:double . ?e <inception> ?pv . ?pv <pred:date> \"1921-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a town with a population of 344218.0 and a time of earliest written record of 1091-01-17?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> town . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"344218.0\"^^xsd:double . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"1091-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]