[{"question": "Did the movie \"Apocalypto\" have a box office of 1.206e+08?", "sparql": "ASK { ?e <pred:name> \"Apocalypto\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Apocalypto\" . ?e <box_office> ?pv . ?pv <pred:value> \"1.206e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the movie Stargate have a title equal to \"Stargate\" and a box office value of 1.96567e+08?", "sparql": "ASK { ?e <pred:name> \"Stargate\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Stargate\" . ?e <box_office> ?pv . ?pv <pred:value> \"1.96567e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Trenton \"Trenton\" and its area 21.2492?", "sparql": "ASK { ?e <pred:name> \"Trenton\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Trenton\" . ?e <area> ?pv . ?pv <pred:value> \"21.2492\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the movie \"RoboCop\" with a duration of 117.0 minutes?", "sparql": "ASK { ?e <pred:name> \"RoboCop\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"RoboCop\" . ?e <duration> ?pv . ?pv <pred:value> \"117.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the EPPO code for Cichlidae 1CICHF?", "sparql": "ASK { ?e <pred:name> \"Cichlidae\" . ?e <taxon_name> ?pv_1 . ?pv_1 <pred:value> \"Cichlidae\" . ?e <EPPO_Code> ?pv . ?pv <pred:value> \"1CICHF\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nirvana have a Twitter username of \"Nirvana\" and a British Museum person-institution ID of 207922?", "sparql": "ASK { ?e <pred:name> \"Nirvana\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"Nirvana\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"207922\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Tampere \"Tampere\" and does it have a Dewey Decimal Classification of 2--489737?", "sparql": "ASK { ?e <pred:name> \"Tampere\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Tampere\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--489737\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the TOID of Worcester 4000000074565458 and its official name also Worcester?", "sparql": "ASK { ?e <pred:name> \"Worcester\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Worcester\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074565458\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"Shine\" with a title of \"Shine\" and a duration of 101.0?", "sparql": "ASK { ?e <pred:name> \"Shine\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Shine\" . ?e <duration> ?pv . ?pv <pred:value> \"101.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Bendigo \"Bendigo\" and does it have a WOEID of 1100282?", "sparql": "ASK { ?e <pred:name> \"Bendigo\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Bendigo\" . ?e <WOEID> ?pv . ?pv <pred:value> \"1100282\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Indiana have a subreddit and a Dewey Decimal Classification of 2--772?", "sparql": "ASK { ?e <pred:name> \"Indiana\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Indiana\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--772\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of Shrek http://www.shrek.com and does it have a subreddit named Shrek?", "sparql": "ASK { ?e <pred:name> \"Shrek\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Shrek\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.shrek.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the movie \"Hook\" have a box office revenue of 3.00855e+08?", "sparql": "ASK { ?e <pred:name> \"Hook\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hook\" . ?e <box_office> ?pv . ?pv <pred:value> \"3.00855e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the movie Lawless's title Lawless and its box office value 5.36766e+07?", "sparql": "ASK { ?e <pred:name> \"Lawless\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Lawless\" . ?e <box_office> ?pv . ?pv <pred:value> \"5.36766e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Dnipro \"Dnipro\" and its area 4.05e+08?", "sparql": "ASK { ?e <pred:name> \"Dnipro\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Dnipro\" . ?e <area> ?pv . ?pv <pred:value> \"4.05e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Fringe\" have a title and 100 episodes?", "sparql": "ASK { ?e <pred:name> \"Fringe\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Fringe\" . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"100.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of Nuremberg 180.0?", "sparql": "ASK { ?e <pred:name> \"Nuremberg\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Nuremberg\" . ?e <duration> ?pv . ?pv <pred:value> \"180.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the movie \"Precious\" have a production code of 69410?", "sparql": "ASK { ?e <pred:name> \"Precious\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Precious\" . ?e <production_code> ?pv . ?pv <pred:value> \"69410\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"Frenzy\" with a title of \"Frenzy\" and a duration of 116.0?", "sparql": "ASK { ?e <pred:name> \"Frenzy\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Frenzy\" . ?e <duration> ?pv . ?pv <pred:value> \"116.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Sydney \"Sydney\" and does it have a Dewey Decimal Classification of 2--9441?", "sparql": "ASK { ?e <pred:name> \"Sydney\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Sydney\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--9441\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Bellevue \"Bellevue\" and does it have an ISNI of 0000 0004 0408 5857?", "sparql": "ASK { ?e <pred:name> \"Bellevue\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Bellevue\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0408 5857\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Alameda \"Alameda\" and does it have a Dewey Decimal Classification of 2--79465?", "sparql": "ASK { ?e <pred:name> \"Alameda\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Alameda\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79465\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the ISWC of the song \"Skyfall\" equal to T-915.499.391-6?", "sparql": "ASK { ?e <pred:name> \"Skyfall\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Skyfall\" . ?e <ISWC> ?pv . ?pv <pred:value> \"T-915.499.391-6\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of Chandler 85.0?", "sparql": "ASK { ?e <pred:name> \"Chandler\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Chandler\" . ?e <duration> ?pv . ?pv <pred:value> \"85.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the show named Emma have a title of Emma and 4.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Emma\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Emma\" . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"4.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Varanasi's native label equal to \"Varanasi\" and its area equal to 3.131e+09?", "sparql": "ASK { ?e <pred:name> \"Varanasi\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Varanasi\" . ?e <area> ?pv . ?pv <pred:value> \"3.131e+09\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Tallinn \"Tallinn\" and does it have a Dewey Decimal Classification of 2--4798?", "sparql": "ASK { ?e <pred:name> \"Tallinn\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Tallinn\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4798\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Aspen \"Aspen\" and its area 10.0481?", "sparql": "ASK { ?e <pred:name> \"Aspen\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Aspen\" . ?e <area> ?pv . ?pv <pred:value> \"10.0481\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Alexander Summers the birth name of Havok (the one whose name in native language is Havok)?", "sparql": "ASK { ?e <pred:name> \"Havok\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Havok\" . ?e <birth_name> ?pv . ?pv <pred:value> \"Alexander Summers\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the movie Armageddon's title \"Armageddon\" and its box office revenue 5.5371e+08?", "sparql": "ASK { ?e <pred:name> \"Armageddon\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Armageddon\" . ?e <box_office> ?pv . ?pv <pred:value> \"5.5371e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Nice equal to Nice and does it have a Dewey Decimal Classification of 2--44941?", "sparql": "ASK { ?e <pred:name> \"Nice\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Nice\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--44941\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Tours \"Tours\" and does it have a Dewey Decimal Classification of 2--44545?", "sparql": "ASK { ?e <pred:name> \"Tours\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Tours\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--44545\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"Shopgirl\" with a title of \"Shopgirl\" and a duration of 99.0?", "sparql": "ASK { ?e <pred:name> \"Shopgirl\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Shopgirl\" . ?e <duration> ?pv . ?pv <pred:value> \"99.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Fullerton \"Fullerton\" and its area 58.1289?", "sparql": "ASK { ?e <pred:name> \"Fullerton\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Fullerton\" . ?e <area> ?pv . ?pv <pred:value> \"58.1289\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Muskegon have a subreddit named Muskegon and a WOEID of 2456611?", "sparql": "ASK { ?e <pred:name> \"Muskegon\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Muskegon\" . ?e <WOEID> ?pv . ?pv <pred:value> \"2456611\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"Stardust\" with a title and duration of \"Stardust\" and 111.0 minutes, respectively?", "sparql": "ASK { ?e <pred:name> \"Stardust\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Stardust\" . ?e <duration> ?pv . ?pv <pred:value> \"111.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the movie Sleepers have a title of Sleepers and a box office of 1.65615e+08?", "sparql": "ASK { ?e <pred:name> \"Sleepers\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Sleepers\" . ?e <box_office> ?pv . ?pv <pred:value> \"1.65615e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the movie Superbad's title \"Superbad\" and duration 114.0?", "sparql": "ASK { ?e <pred:name> \"Superbad\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Superbad\" . ?e <duration> ?pv . ?pv <pred:value> \"114.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Lansing equal to \"Lansing\" and its area equal to 102.97?", "sparql": "ASK { ?e <pred:name> \"Lansing\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Lansing\" . ?e <area> ?pv . ?pv <pred:value> \"102.97\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the title of Phoenix 98.0?", "sparql": "ASK { ?e <pred:name> \"Phoenix\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Phoenix\" . ?e <duration> ?pv . ?pv <pred:value> \"98.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of Lexington equal to \"Lexington\" and its area equal to 739.565?", "sparql": "ASK { ?e <pred:name> \"Lexington\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Lexington\" . ?e <area> ?pv . ?pv <pred:value> \"739.565\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the show Drive have a title equal to \"Drive\" and a number of episodes equal to 6.0?", "sparql": "ASK { ?e <pred:name> \"Drive\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Drive\" . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"6.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the movie \"Ghost\" have a title of \"Ghost\" and a box office of 5.06e+08?", "sparql": "ASK { ?e <pred:name> \"Ghost\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Ghost\" . ?e <box_office> ?pv . ?pv <pred:value> \"5.06e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the box office revenue of the movie \"Melancholia\" equal to 1.59463e+07?", "sparql": "ASK { ?e <pred:name> \"Melancholia\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Melancholia\" . ?e <box_office> ?pv . ?pv <pred:value> \"1.59463e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"Syriana\" with a title of \"Syriana\" and a duration of 128.0?", "sparql": "ASK { ?e <pred:name> \"Syriana\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Syriana\" . ?e <duration> ?pv . ?pv <pred:value> \"128.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label of England equal to \"England\" and does it have a GSS code (2011) of E92000001?", "sparql": "ASK { ?e <pred:name> \"England\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"England\" . ?e <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E92000001\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the movie Ratatouille's subreddit \"Ratatouille\" and duration 111.0?", "sparql": "ASK { ?e <pred:name> \"Ratatouille\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Ratatouille\" . ?e <duration> ?pv . ?pv <pred:value> \"111.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Oakland \"Oakland\" and does it have a Dewey Decimal Classification of 2--79466?", "sparql": "ASK { ?e <pred:name> \"Oakland\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Oakland\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79466\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the short name of the BBC \"BBC\" and does it have a British Museum person-institution ID of 86622?", "sparql": "ASK { ?e <pred:name> \"BBC\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"BBC\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"86622\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the movie X2's title \"X2\" and duration 128.0?", "sparql": "ASK { ?e <pred:name> \"X2\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"X2\" . ?e <duration> ?pv . ?pv <pred:value> \"128.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of the show Alias 42.0?", "sparql": "ASK { ?e <pred:name> \"Alias\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Alias\" . ?e <duration> ?pv . ?pv <pred:value> \"42.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of the movie Anastasia 105.0?", "sparql": "ASK { ?e <pred:name> \"Anastasia\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Anastasia\" . ?e <duration> ?pv . ?pv <pred:value> \"105.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the movie \"Insidious\" with a title of \"Insidious\" and a box office of 9.70092e+07?", "sparql": "ASK { ?e <pred:name> \"Insidious\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Insidious\" . ?e <box_office> ?pv . ?pv <pred:value> \"9.70092e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"Serpico\" with a title of \"Serpico\" and a duration of 130.0?", "sparql": "ASK { ?e <pred:name> \"Serpico\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Serpico\" . ?e <duration> ?pv . ?pv <pred:value> \"130.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the concept of socialism have a subreddit called socialism and a Dewey Decimal Classification of 306.345?", "sparql": "ASK { ?e <pred:name> \"socialism\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"socialism\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Hunan have a subreddit with the value \"Hunan\" and a China administrative division code of 43?", "sparql": "ASK { ?e <pred:name> \"Hunan\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Hunan\" . ?e <China_administrative_division_code> ?pv . ?pv <pred:value> \"43\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the movie Valkyrie have a title of \"Valkyrie\" and a box office of 200 million?", "sparql": "ASK { ?e <pred:name> \"Valkyrie\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Valkyrie\" . ?e <box_office> ?pv . ?pv <pred:value> \"2e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the film \"Happy-Go-Lucky\" with a duration of 118.0 minutes?", "sparql": "ASK { ?e <pred:name> \"Happy-Go-Lucky\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Happy-Go-Lucky\" . ?e <duration> ?pv . ?pv <pred:value> \"118.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the name in native language of Akon \"Akon\" and does he have an ISNI of 0000 0000 6308 7968?", "sparql": "ASK { ?e <pred:name> \"Akon\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Akon\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 6308 7968\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Usher's name in native language also Usher and does he have a Giphy username of usher?", "sparql": "ASK { ?e <pred:name> \"Usher\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Usher\" . ?e <Giphy_username> ?pv . ?pv <pred:value> \"usher\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Inglewood have a subreddit named \"Inglewood\" and an area of 23.5494?", "sparql": "ASK { ?e <pred:name> \"Inglewood\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Inglewood\" . ?e <area> ?pv . ?pv <pred:value> \"23.5494\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name of Bath \"Bath\" and does it have an OS grid reference of ST745645?", "sparql": "ASK { ?e <pred:name> \"Bath\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Bath\" . ?e <OS_grid_reference> ?pv . ?pv <pred:value> \"ST745645\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Jeetendra's name in native language Jeetendra and does he have an ISNI of 0000 0003 8237 7380?", "sparql": "ASK { ?e <pred:name> \"Jeetendra\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Jeetendra\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 8237 7380\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duration of the movie Flashdance 95.0?", "sparql": "ASK { ?e <pred:name> \"Flashdance\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Flashdance\" . ?e <duration> ?pv . ?pv <pred:value> \"95.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Thor have a title of \"Thor\" and an attendance of 1.18455e+06?", "sparql": "ASK { ?e <pred:name> \"Thor\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Thor\" . ?e <attendance> ?pv . ?pv <pred:value> \"1.18455e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the metropolis with the official website http://ville.montreal.qc.ca/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://ville.montreal.qc.ca/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://ville.montreal.qc.ca/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IETF language tag for the language with ISO 639-1 code \"es\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <ISO_639-1_code> ?pv_1 . ?pv_1 <pred:value> \"es\" . ?e <IETF_language_tag> ?pv . ?pv <pred:value> \"es\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IETF_language_tag> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for music with a value of 368?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"368\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"368\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.arlingtoncemetery.mil of the cemetery?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.arlingtoncemetery.mil/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.arlingtoncemetery.mil/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for the artist with the code L1505?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"artist\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"L1505\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1505\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website http://www.ucc.org/ regarding Christianity?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ucc.org/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ucc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the city/town with the official name \"\u041b\u0435\u043c\u0431\u0435\u0440\u0433\" stop being called \"\u041b\u0435\u043c\u0431\u0435\u0440\u0433\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"\u041b\u0435\u043c\u0431\u0435\u0440\u0433\" . ?e <official_name> ?pv . ?pv <pred:value> \"\u041b\u0435\u043c\u0431\u0435\u0440\u0433\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the final of the Basketball Association of America World Championship Series end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"final\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Basketball Association of America World Championship Series\" . ?e <official_name> ?pv . ?pv <pred:value> \"Basketball Association of America World Championship Series\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ITIS TSN of the taxon with a value of 40351?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <ITIS_TSN> ?pv_1 . ?pv_1 <pred:value> \"40351\" . ?e <ITIS_TSN> ?pv . ?pv <pred:value> \"40351\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ITIS_TSN> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]