[
    {
        "question": "Does the metropolitan area with a nighttime view of \"Long Beach, CA at night.jpg\" have another nighttime view of the same image?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <nighttime view> ?pv_1 . ?pv_1 <pred:value> \"Long Beach, CA at night.jpg\" . ?e <nighttime view> ?pv . ?pv <pred:value> \"Long Beach, CA at night.jpg\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the boarding school with Charity Commission no. 1139000 have the same Charity Commission no. as its own?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"boarding school\" . ?e <Charity Commission no.> ?pv_1 . ?pv_1 <pred:value> \"1139000\" . ?e <Charity Commission no.> ?pv . ?pv <pred:value> \"1139000\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a female given name that has a Soundex code of A660?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"female given name\" . ?e <Soundex> ?pv_1 . ?pv_1 <pred:value> \"A660\" . ?e <Soundex> ?pv . ?pv <pred:value> \"A660\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the biological process with spoken text audio \"Simple en Evolution.oga\" have another spoken text audio with the same value?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"biological process\" . ?e <spoken text audio> ?pv_1 . ?pv_1 <pred:value> \"Simple en Evolution.oga\" . ?e <spoken text audio> ?pv . ?pv <pred:value> \"Simple en Evolution.oga\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the television series episode have a production code of 111?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series episode\" . ?e <production code> ?pv_1 . ?pv_1 <pred:value> \"111\" . ?e <production code> ?pv . ?pv <pred:value> \"111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the metropolitan area whose population was 2.71049e+06 on January 1st, 2014?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.71049e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.71049e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the attendance of a film equal to 8446.0 on 2018-05-30 and had an end time?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8446.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8446.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one with a Human Development Index of 0.39) to Ivory Coast (the one with a Human Development Index of 0.444)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.39\"^^xsd:double . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.444\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was the voice actor for Fred Astaire in Top Hat (the one whose duration is 101.0)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Top Hat\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"101.0\" . ?e_2 <pred:name> \"Fred Astaire\" . ?e_1 <cast member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast member> ; <pred:fact_t> ?e_2 ] <voice actor> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon (the one with a Human Development Index of 0.436) to Cameroon (the one with a Human Development Index of 0.436)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"Boston\" both the Dewey Decimal Classification and official name of the city?",
        "sparql": "ASK { ?e <pred:name> \"Boston\" . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--74461\" . ?e <official name> ?pv . ?pv <pred:value> \"Boston\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Fred Astaire's name in native language also Fred Astaire and does he have a British Museum person-institution ID of 17780?",
        "sparql": "ASK { ?e <pred:name> \"Fred Astaire\" . ?e <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"17780\" . ?e <name in native language> ?pv . ?pv <pred:value> \"Fred Astaire\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a portrait with an Artsy gene value of \"portrait\" for both its name and gene?",
        "sparql": "ASK { ?e <pred:name> \"portrait\" . ?e <Artsy gene> ?pv_1 . ?pv_1 <pred:value> \"portrait\" . ?e <Artsy gene> ?pv . ?pv <pred:value> \"portrait\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon (the one with a Human Development Index of 0.436) and Cameroon (the one whose inception date is 1960-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Harry Potter and the Goblet of Fire (the one whose box office is 8.96911e+08) and Maggie Smith (the one born on 1934-12-28)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_1 <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double . ?e_2 <pred:name> \"Maggie Smith\" . ?e_2 <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1934-12-28\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the diplomatic relation between Ghana (whose Human Development Index is 0.427) and Ivory Coast (whose Human Development Index is 0.39)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ghana\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.427\"^^xsd:double . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.39\"^^xsd:double . ?e_1 <diplomatic relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic relation> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of the sovereign state with a Human Development Index of 0.39?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.39\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon (the one with Dewey Decimal Classification of 2--6711) and Cameroon (the one with a Human Development Index of 0.486)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6711\" . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.486\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of the U.S. city equal to 25514.0 and is this the only population value for this city?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25514.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"25514.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the film, published on 2005-11-16 in Germany, have a box office of 8.96911e+08?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an administrative territorial entity that was established on March 31, 1917 based on the Treaty of the Danish West Indies and has a total fertility rate of 2.06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1917-03-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <criterion used> ?qpv . ?qpv <pred:value> \"Treaty of the Danish West Indies\" . ?e <total fertility rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Pan Am operate the aircraft functional class that had a service entry date of 1970-01-22 and a total production of 1527.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <service entry> ?pv_1 . ?pv_1 <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv_1 ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1527.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which sovereign state had a nominal GDP of 1.13963e+10 on January 1st, 1992 and has a Dewey Decimal Classification of 2--6711?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"1.13963e+10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal GDP> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"1992-01-01\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6711\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Dallas (the one with 357.0 number of episodes) and Larry Hagman (the one who died on 2012-11-23)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dallas\" . ?e_1 <number of episodes> ?pv . ?pv <pred:value> \"357.0\" . ?e_2 <pred:name> \"Larry Hagman\" . ?e_2 <date of death> ?pv_1 . ?pv_1 <pred:date> \"2012-11-23\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Somerset (the one with 1710.0 number of episodes) and Sigourney Weaver?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Somerset\" . ?e_1 <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1710.0\"^^xsd:double . ?e_2 <pred:name> \"Sigourney Weaver\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between St. Clair County (the one with a population of 161508.0) to Port Huron?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"St. Clair County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"161508.0\"^^xsd:double . ?e_2 <pred:name> \"Port Huron\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Mary Pickford (who has 2 children) and the Academy Award for Best Actress?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mary Pickford\" . ?e_1 <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double . ?e_2 <pred:name> \"Academy Award for Best Actress\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the United States presidential election, 2008 (which had 2.13314e+08 eligible voters) and John McCain?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"United States presidential election, 2008\" . ?e_1 <eligible voters> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.13314e+08\"^^xsd:double . ?e_2 <pred:name> \"John McCain\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between University of Chicago (the one with 2350.0 employees) to University of Chicago Law School?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"University of Chicago\" . ?e_1 <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2350.0\"^^xsd:double . ?e_2 <pred:name> \"University of Chicago Law School\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Cameroon and what is the Human Development Index of Cameroon (whose value is 0.436) in relation to each other?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6711\" . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index for Cameroon and what is the connection between two entities with the name Cameroon?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the U.S. city with an inception date of 1630-09-07 and an official website of http://www.cityofboston.gov/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://www.cityofboston.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the reason for Ivory Coast (the one whose inception is 1960-01-01) being called elef\u00e1ntcsontparti in its demonym?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"elef\u00e1ntcsontparti\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one with Dewey Decimal Classification of 2--6668) and Ivory Coast (the one with a Human Development Index of 0.458)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6668\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.458\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a U.S. city with a population of 25514 and a population greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"25514.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the agent with 650 seats have more seats than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <number of seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"650.0\"^^xsd:double . ?e <number of seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a political party with a member count of 56741.0 and a member count greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <member count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56741.0\"^^xsd:double . ?e <member count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a manifestation with a number of constituencies equal to 107.0 and another number of constituencies greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <number of constituencies> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107.0\"^^xsd:double . ?e <number of constituencies> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an association football club with a maximum capacity greater than 80,000?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association football club\" . ?e <maximum capacity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80000.0\"^^xsd:double . ?e <maximum capacity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an aircraft functional class with a total production greater than 1527.0 and a total production greater than arg4?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <total produced> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1527.0\"^^xsd:double . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a cemetery with 250,000 people buried and more than arg4 people buried in total?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <quantity buried> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"250000.0\"^^xsd:double . ?e <quantity buried> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a written work with 243 pages and more than arg4 pages?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"written work\" . ?e <number of pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"243.0\"^^xsd:double . ?e <number of pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]