[
    {
        "question": "What country is Durham located in, which has a population of 5485 and is the headquarters location of Duke University (which has 14832 students)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Duke University\" . ?e_1 <students count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"14832.0\"^^xsd:double . ?e_2 <pred:name> Durham . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5485.0\"^^xsd:double . ?e_1 <headquarters location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters location> ; <pred:fact_t> ?e_2 ] <country> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the administrative body that twinned Newcastle upon Tyne (population 282442.0) with Nancy (population 105162.0)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Newcastle upon Tyne\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"282442.0\"^^xsd:double . ?e_2 <pred:name> Nancy . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"105162.0\"^^xsd:double . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index of Chile and what is the population of Santiago (the capital of Chile)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Chile\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.699\"^^xsd:double . ?e_2 <pred:name> Santiago . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.12859e+06\"^^xsd:double . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of Plymouth County (which contains Brockton) according to the given data?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Plymouth County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"495844.0\"^^xsd:double . ?e_2 <pred:name> Brockton . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"93810.0\"^^xsd:double . ?e_1 <contains administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the difference in population between the Kingdom of Portugal (with a population of 5e+06) and Portugal (with a population of 9.96024e+06)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Kingdom of Portugal\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5e+06\"^^xsd:double . ?e_2 <pred:name> Portugal . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9.96024e+06\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publication date of the entertainment with a review score of 6/10 and an official website of https://web.archive.org/web/20090202050724/http://alexander-thegame.com/us/ (the language of this statement is not specified)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <review score> ?pv_1 . ?pv_1 <pred:value> \"6/10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <review score> ; <pred:fact_t> ?pv_1 ] <publication date> ?qpv_1 . ?qpv_1 <pred:date> \"2004-12-08\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"https://web.archive.org/web/20090202050724/http://alexander-thegame.com/us/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the city/town, officially named Lww, have a population of 727968.0 (as of 2017-01-01)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"727968.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-01-01\"^^xsd:date . ?e <official name> ?pv . ?pv <pred:value> \"Lww\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the start time and reason for the exploitation visa number 114028 for a film that has a box office of 8.96911e+08?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <exploitation visa number> ?pv_1 . ?pv_1 <pred:value> \"114028\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation visa number> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv_1 . ?qpv_1 <pred:date> \"2005-11-17\"^^xsd:date . ?e <box office> ?pv . ?pv <pred:value> \"8.96911e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <box office> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the official website of the metropolis with a population of 1.64952e+06 as of 2011-01-01 and whose official website is http://ville.montreal.qc.ca/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"1.64952e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2011-01-01\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://ville.montreal.qc.ca/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the neighborhood with a population of 335109.0 on 2000-01-01 and a subreddit of Harlem?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"335109.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2000-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> \"Harlem\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the point in time when the currency had a price of 1.4746 on December 31, 2015?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> currency . ?e <price> ?pv_1 . ?pv_1 <pred:value> \"1.4746\" . [ <pred:fact_h> ?e ; <pred:fact_r> <price> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2015-12-31\"^^xsd:date . ?e <price> ?pv . ?pv <pred:value> \"1.4746\" . [ <pred:fact_h> ?e ; <pred:fact_r> <price> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the archive date for the software whose official website is http://windows.microsoft.com/ru-ru/windows/products/windows-xp (archived on 2012-10-24 and the language of the website is English)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://windows.microsoft.com/ru-ru/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv_1 ] <archive date> ?qpv_1 . ?qpv_1 <pred:date> \"2012-10-24\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://windows.microsoft.com/en-us/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for the organization with an Alexa rank of 360.0 on 2017-11-20 and an official website of https://www.target.com (whose language of work or name is ?qpv)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"360.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"https://www.target.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the band with Twitter username \"depechemode\" start using that username and what language pertains to it?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> band . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"depechemode\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv_1 . ?qpv_1 <pred:date> \"2009-03-01\"^^xsd:date . ?e <Twitter username> ?pv . ?pv <pred:value> \"depechemode\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Manchester (the one with GSS code (2011) E08000003) and Manchester (the one with a population of 545500.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Manchester . ?e_1 <GSS code (2011)> ?pv . ?pv <pred:value> \"E08000003\" . ?e_2 <pred:name> Manchester . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"545500.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Guildford, one with a GSS code (2011) of E07000209 and the other with a population of 77000.0?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Guildford . ?e_1 <GSS code (2011)> ?pv . ?pv <pred:value> \"E07000209\" . ?e_2 <pred:name> Guildford . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"77000.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Myanmar (the one with Dewey Decimal Classification of 2--591) and Myanmar (the one with a Human Development Index of 0.478)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Myanmar . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--591\" . ?e_2 <pred:name> Myanmar . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.478\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Barbados (the one with a Dewey Decimal Classification of 2--72981) and Barbados (the one with a population of 258443.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Barbados . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--72981\" . ?e_2 <pred:name> Barbados . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"258443.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Grimsby (the one with a box office of 2.5e+07) and Grimsby (the one with a population of 88243.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Grimsby . ?e_1 <box office> ?pv . ?pv <pred:value> \"2.5e+07\" . ?e_2 <pred:name> Grimsby . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"88243.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Georgia (the one with a British Museum person-institution value of 108453) and Georgia (the one with 61118.0 out-of-school children)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Georgia . ?e_1 <British Museum person-institution> ?pv . ?pv <pred:value> \"108453\" . ?e_2 <pred:name> Georgia . ?e_2 <number of out-of-school children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"61118.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Canada (the one whose CIVICUS Monitor country entry is canada) and Canada (the one with a population of 2.9354e+07)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Canada . ?e_1 <CIVICUS Monitor country entry> ?pv . ?pv <pred:value> \"canada\" . ?e_2 <pred:name> Canada . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.9354e+07\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Salzburg (the one with a Dewey Decimal Classification of 2--4363) and Salzburg (the one with a population of 152367.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Salzburg . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--4363\" . ?e_2 <pred:name> Salzburg . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"152367.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Nepal (the one with a Dewey Decimal Classification of 2--5496) and Nepal (the one with a population of 8.32508e+06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Nepal . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--5496\" . ?e_2 <pred:name> Nepal . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.32508e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Madagascar (the one with a Dewey Decimal Classification of 2--691) and Madagascar (the one with a Human Development Index of 0.504)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Madagascar . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--691\" . ?e_2 <pred:name> Madagascar . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.504\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the book with a genre instance and 218 pages, an OCLC control number of 357792, and a number of pages equal to 218?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv . ?pv <pred:value> \"218.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of pages> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"218.0\"^^xsd:double . ?e <OCLC control number> ?pv_1 . ?pv_1 <pred:value> \"357792\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which country has a population of 5.3136e+06 and a British Museum person-institution value of 114921?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <population> ?pv . ?pv <pred:value> \"5.3136e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"5.3136e+06\"^^xsd:double . ?e <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"114921\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which war had a number of deaths equal to 1.7e+07?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <number of deaths> ?pv . ?pv <pred:value> \"1.7e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.7e+07\"^^xsd:double . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:value> \"1.7e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which anime has exactly 13 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anime . ?e <number of episodes> ?pv . ?pv <pred:value> \"13.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"13.0\"^^xsd:double . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"13.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name in native language of the village with a population of 6323 and the name \"Bronxville\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <population> ?pv . ?pv <pred:value> \"6323.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6323.0\"^^xsd:double . ?e <name in native language> ?pv_1 . ?pv_1 <pred:value> \"Bronxville\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which museum has a Twitter username of \"metmuseum\", 4.47312e+06 subscribers, and 6.7e+06 visitors per year?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <Twitter username> ?pv . ?pv <pred:value> \"metmuseum\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"4.47312e+06\"^^xsd:double . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:value> \"6.7e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which state has a Human Development Index of 0.649 and an INSEE countries and foreign territories code of 99151?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.649\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"0.649\"^^xsd:double . ?e <INSEE countries and foreign territories code> ?pv_1 . ?pv_1 <pred:value> \"99151\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which song has a beats per minute of 90.0 and an ISWC of T-070.017.986-7?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> song . ?e <beats per minute> ?pv . ?pv <pred:value> \"90.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <beats per minute> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"90.0\"^^xsd:double . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-070.017.986-7\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which nationality has a population of 6 million and a population density of 1 person per square mile?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> nationality . ?e <population> ?pv . ?pv <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6e+06\"^^xsd:double . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who has 2 children, a British Museum person-institution value of 17780, and what is the fact associated with them?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <number of children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of children> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"2.0\" . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"17780\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British Museum person-institution> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the anime with an official website of http://www.tv-tokyo.co.jp/anime/sonic x/ and 2.0 seasons?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anime . ?e <number of seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seasons> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"2.0\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.tv-tokyo.co.jp/anime/sonic x/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the duration and beats per minute of the single with a duration of 279.0 and beats per minute of 72.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> single . ?e <beats per minute> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"72.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <beats per minute> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"72.0\" . ?e <duration> ?pv . ?pv <pred:value> \"279.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]