[
    {
        "question": "What is the subreddit for art that has 166070.0 subscribers and is related to photocritique?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> art . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"photocritique\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"166070.0\"^^xsd:double . ?e <pred:instance of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official name of the island with a population of 1.1158e+06?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"1.1158e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.1158e+06\"^^xsd:double . ?e <official name> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Glottolog code for the language Malay, which has 4.3e+07 speakers?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Malay . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:value> \"4.3e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"4.3e+07\"^^xsd:double . ?e <Glottolog code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the platform of the activity with Twitter username \"sonic20th\" and 31,585 subscribers?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"31585.0\"^^xsd:double . ?e <platform> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the NUTS code of the capital city whose Twitter username is PrahaEU and has 7776.0 subscribers?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"PrahaEU\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"7776.0\"^^xsd:double . ?e <NUTS code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the association with Twitter username \"royalacademy\" (with 420177.0 subscribers) and National Heritage List for England number 1226676?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> association . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"royalacademy\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"420177.0\"^^xsd:double . ?e <National Heritage List for England number> ?pv . ?pv <pred:value> \"1226676\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many speakers does the Serbo-Croatian language have, and what is its Dewey Decimal Classification?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Serbo-Croatian . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:value> \"1.2e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.2e+07\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"491.82\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the official website of Mormonism https://www.mormon.org and does the Twitter account with username LDSchurch have 461456 subscribers?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Mormonism . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"LDSchurch\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"461456.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"https://www.mormon.org\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What conservatory has 40 employees and 526 students?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"40.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"40.0\"^^xsd:double . ?e <students count> ?pv . ?pv <pred:value> \"526.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the activity with Twitter username \"sonic20th\" related to Sonic the Hedgehog and has 31,585 subscribers?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"31585.0\"^^xsd:double . ?e <Twitter username> ?pv . ?pv <pred:value> \"sonic hedgehog\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISO 639-3 code for the language Tagalog, which has 9e+07 speakers?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Tagalog . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:value> \"9e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"9e+07\"^^xsd:double . ?e <ISO 639-3 code> ?pv . ?pv <pred:value> \"fil\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which state has an INSEE countries and foreign territories code of 99151 and a Human Development Index of 0.649?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.649\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"0.649\"^^xsd:double . ?e <INSEE countries and foreign territories code> ?pv . ?pv <pred:value> \"99151\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What industry has a show with 1447 episodes, where the number of episodes is equal to 1447.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"1447.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1447.0\"^^xsd:double . ?e <number of episodes> ?pv . ?pv <pred:value> \"1447.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the unit of measurement for the duration of Lagaan and what is its value?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Lagaan . ?e <duration> ?pv . ?pv <pred:value> \"224.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the subject's role for Penzance with a TOID of 7000000000024435?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Penzance . ?e <TOID> ?pv . ?pv <pred:value> \"7000000000024435\" . [ <pred:fact_h> ?e ; <pred:fact_r> <TOID> ; <pred:fact_t> ?pv ] <subject has role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What jurisdiction does the Twitter account \"IrishEmbJapan\" apply to, in relation to Ireland?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Ireland . ?e <Twitter username> ?pv . ?pv <pred:value> \"IrishEmbJapan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <applies to jurisdiction> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "At what point in time did Bridgend have a population of 49404.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Bridgend . ?e <population> ?pv . ?pv <pred:value> \"49404.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the subject's role for the entity named Folkestone with a TOID of 7000000000042585?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Folkestone . ?e <TOID> ?pv . ?pv <pred:value> \"7000000000042585\" . [ <pred:fact_h> ?e ; <pred:fact_r> <TOID> ; <pred:fact_t> ?pv ] <subject has role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the IPTC Newscode \"mediatopic/20000460\" for the topic of obesity?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> obesity . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000460\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the Iconclass notation \"13D213\" for the entity named \"vampire\"?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> vampire . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"13D213\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass notation> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "At what point in time did Sheffield have a population of 569700.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Sheffield . ?e <population> ?pv . ?pv <pred:value> \"569700.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Serbia's FIPS 10-4 code change to RB?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Serbia . ?e <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"RB\" . [ <pred:fact_h> ?e ; <pred:fact_r> <FIPS 10-4 (countries and regions)> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the mapping relation type for the UMLS CUI \"C0030764\" associated with pedophilia?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> pedophilia . ?e <UMLS CUI> ?pv . ?pv <pred:value> \"C0030764\" . [ <pred:fact_h> ?e ; <pred:fact_r> <UMLS CUI> ; <pred:fact_t> ?pv ] <mapping relation type> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a country whose inception date is 1954-12-15 and has a Dewey Decimal Classification of 2--492, and whose cause of inception is the Charter for the Kingdom of the Netherlands?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> country . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-12-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <has cause> ?qpv . ?qpv <pred:value> \"Charter for the Kingdom of the Netherlands\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--492\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the film published in Germany on August 16, 2001 and has a duration of 98.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <duration> ?pv . ?pv <pred:value> \"98.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which state, dissolved, abolished or demolished on 1865-12-18, had an IPTC Newscode of mediatopic/20000807 and belonged to the United States of America?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1865-12-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved, abolished or demolished> ; <pred:fact_t> ?pv_1 ] <country> ?qpv . ?qpv <pred:value> \"United States of America\" . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000807\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a republic whose inception date is earlier than 1584 and whose demonym is velencei?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <demonym> ?pv . ?pv <pred:value> \"velencei\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What school has an inception date of 1572-01-01, an ARCHON code of 2177, and an instance of a statement with Gregorian date earlier than 1584?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> school . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1572-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <ARCHON code> ?pv . ?pv <pred:value> \"2177\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which university has an inception date earlier than 1584, an instance of \"statement with Gregorian date earlier than 1584\", and an IPv6 routing prefix of 2a01:4f8:120:94ab::/64?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1558-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <IPv6 routing prefix> ?pv . ?pv <pred:value> \"2a01:4f8:120:94ab::/64\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the agent with ISNI 0000 0001 2331 3972's inception date August 25, 1916, and was it caused by the National Park Service Organic Act?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1916-08-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <has cause> ?qpv . ?qpv <pred:value> \"National Park Service Organic Act\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2331 3972\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the language with Tagalog as its instance of, has 9e+07 number of speakers, and has a fact with a value of 9e+07?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Tagalog . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"9e+07\" . ?e <pred:name> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city/town has a population of 758400.0 and a Dewey Decimal Classification value?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"758400.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"758400.0\" . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official website of the anime with 13 episodes and a number of episodes unit of 1?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anime . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"13.0\" . ?e <official website> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country where Serbo-Croatian is spoken by 1.2e+07 people?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Serbo-Croatian . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.2e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.2e+07\" . ?e <country> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the NUTS code of the capital city with 4787 employees?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4787.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"4787.0\" . ?e <NUTS code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which republic has a Human Development Index of 0.424 and is associated with the value of 0.424?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.424\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0.424\" . ?e <country> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of the island that is a part of a larger entity and has a population of 1.1158e+06?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1158e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.1158e+06\" . ?e <part of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the inception time for the museum that has 5.24e+06 visitors per year?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <visitors per year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.24e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors per year> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"5.24e+06\" . ?e <inception> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the legal form of a business with 500 employees and a value of 500.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"500.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"500.0\" . ?e <legal form> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Instagram username of the school with 4962 students?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> school . ?e <students count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4962.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students count> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"4962.0\" . ?e <Instagram username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Tunisia (the one with Dewey Decimal Classification of 2--611) and Tunisia (the one whose inception date is 1956-03-20)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Tunisia . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--611\" . ?e_2 <pred:name> Tunisia . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-03-20\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Guatemala (the one with Dewey Decimal Classification of 2--7281) and Guatemala (the one whose inception date is 1821-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Guatemala . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--7281\" . ?e_2 <pred:name> Guatemala . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]