[
    {
        "question": "What is the fact associated with the single whose beats per minute is 72.0 and duration is 279.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> single . ?e <beats per minute> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"72.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"279.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What jurisdiction does the newspaper with an Alexa rank of 112.0 and an official website of https://www.nytimes.com/ apply to?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> newspaper . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"https://www.nytimes.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <applies to jurisdiction> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the software with an Alexa rank of 1.0 and a Twitter username of Google?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <Twitter username> ?pv . ?pv <pred:value> \"Google\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the temperature of the medication with an atomic number of 1 and a density of 7.874 (the one with an atomic weight of 26.0)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> medication . ?e <atomic number> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"26.0\"^^xsd:double . ?e <density> ?pv . ?pv <pred:value> \"7.874\" . [ <pred:fact_h> ?e ; <pred:fact_r> <density> ; <pred:fact_t> ?pv ] <temperature> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the capital with ISO 3166-2 code CZ-PR (which has 4787 employees) end?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4787.0\"^^xsd:double . ?e <ISO 3166-2 code> ?pv . ?pv <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Where is the location of the religion with a population of 3.35271e+06?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> religion . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.35271e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"3.35271e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <location> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What disease has a DiseasesDB of 29089 and a number of deaths equal to 143000.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> disease . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"29089\" . ?e <number of deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"143000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"143000.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What museum has an ARCHON code of 345 and has 6.41672e+06 visitors per year?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"345\" . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.41672e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors per year> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6.41672e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a business with 500 employees where both employees statements have a value of 500.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"500.0\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"500.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many Chinese speakers are there for the language with Glottolog code yuec1235?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Chinese . ?e <Glottolog code> ?pv_1 . ?pv_1 <pred:value> \"yuec1235\" . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.22216e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6.22216e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the association with an ARCHON code of 397, 80 employees, and a value of 80.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> association . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"397\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"80.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a war with a number of deaths equal to 1.7e+07 and a fact t that also has a value of 1.7e+07?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:value> \"1.7e+07\" . ?e <number of deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.7e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.7e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a college with an ISNI of 0000 0001 2110 961X that has 2023 employees (the start and end time of this fact is the same)?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> college . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2110 961X\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2023.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2023.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What crime had 6 million deaths and had a fact with a value of 6 million?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> crime . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:value> \"6e+06\" . ?e <number of deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital city of Kenya?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Kenya . ?e_2 <pred:name> Kenya . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital city of Vietnam?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Vietnam . ?e_2 <pred:name> Vietnam . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Plymouth become twinned with Plymouth?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Plymouth . ?e_2 <pred:name> Plymouth . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Gotha start being located in the administrative territorial entity of Gotha?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Gotha . ?e_2 <pred:name> Gotha . ?e_1 <located in the administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in the administrative territorial entity> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact that connects two works named Bolt?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Bolt . ?e_2 <pred:name> Bolt . ?e_1 <derivative work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative work> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the main subject of the Transformers?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Transformers . ?e_2 <pred:name> Transformers . ?e_1 <main subject> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <main subject> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the narrative location of Istanbul according to Istanbul?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Istanbul . ?e_2 <pred:name> Istanbul . ?e_1 <narrative location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative location> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Carlisle that is related to containing settlements?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Carlisle . ?e_2 <pred:name> Carlisle . ?e_1 <contains settlement> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains settlement> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Saginaw equal to 51508 and does it have a subreddit with the same name?",
        "sparql": "ASK { ?e <pred:name> Saginaw . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> Saginaw . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"51508.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Cardiff 361,468?",
        "sparql": "ASK { ?e <pred:name> Cardiff . ?e <official name> ?pv_1 . ?pv_1 <pred:value> Cardiff . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"361468.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Newark 405220 and does it have a native label of Newark?",
        "sparql": "ASK { ?e <pred:name> Newark . ?e <native label> ?pv_1 . ?pv_1 <pred:value> Newark . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"405220.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Kassel 195422 and does it have a native label of Kassel?",
        "sparql": "ASK { ?e <pred:name> Kassel . ?e <native label> ?pv_1 . ?pv_1 <pred:value> Kassel . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"195422.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Guinea-Bissau have an official name of Guinea-Bissau and a Human Development Index of 0.418?",
        "sparql": "ASK { ?e <pred:name> Guinea-Bissau . ?e <official name> ?pv_1 . ?pv_1 <pred:value> Guinea-Bissau . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.418\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Cheyenne's native label Cheyenne and its population 59466.0?",
        "sparql": "ASK { ?e <pred:name> Cheyenne . ?e <native label> ?pv_1 . ?pv_1 <pred:value> Cheyenne . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"59466.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Harare's native label also Harare and does it have a population of 1.606e+06?",
        "sparql": "ASK { ?e <pred:name> Harare . ?e <native label> ?pv_1 . ?pv_1 <pred:value> Harare . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.606e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cameroon have a subreddit and a Human Development Index of 0.436?",
        "sparql": "ASK { ?e <pred:name> Cameroon . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> Cameroon . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of the entity named Hercules also Hercules?",
        "sparql": "ASK { ?e <pred:name> Hercules . ?e <title> ?pv . ?pv <pred:value> Hercules .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the official name of Danube also Danube?",
        "sparql": "ASK { ?e <pred:name> Danube . ?e <official name> ?pv . ?pv <pred:value> Danube .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of the entity named Jewel also Jewel?",
        "sparql": "ASK { ?e <pred:name> Jewel . ?e <title> ?pv . ?pv <pred:value> Jewel .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Liberia have a subreddit with the same name?",
        "sparql": "ASK { ?e <pred:name> Liberia . ?e <subreddit> ?pv . ?pv <pred:value> Liberia .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the native label of Redding equal to Redding?",
        "sparql": "ASK { ?e <pred:name> Redding . ?e <native label> ?pv . ?pv <pred:value> Redding .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of the entity named Battleship also Battleship?",
        "sparql": "ASK { ?e <pred:name> Battleship . ?e <title> ?pv . ?pv <pred:value> Battleship .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the TV show Cheers have a subreddit with the same name?",
        "sparql": "ASK { ?e <pred:name> Cheers . ?e <subreddit> ?pv . ?pv <pred:value> Cheers .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of Selma Selma?",
        "sparql": "ASK { ?e <pred:name> Selma . ?e <title> ?pv . ?pv <pred:value> Selma .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of Pleasantville also Pleasantville?",
        "sparql": "ASK { ?e <pred:name> Pleasantville . ?e <title> ?pv . ?pv <pred:value> Pleasantville .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the native label of Marche equal to Marche?",
        "sparql": "ASK { ?e <pred:name> Marche . ?e <native label> ?pv . ?pv <pred:value> Marche .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit named Harlem?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Harlem . ?e <subreddit> ?pv . ?pv <pred:value> Harlem . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the full name of the organization with the short name BBC?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> BBC . ?e <short name> ?pv . ?pv <pred:value> BBC . [ <pred:fact_h> ?e ; <pred:fact_r> <short name> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate for Redding's native label?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Redding . ?e <native label> ?pv . ?pv <pred:value> Redding . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the title \"Daylight\" in the statement about Daylight?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Daylight . ?e <title> ?pv . ?pv <pred:value> Daylight . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the Twitter hashtag Charlottesville for the entity named Charlottesville?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Charlottesville . ?e <Twitter hashtag> ?pv . ?pv <pred:value> Charlottesville . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter hashtag> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Oman?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Oman . ?e <subreddit> ?pv . ?pv <pred:value> Oman . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Hobart officially become the name of Hobart?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Hobart . ?e <official name> ?pv . ?pv <pred:value> Hobart . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate for the fact that Sabrina has the title Sabrina?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Sabrina . ?e <title> ?pv . ?pv <pred:value> Sabrina . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the title \"Ali\"?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Ali . ?e <title> ?pv . ?pv <pred:value> Ali . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Iceland?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Iceland . ?e <subreddit> ?pv . ?pv <pred:value> Iceland . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]