[{"question": "Is there a phenomenon with an IPTC Newscode of mediatopic/20000441?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000441\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000441\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000441\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the ISNI 0000 0001 2222 3895 associated with a college?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2222 3895\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2222 3895\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2222 3895\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the marketing have a RIA Novosti reference of 61684885?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"61684885\" . [ <pred:fact_h> ?e ; <pred:fact_r> <RIA_Novosti_reference> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"61684885\" . ?e <RIA_Novosti_reference> ?pv . ?pv <pred:value> \"61684885\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a biology subject with a Dewey Decimal Classification of 590?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"biology\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"590\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"590\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"590\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is http://www.cammell-laird.com the official website of a business?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cammell-laird.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.cammell-laird.com/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cammell-laird.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the neighborhood with postal code 02119 have a postal code equal to 02119?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"02119\" . [ <pred:fact_h> ?e ; <pred:fact_r> <postal_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"02119\" . ?e <postal_code> ?pv . ?pv <pred:value> \"02119\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is http://www.nintendo.co.jp/wii/rwsj/index.html the official website of an entertainment entity?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.nintendo.co.jp/wii/rwsj/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.nintendo.co.jp/wii/rwsj/index.html\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.nintendo.co.jp/wii/rwsj/index.html\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the saxophone classified as 422.212-71 according to the Hornbostel-Sachs classification?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"saxophone\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"422.212-71\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"422.212-71\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"422.212-71\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the writer with ISNI 0000 0001 0873 3741 the same person as the one with ISNI 0000 0001 0873 3741?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 0873 3741\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website \"https://www.treasury.gov/about/Pages/Secretary.aspx\" the same as the official website of an entity that is considered official?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a fiction with an IAB code of 642 and a fact_t value of 642?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"fiction\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"642\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a homicide with a Dewey Decimal Classification of 364.66?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"homicide\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"364.66\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"364.66\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"364.66\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the CANTIC-ID of Mormonism equal to a11336638?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11336638\" . [ <pred:fact_h> ?e ; <pred:fact_r> <CANTIC-ID> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"a11336638\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11336638\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an initialism that has a Dewey Decimal Classification of 306.7663 and a subreddit called \"lesbians\" with the same Dewey Decimal Classification?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"306.7663\" . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a doctrine with a Dewey Decimal Classification of 211.7 and an IAB code of 454?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"doctrine\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"211.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"211.7\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"454\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the opera titled \"Elektra\" with a number of parts equal to 1.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <number_of_parts_of_this_work_of_art> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_parts_of_this_work_of_art> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.0\" . ?e <title> ?pv . ?pv <pred:value> \"Elektra\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a subreddit for lesbians that falls under the LGBT category and has a Dewey Decimal Classification of 306.7663?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"306.7663\" . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a funk subreddit that also has an electro subreddit?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"funk\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"electro\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"electro\" . ?e <subreddit> ?pv . ?pv <pred:value> \"electro\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the animation have a number of episodes equal to 56.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animation\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"56.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"56.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an empire with a demonym of Byzantin and an OSM tag or key of Tag:historic:civilization=byzantine?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"Byzantin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Byzantin\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:historic:civilization=byzantine\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Library of Congress Classification for Christianity BR1644-1644.7?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Library_of_Congress_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the organization with the official website http://www.cammell-laird.com the same as the organization with the official website http://www.cammell-laird.com?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cammell-laird.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.cammell-laird.com/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cammell-laird.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a single with an OCLC control number of 16386945 and a fact_t value of 16386945?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"16386945\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"16386945\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"16386945\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a drama with a Dewey Decimal Classification of 809.2523?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"drama\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"809.2523\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the association with ISNI 0000 0004 1936 7478 the same as the one with ISNI 0000 0004 1936 7478?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1936 7478\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0004 1936 7478\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1936 7478\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a road with a length of 2451.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <length> ?pv_1 . ?pv_1 <pred:value> \"2451.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <length> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2451.0\" . ?e <length> ?pv . ?pv <pred:value> \"2451.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a film with a duration of 98.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"98.0\" . ?e <duration> ?pv . ?pv <pred:value> \"98.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a folklore with an Iconclass notation of 95 and 94?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"folklore\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"95\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"94\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a clarinet with a Dewey Decimal Classification of 788.65 and a Hornbostel-Sachs classification of 422.211.2-71?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"clarinet\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"788.65\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"788.65\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"422.211.2-71\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an entity that is both red and has an sRGB color hex triplet of FF2400?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"red\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"FF2400\" . [ <pred:fact_h> ?e ; <pred:fact_r> <sRGB_color_hex_triplet> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"FF2400\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"FF2400\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a miniseries with a duration of 177.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"177.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"177.0\" . ?e <duration> ?pv . ?pv <pred:value> \"177.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an album with a duration of 1744.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"1744.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1744.0\" . ?e <duration> ?pv . ?pv <pred:value> \"1744.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a capital city with a Dewey Decimal Classification of 2--43712?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43712\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2--43712\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--43712\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a violin with a Hornbostel-Sachs classification of 321.322-71?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"violin\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322-71\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"321.322-71\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322-71\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the dog with catalog code 111 have a catalog code of 111?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <catalog_code> ?pv_1 . ?pv_1 <pred:value> \"111\" . [ <pred:fact_h> ?e ; <pred:fact_r> <catalog_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"111\" . ?e <catalog_code> ?pv . ?pv <pred:value> \"111\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a residue with an Iconclass notation of 41B152 and a fact_t value of 41B152?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"residue\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"41B152\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"41B152\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"41B152\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the award http://www.whiting.org/awards/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.whiting.org/awards/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.whiting.org/awards/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.whiting.org/awards/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a screenwriter with an ISCO occupation code of 2451 and a ROME Occupation Code (v3) of E1102?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"screenwriter\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2451\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"E1102\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the medal http://www.ras.org.uk/awards-and-grants/awards?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Library of Congress Classification for Protestantism BR1644-1644.7?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Library_of_Congress_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city with an elevation above sea level of 50.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:value> \"50.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation_above_sea_level> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"50.0\" . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"50.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is http://www.sachsen-coburg-gotha.de/ the official website of the family whose official website is also http://www.sachsen-coburg-gotha.de/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"family\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.sachsen-coburg-gotha.de/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.sachsen-coburg-gotha.de/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sachsen-coburg-gotha.de/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the river with a discharge of 168700.0 also have a discharge of 168700.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <discharge> ?pv_1 . ?pv_1 <pred:value> \"168700.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <discharge> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"168700.0\" . ?e <discharge> ?pv . ?pv <pred:value> \"168700.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a bobsleigh with an IPTC Newscode of mediatopic/20001055?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"bobsleigh\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20001055\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20001055\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20001055\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an airline with an IATA airline designator of UA and a Corporate Number (Japan) of 3700150005378?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <IATA_airline_designator> ?pv_1 . ?pv_1 <pred:value> \"UA\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IATA_airline_designator> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"UA\" . ?e <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"3700150005378\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a techno subreddit that also has a minimal subreddit?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"minimal\" . ?e <subreddit> ?pv . ?pv <pred:value> \"minimal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the government with ISNI 0000 0001 2230 8442 the same as the one with ISNI 0000 0001 2230 8442?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"government\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2230 8442\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2230 8442\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2230 8442\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a synthesizer that has a Hornbostel-Sachs classification of 54?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"synthesizer\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"54\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"54\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"54\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the duo with ISNI 0000 0001 0728 0445 the same as the one with ISNI 0000 0001 0728 0445?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"duo\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0728 0445\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 0728 0445\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0728 0445\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a painting with a height of 171.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"painting\" . ?e <height> ?pv_1 . ?pv_1 <pred:value> \"171.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <height> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"171.0\" . ?e <height> ?pv . ?pv <pred:value> \"171.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"Iron Man 2\" the title of the soundtrack?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Iron Man 2\" . ?e <title> ?pv . ?pv <pred:value> \"Iron Man 2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the manga http://tezukaosamu.net?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://tezukaosamu.net\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a sea with an area of 214000.0 square miles and a vertical depth of 2100.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"214000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <area> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"214000.0\" . ?e <vertical_depth> ?pv . ?pv <pred:value> \"2100.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the comedy genre have a TV show with 25 episodes and 1 season?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"25.0\" . ?e <number_of_seasons> ?pv . ?pv <pred:value> \"1.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]