[
    {
        "question": "Does the University of Santo Tomas, whose ISNI is 0000 0004 1937 1119, have a student count greater than arg4?",
        "sparql": "ASK { ?e <pred:name> \"University of Santo Tomas\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1937 1119\" . ?e <students count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Yu-Gi-Oh! Duel Monsters have more than 224 episodes and a unit of 1 with a value greater than arg4?",
        "sparql": "ASK { ?e <pred:name> \"Yu-Gi-Oh! Duel Monsters\" . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"224.0\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Kensal Green Cemetery have more than one burial (the one with National Heritage List for England number 1080633)?",
        "sparql": "ASK { ?e <pred:name> \"Kensal Green Cemetery\" . ?e <National Heritage List for England number> ?pv_1 . ?pv_1 <pred:value> \"1080633\" . ?e <quantity buried> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Boeing 747 have a stall speed of 250.0 and has produced more than arg4 units?",
        "sparql": "ASK { ?e <pred:name> \"Boeing 747\" . ?e <stall speed> ?pv_1 . ?pv_1 <pred:value> \"250.0\" . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does The New York Times Company have an Alexa rank greater than 143242.0 and a unit of 1 with a value greater than arg4?",
        "sparql": "ASK { ?e <pred:name> \"The New York Times Company\" . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"143242.0\" . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the book \"Planet of the Apes\" with ISBN-13 978-4-488-63201-4 have more than arg4 pages?",
        "sparql": "ASK { ?e <pred:name> \"Planet of the Apes\" . ?e <ISBN-13> ?pv_1 . ?pv_1 <pred:value> \"978-4-488-63201-4\" . ?e <number of pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Genesis have an attendance greater than 1.43e+07 and another attendance greater than arg4?",
        "sparql": "ASK { ?e <pred:name> \"Genesis\" . ?e <attendance> ?pv_1 . ?pv_1 <pred:value> \"1.43e+07\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the United States presidential election in 2008 have more than 2.13314e+08 eligible voters with a unit of 1 and a value greater than arg4?",
        "sparql": "ASK { ?e <pred:name> \"United States presidential election, 2008\" . ?e <eligible voters> ?pv_1 . ?pv_1 <pred:value> \"2.13314e+08\" . ?e <eligible voters> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the 2008 Tour de France have more than arg4 participants and an edition number of 95?",
        "sparql": "ASK { ?e <pred:name> \"2008 Tour de France\" . ?e <edition number> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <number of participants> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Sinhala have more than arg4 speakers and an Ethnologue.com language code of sin?",
        "sparql": "ASK { ?e <pred:name> \"Sinhala\" . ?e <Ethnologue.com language code> ?pv_1 . ?pv_1 <pred:value> \"sin\" . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Logan International Airport have a patronage greater than arg4 and an FAA airport code of BOS?",
        "sparql": "ASK { ?e <pred:name> \"Logan International Airport\" . ?e <FAA airport code> ?pv_1 . ?pv_1 <pred:value> \"BOS\" . ?e <patronage> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one with Dewey Decimal Classification of 2--6668) and Ivory Coast (the one with a Human Development Index of 0.444)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6668\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.444\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the area of the U.S. city whose population is 25514.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25514.0\"^^xsd:double . ?e <area> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which sovereign state has a Human Development Index less than arg1, was founded on 1931-12-09, has a basic form of government as a republic, and what is its name?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1931-12-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <basic form of government> ?qpv . ?qpv <pred:value> \"republic\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What miniseries was published on 1990-11-18 in the United States of America, has only one season, and has a number of seasons less than arg1?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <number of seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1990-11-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <country> ?qpv . ?qpv <pred:value> \"United States of America\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who died on 2018-11-30, had less than arg1 children, and was located in the Central Time Zone?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <date of death> ?pv_1 . ?pv_1 <pred:date> \"2018-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date of death> ; <pred:fact_t> ?pv_1 ] <located in time zone> ?qpv . ?qpv <pred:value> \"Central Time Zone\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the area of the U.S. city whose population is 25514.0 and has an area of 37.5618?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25514.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"37.5618\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film has a box office greater than arg1 and a cost of 1.5e+08?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . ?e <cost> ?pv_1 . ?pv_1 <pred:value> \"1.5e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has a population greater than arg1 and a WOEID of 2475403?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2475403\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which television series has more than arg1 episodes and exactly 1710 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"1710.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which agent has an Alexa rank greater than arg1 and a second Alexa rank of 380.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"380.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which video game console model has sold more than arg1 units and has a price of 299.99?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <units sold> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . ?e <price> ?pv_1 . ?pv_1 <pred:value> \"299.99\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which metropolitan area has a population of 6.155e+06 and a population greater than arg4?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv . ?pv <pred:value> \"6.155e+06\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg4\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6.155e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the city of Summit's official website, which is http://www.cityofsummit.org/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Summit\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.cityofsummit.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the Orkney Islands start having the NUTS code UKM65?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Orkney Islands\" . ?e <NUTS code> ?pv . ?pv <pred:value> \"UKM65\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS code> ; <pred:fact_t> ?pv ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the subject's role for the TOID 4000000074552364 of Burton upon Trent?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Burton upon Trent\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074552364\" . [ <pred:fact_h> ?e ; <pred:fact_r> <TOID> ; <pred:fact_t> ?pv ] <subject has role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the legislative body for Bharatiya Janata Party, which has 117 representatives in an organization/legislature?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:value> \"117.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of representatives in an organization/legislature> ; <pred:fact_t> ?pv ] <legislative body> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the dynasty with a native label of Plantagen\u00eat end before January 1st, 1485 (according to a statement with Gregorian date earlier than 1584)?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1485-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved, abolished or demolished> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <native label> ?pv . ?pv <pred:value> \"Plantagen\u00eat\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Pan Am operate the aircraft functional class that entered service on 1970-01-22 and had a total production of 1527.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <service entry> ?pv_1 . ?pv_1 <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv_1 ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" . ?e <total produced> ?pv . ?pv <pred:value> \"1527.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What metropolitan area had a population of 2.71049e+06 on January 1st, 2014 and had a population greater than arg1?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"2.71049e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What film had an attendance greater than arg1 on 2018-05-30 and had an attendance of 8446.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv ] <start time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date . ?e <attendance> ?pv_1 . ?pv_1 <pred:value> \"8446.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of the metropolitan area with a population of 6.155e+06?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.155e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6.155e+06\" . ?e <country> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one with Dewey Decimal Classification of 2--6668) and Ivory Coast (the one whose inception date is 1960-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6668\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Sound of Music (the one with a duration of 174.0) and The Sound of Music (the one with a date of first performance of 1959-11-16)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Sound of Music\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"174.0\" . ?e_2 <pred:name> \"The Sound of Music\" . ?e_2 <date of first performance> ?pv_1 . ?pv_1 <pred:date> \"1959-11-16\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the book Harry Potter and the Goblet of Fire (with ISBN-10 0-7475-4624-X) and the publication date of November 6, 2005?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_1 <ISBN-10> ?pv . ?pv <pred:value> \"0-7475-4624-X\" . ?e_2 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-06\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Roger Moore (the one whose CANTIC-ID is a11858722) and Roger Moore (the one born on 1900-09-21)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roger Moore\" . ?e_1 <CANTIC-ID> ?pv . ?pv <pred:value> \"a11858722\" . ?e_2 <pred:name> \"Roger Moore\" . ?e_2 <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1900-09-21\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a U.S. city whose area is 2.32141e+08?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"2.32141e+08\" . ?e <area> ?pv . ?pv <pred:value> \"2.32141e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the sovereign state have a Human Development Index of 0.452?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.452\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.452\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a class of instruments with MCN code 8306.10.00?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of instruments\" . ?e <MCN code> ?pv_1 . ?pv_1 <pred:value> \"8306.10.00\" . ?e <MCN code> ?pv . ?pv <pred:value> \"8306.10.00\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the political party have a member count of 1.1e+08?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <member count> ?pv_1 . ?pv_1 <pred:value> \"1.1e+08\" . ?e <member count> ?pv . ?pv <pred:value> \"1.1e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Golden Globe Award ceremony have an edition number of 60?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Golden Globe Award ceremony\" . ?e <edition number> ?pv_1 . ?pv_1 <pred:value> \"60\" . ?e <edition number> ?pv . ?pv <pred:value> \"60\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the cruise ship with an IMO ship number of 5059953 have the same IMO ship number as its identifier?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cruise ship\" . ?e <IMO ship number> ?pv_1 . ?pv_1 <pred:value> \"5059953\" . ?e <IMO ship number> ?pv . ?pv <pred:value> \"5059953\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the television series have exactly 39 episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"television series\" . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"39.0\" . ?e <number of episodes> ?pv . ?pv <pred:value> \"39.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the video game developer with Corporate Number (Japan) 6120901008215 have the same Corporate Number (Japan)?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game developer\" . ?e <Corporate Number (Japan)> ?pv_1 . ?pv_1 <pred:value> \"6120901008215\" . ?e <Corporate Number (Japan)> ?pv . ?pv <pred:value> \"6120901008215\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]