[
    {
        "question": "Is the governor who has the official website http://governor.ky.gov/ the same as the one whose <pred:fact t> is also http://governor.ky.gov/?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> governor . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://governor.ky.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"http://governor.ky.gov/\" . ?e <official website> ?pv . ?pv <pred:value> \"http://governor.ky.gov/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a drama with a Dewey Decimal Classification of 809.2523 and a fact t of 809.2523? And does it also have another Dewey Decimal Classification of 809.2523?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> drama . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"809.2523\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"809.2523\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the National Heritage List for England number of the palace with ISNI 0000 0001 2149 5119?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> palace . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2149 5119\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0000 0001 2149 5119\" . ?e <National Heritage List for England number> ?pv . ?pv <pred:value> \"1117776\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a democracy in the British Museum person-institution with the value of 180889?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British Museum person-institution> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"180889\" . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"180889\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a clarinet with Dewey Decimal Classification of 788.65 and Hornbostel-Sachs classification of 422.211.2-71?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> clarinet . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"788.65\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"788.65\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"422.211.2-71\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Nicosia 330,000 and does it have a Dewey Decimal Classification of 2--5693?",
        "sparql": "ASK { ?e <pred:name> Nicosia . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--5693\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"330000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Annapolis 39418 and its area 20.9917?",
        "sparql": "ASK { ?e <pred:name> Annapolis . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"20.9917\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"39418.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Rostock 203431 and does it have a Dewey Decimal Classification of 2--431745?",
        "sparql": "ASK { ?e <pred:name> Rostock . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--431745\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"203431.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Calvados have an annual number of weddings equal to 2686.0 and a Dewey Decimal Classification of 2--4422?",
        "sparql": "ASK { ?e <pred:name> Calvados . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4422\" . ?e <annual number of weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2686.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Adrian have 1 season and 9.0 episodes?",
        "sparql": "ASK { ?e <pred:name> Adrian . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"9.0\" . ?e <number of seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Sherlock have 13 episodes with a unit of 1?",
        "sparql": "ASK { ?e <pred:name> Sherlock . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"13.0\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Burbank 103340 and does it have a Dewey Decimal Classification of 2--79493?",
        "sparql": "ASK { ?e <pred:name> Burbank . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79493\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"103340.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Gelderland have a population of 2.01969e+06 and a Dewey Decimal Classification of 2--49218?",
        "sparql": "ASK { ?e <pred:name> Gelderland . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--49218\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.01969e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Fife 371400 and does it have a Dewey Decimal Classification of 2--4129?",
        "sparql": "ASK { ?e <pred:name> Fife . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4129\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"371400.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Shanxi, whose China administrative division code is 14, 3.65e+07?",
        "sparql": "ASK { ?e <pred:name> Shanxi . ?e <China administrative division code> ?pv_1 . ?pv_1 <pred:value> \"14\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.65e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Algeria (the one whose inception is 1962-01-01) and Algeria (the one whose Human Development Index is 0.743)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Algeria . ?e_1 <inception> ?pv . ?pv <pred:date> \"1962-01-01\"^^xsd:date . ?e_2 <pred:name> Algeria . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.743\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the TV show Animaniacs (which has a publication date of 1997-03-07) and the fact that it has 99 episodes?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Animaniacs . ?e_1 <publication date> ?pv . ?pv <pred:date> \"1997-03-07\"^^xsd:date . ?e_2 <pred:name> Animaniacs . ?e_2 <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"99.0\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Spain (the one whose inception date is 1931-12-09) and Spain (the one whose UIC alphabetical country code is E)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Spain . ?e_1 <inception> ?pv . ?pv <pred:date> \"1931-12-09\"^^xsd:date . ?e_2 <pred:name> Spain . ?e_2 <UIC alphabetical country code> ?pv_1 . ?pv_1 <pred:value> \"E\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Bremen (the one whose inception date is 1646-01-01) and Bremen (the one with a German municipality key of 04011000)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Bremen . ?e_1 <inception> ?pv . ?pv <pred:date> \"1646-01-01\"^^xsd:date . ?e_2 <pred:name> Bremen . ?e_2 <German municipality key> ?pv_1 . ?pv_1 <pred:value> \"04011000\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Moldavia (the one that was dissolved, abolished or demolished in 1859) and Moldavia (the one with the short name  )?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Moldavia . ?e_1 <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"1859-01-01\"^^xsd:date . ?e_2 <pred:name> Moldavia . ?e_2 <short name> ?pv_1 . ?pv_1 <pred:value> \" \" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the Portland whose inception date is 1851-02-08 and the Portland whose area is 179.852?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Portland . ?e_1 <inception> ?pv . ?pv <pred:date> \"1851-02-08\"^^xsd:date . ?e_2 <pred:name> Portland . ?e_2 <area> ?pv_1 . ?pv_1 <pred:value> \"179.852\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Turkmenistan (the one whose inception date is 1991-10-27) and Turkmenistan (the one whose Human Development Index is 0.671)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Turkmenistan . ?e_1 <inception> ?pv . ?pv <pred:date> \"1991-10-27\"^^xsd:date . ?e_2 <pred:name> Turkmenistan . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.671\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kosovo (the one with an inception date of 2008-02-17) and Kosovo (the one with an IOC country code of KOS)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Kosovo . ?e_1 <inception> ?pv . ?pv <pred:date> \"2008-02-17\"^^xsd:date . ?e_2 <pred:name> Kosovo . ?e_2 <IOC country code> ?pv_1 . ?pv_1 <pred:value> \"KOS\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Albania (the one whose inception date is 1912-01-01) and Albania (the one whose Human Development Index is 0.628)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Albania . ?e_1 <inception> ?pv . ?pv <pred:date> \"1912-01-01\"^^xsd:date . ?e_2 <pred:name> Albania . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.628\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Afghanistan (the one whose inception date is 1747-01-01) and Afghanistan (the one with ISO 3166-1 alpha-2 code AF)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Afghanistan . ?e_1 <inception> ?pv . ?pv <pred:date> \"1747-01-01\"^^xsd:date . ?e_2 <pred:name> Afghanistan . ?e_2 <ISO 3166-1 alpha-2 code> ?pv_1 . ?pv_1 <pred:value> \"AF\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of the village whose name in native language is Bronxville equal to 6323.0 and also has a name in English of Bronxville?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . ?e <name in native language> ?pv . ?pv <pred:value> \"Bronxville\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name in native language> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"Bronxville\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a filmmaking instance with 56 episodes, each of which is 56.0 units long?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> filmmaking . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . ?e <number of episodes> ?pv . ?pv <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"56.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the agent with ISNI 0000 0001 2172 7549 and a venue with 80 seats?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <number of seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2172 7549\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0000 0001 2172 7549\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a war with a number of deaths equal to 1.7e+07?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> war . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.7e+07\"^^xsd:double . ?e <number of deaths> ?pv . ?pv <pred:value> \"1.7e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.7e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the capital city with 4787 employees and a Twitter username of PrahaEU, whose number of subscribers is 7776?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4787.0\"^^xsd:double . ?e <Twitter username> ?pv . ?pv <pred:value> \"PrahaEU\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv . ?qpv <pred:value> \"7776.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an animation with 56 episodes, each lasting 56.0 units?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> animation . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . ?e <number of episodes> ?pv . ?pv <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"56.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the cemetery with a native label of \"Cimetire de Montmartre\" and 20,000 graves in existence?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> cemetery . ?e <number of graves> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20000.0\"^^xsd:double . ?e <native label> ?pv . ?pv <pred:value> \"Cimetire de Montmartre\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"Cimetire de Montmartre\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Rwanda have a Human Development Index of 0.479?",
        "sparql": "ASK { ?e <pred:name> Rwanda . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.479\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Nanjing have a population of 8.1878e+06?",
        "sparql": "ASK { ?e <pred:name> Nanjing . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.1878e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Zeeland have a population of 380726.0?",
        "sparql": "ASK { ?e <pred:name> Zeeland . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"380726.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Patna have a population of 1.68422e+06?",
        "sparql": "ASK { ?e <pred:name> Patna . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.68422e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Kilkenny have a population of 22179.0?",
        "sparql": "ASK { ?e <pred:name> Kilkenny . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"22179.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Bilbao 345821?",
        "sparql": "ASK { ?e <pred:name> Bilbao . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"345821.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Lansing 114297?",
        "sparql": "ASK { ?e <pred:name> Lansing . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"114297.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Gotha have a population of 45410.0?",
        "sparql": "ASK { ?e <pred:name> Gotha . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"45410.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Tripoli have a population of 1.126e+06?",
        "sparql": "ASK { ?e <pred:name> Tripoli . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.126e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the FIPS 10-4 code for Jersey, which has a population of 87186.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Jersey . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"87186.0\"^^xsd:double . ?e <FIPS 10-4 (countries and regions)> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Idaho, which has a population of 712567.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Idaho . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"712567.0\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official website of Passaic, which has a population of 69781?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Passaic . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"69781.0\"^^xsd:double . ?e <official website> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official website of Kokomo, the city with a population of 45468.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Kokomo . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"45468.0\"^^xsd:double . ?e <official website> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the NIS/INS code for Bruges, which has an annual number of weddings of 455.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Bruges . ?e <annual number of weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"455.0\"^^xsd:double . ?e <NIS/INS code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the time zone that Bellingham is located in and has a population of 80885.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Bellingham . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80885.0\"^^xsd:double . ?e <located in time zone> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]