[{"question": "What is Greenwich named after?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Greenwich\" . ?e_2 <pred:name> \"Greenwich\" . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Malibu named after?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Malibu\" . ?e_2 <pred:name> \"Malibu\" . ?e_1 <named_after> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <named_after> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Jersey?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Jersey\" . ?e_2 <pred:name> \"Jersey\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of the Philippines?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Philippines\" . ?e_2 <pred:name> \"Philippines\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Leeds?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Leeds\" . ?e_2 <pred:name> \"Leeds\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Maryland?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Maryland\" . ?e_2 <pred:name> \"Maryland\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity that Greenland is located in?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Greenland\" . ?e_2 <pred:name> \"Greenland\" . ?e_1 <located_in_the_administrative_territorial_entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located_in_the_administrative_territorial_entity> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the role of the object in the statement that Guernsey is different from Guernsey?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Guernsey\" . ?e_2 <pred:name> \"Guernsey\" . ?e_1 <different_from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different_from> ; <pred:fact_t> ?e_2 ] <object_has_role> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What role does Mulan have in the publication of Mulan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Mulan\" . ?e_2 <pred:name> \"Mulan\" . ?e_1 <published_in> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <published_in> ; <pred:fact_t> ?e_2 ] <subject_has_role> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did England replace England?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"England\" . ?e_2 <pred:name> \"England\" . ?e_1 <replaces> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <replaces> ; <pred:fact_t> ?e_2 ] <point_in_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the series ordinal of the Airport series?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Airport\" . ?e_2 <pred:name> \"Airport\" . ?e_1 <part_of_the_series> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_2 ] <series_ordinal> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of Moon?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Moon\" . ?e_2 <pred:name> \"Moon\" . ?e_1 <narrative_location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative_location> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital of Stockport?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Stockport\" . ?e_2 <pred:name> \"Stockport\" . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the next part of the series after Saw?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Saw\" . ?e_2 <pred:name> \"Saw\" . ?e_1 <part_of_the_series> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <part_of_the_series> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the performer that Shakira performed with?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Shakira\" . ?e_2 <pred:name> \"Shakira\" . ?e_1 <performer> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <performer> ; <pred:fact_t> ?e_2 ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bendigo equal to 95587.0?", "sparql": "ASK { ?e <pred:name> \"Bendigo\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Bendigo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"95587.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Akron 199,110?", "sparql": "ASK { ?e <pred:name> \"Akron\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Akron\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"199110.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Homeland have a title equal to \"Homeland\" and a number of episodes equal to 84.0?", "sparql": "ASK { ?e <pred:name> \"Homeland\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Homeland\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"84.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Brno 344,218?", "sparql": "ASK { ?e <pred:name> \"Brno\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Brno\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"344218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Alaska have a subreddit with the value \"Alaska\" and a population of 738,432?", "sparql": "ASK { ?e <pred:name> \"Alaska\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Alaska\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"738432.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Warwick 32719.0?", "sparql": "ASK { ?e <pred:name> \"Warwick\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Warwick\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"32719.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Budapest 1,735,710?", "sparql": "ASK { ?e <pred:name> \"Budapest\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Budapest\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.73571e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pakistan have a subreddit named \"Pakistan\" and a Human Development Index of 0.538?", "sparql": "ASK { ?e <pred:name> \"Pakistan\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Pakistan\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.538\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Waltham 60632.0?", "sparql": "ASK { ?e <pred:name> \"Waltham\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Waltham\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"60632.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Brescia 196,359?", "sparql": "ASK { ?e <pred:name> \"Brescia\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Brescia\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"196359.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Trier 114,914?", "sparql": "ASK { ?e <pred:name> \"Trier\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Trier\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"114914.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Linz 204,846?", "sparql": "ASK { ?e <pred:name> \"Linz\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Linz\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"204846.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Zimbabwe have a subreddit with the value \"Zimbabwe\" and a Human Development Index of 0.509?", "sparql": "ASK { ?e <pred:name> \"Zimbabwe\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Zimbabwe\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.509\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Sheffield 569,700?", "sparql": "ASK { ?e <pred:name> \"Sheffield\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Sheffield\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"569700.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bronxville 6323.0?", "sparql": "ASK { ?e <pred:name> \"Bronxville\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Bronxville\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6323.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the X-Men series have a title of \"X-Men\" and a total of 76 episodes?", "sparql": "ASK { ?e <pred:name> \"X-Men\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"X-Men\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"76.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Aquitaine 3.31689e+06 and its native label also Aquitaine?", "sparql": "ASK { ?e <pred:name> \"Aquitaine\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Aquitaine\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.31689e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nord-Pas-de-Calais have a native label equal to \"Nord-Pas-de-Calais\" and a population of 4.06074e+06?", "sparql": "ASK { ?e <pred:name> \"Nord-Pas-de-Calais\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Nord-Pas-de-Calais\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.06074e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bloemfontein 256,185?", "sparql": "ASK { ?e <pred:name> \"Bloemfontein\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Bloemfontein\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"256185.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Botswana have a subreddit with the value \"Botswana\" and a Human Development Index of 0.518?", "sparql": "ASK { ?e <pred:name> \"Botswana\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Botswana\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.518\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Wilmington 112,067?", "sparql": "ASK { ?e <pred:name> \"Wilmington\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Wilmington\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"112067.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Versailles have a title of \"Versailles\" and a number of episodes equal to 30.0?", "sparql": "ASK { ?e <pred:name> \"Versailles\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Versailles\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"30.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Darmstadt 150,155?", "sparql": "ASK { ?e <pred:name> \"Darmstadt\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Darmstadt\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"150155.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Monza 123,000?", "sparql": "ASK { ?e <pred:name> \"Monza\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Monza\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"123000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nashville have a title equal to \"Nashville\" and a number of episodes equal to 108.0?", "sparql": "ASK { ?e <pred:name> \"Nashville\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Nashville\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"108.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hoboken 50005?", "sparql": "ASK { ?e <pred:name> \"Hoboken\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Hoboken\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50005.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Abidjan 4.98e+06?", "sparql": "ASK { ?e <pred:name> \"Abidjan\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Abidjan\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.98e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Arkansas have a subreddit with the value \"Arkansas\" and a population of 1.57445e+06?", "sparql": "ASK { ?e <pred:name> \"Arkansas\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Arkansas\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.57445e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Eureka have a title equal to \"Eureka\" and a number of episodes equal to 77.0?", "sparql": "ASK { ?e <pred:name> \"Eureka\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Eureka\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"77.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Human Development Index of Madagascar equal to 0.505?", "sparql": "ASK { ?e <pred:name> \"Madagascar\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Madagascar\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.505\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the show Deadwood have a title equal to \"Deadwood\" and a number of episodes equal to 36.0?", "sparql": "ASK { ?e <pred:name> \"Deadwood\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Deadwood\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"36.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Poughkeepsie have a native label equal to \"Poughkeepsie\" and a population of 32736?", "sparql": "ASK { ?e <pred:name> \"Poughkeepsie\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Poughkeepsie\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"32736.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Rostock 203431?", "sparql": "ASK { ?e <pred:name> \"Rostock\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Rostock\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"203431.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Comoros have a subreddit named \"Comoros\" and a Human Development Index of 0.499?", "sparql": "ASK { ?e <pred:name> \"Comoros\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Comoros\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.499\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Angel\" have a title equal to \"Angel\" and 110.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Angel\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Angel\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"110.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bari equal to 326,344?", "sparql": "ASK { ?e <pred:name> \"Bari\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Bari\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"326344.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does California have a subreddit named \"California\" and 2 representatives in an organization/legislature?", "sparql": "ASK { ?e <pred:name> \"California\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"California\" . ?e <number_of_representatives_in_an_organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Racine 78860?", "sparql": "ASK { ?e <pred:name> \"Racine\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Racine\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"78860.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pisa have a native label equal to \"Pisa\" and a population of 87353?", "sparql": "ASK { ?e <pred:name> \"Pisa\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Pisa\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"87353.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the female population of Rockville 31869.0?", "sparql": "ASK { ?e <pred:name> \"Rockville\" . ?e <name> ?pv_1 . ?pv_1 <pred:value> \"Rockville\" . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"31869.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Sunnyvale 140,081?", "sparql": "ASK { ?e <pred:name> \"Sunnyvale\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Sunnyvale\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"140081.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Lille equal to 231491?", "sparql": "ASK { ?e <pred:name> \"Lille\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Lille\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"231491.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Afrikaans have a native label equal to \"Afrikaans\" and a number of speakers equal to 7.2e+06?", "sparql": "ASK { ?e <pred:name> \"Afrikaans\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Afrikaans\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.2e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hobart 222,356?", "sparql": "ASK { ?e <pred:name> \"Hobart\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Hobart\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"222356.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Starbucks have a Twitter username of \"Starbucks\" and 238,000 employees?", "sparql": "ASK { ?e <pred:name> \"Starbucks\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"Starbucks\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"238000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Oakland have a native label equal to \"Oakland\" and a population of 390724.0?", "sparql": "ASK { ?e <pred:name> \"Oakland\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Oakland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"390724.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does France have a native label equal to \"France\" and a Human Development Index of 0.848?", "sparql": "ASK { ?e <pred:name> \"France\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"France\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.848\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Chihuahua 878,062?", "sparql": "ASK { ?e <pred:name> \"Chihuahua\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Chihuahua\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"878062.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Friends\" have a title equal to \"Friends\" and a total of 236.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Friends\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Friends\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"236.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Shreveport 199,311?", "sparql": "ASK { ?e <pred:name> \"Shreveport\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Shreveport\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"199311.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Koblenz 112,586?", "sparql": "ASK { ?e <pred:name> \"Koblenz\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Koblenz\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"112586.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Szczecin equal to 407,047?", "sparql": "ASK { ?e <pred:name> \"Szczecin\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Szczecin\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"407047.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Alias have a title equal to \"Alias\" and a number of episodes equal to 105.0?", "sparql": "ASK { ?e <pred:name> \"Alias\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Alias\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"105.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Milan 701,401?", "sparql": "ASK { ?e <pred:name> \"Milan\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Milan\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"701401.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Odense 186595?", "sparql": "ASK { ?e <pred:name> \"Odense\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Odense\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"186595.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Human Development Index of Salvador equal to 0.759?", "sparql": "ASK { ?e <pred:name> \"Salvador\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Salvador\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.759\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Suzhou have a subreddit and a population of 5.845e+06?", "sparql": "ASK { ?e <pred:name> \"Suzhou\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Suzhou\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.845e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the movie Titanic have a title equal to \"Titanic\" and a number of episodes equal to 2.0?", "sparql": "ASK { ?e <pred:name> \"Titanic\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Titanic\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Lansing equal to 114297?", "sparql": "ASK { ?e <pred:name> \"Lansing\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Lansing\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"114297.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]