[{"question": "What is the Library of Congress Classification for Christianity (the one whose classification is BR1644-1644.7)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the initialism with a value of 306.7663?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ICD-10 code for stroke?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"stroke\" . ?e <ICD-10> ?pv_1 . ?pv_1 <pred:value> \"I61\" . ?e <ICD-10> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the sorority with the website http://www.tridelta.org?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sorority\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tridelta.org\" . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Stack Exchange tag for the management category?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"management\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/project-management\" . ?e <Stack_Exchange_tag> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the NACE code of the industry with NACE code \"C\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <NACE_code> ?pv_1 . ?pv_1 <pred:value> \"C\" . ?e <NACE_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of a homicide with a value of 364.66?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"homicide\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"364.66\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the entity with the name \"official\" that has the official website \"https://www.treasury.gov/about/Pages/Secretary.aspx\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ACM Classification Code (2012) for the foundation with the code 10011263?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10011263\" . ?e <ACM_Classification_Code_(2012)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the crime with ICD-9 code E960.1 have the same ICD-9 code?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <ICD-9> ?pv_1 . ?pv_1 <pred:value> \"E960.1\" . ?e <ICD-9> ?pv . ?pv <pred:value> \"E960.1\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the film have a box office of 2.05e+08?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <box_office> ?pv_1 . ?pv_1 <pred:value> \"2.05e+08\" . ?e <box_office> ?pv . ?pv <pred:value> \"2.05e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the dynasty have a Swedish Anbytarforum value of 6918.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <Swedish_Anbytarforum> ?pv_1 . ?pv_1 <pred:value> \"6918.0\" . ?e <Swedish_Anbytarforum> ?pv . ?pv <pred:value> \"6918.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a clarinet with a Dewey Decimal Classification of 788.65?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"clarinet\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"788.65\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"788.65\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a melodrama with an IAB code of 642?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"melodrama\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the music have an IAB code of 344?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"344\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"344\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city/town with a Dewey Decimal Classification of 2--4779?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4779\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4779\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the symptom with DiseasesDB ID 25363 have the same DiseasesDB ID as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"25363\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"25363\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an impresario with the ROME Occupation Code (v3) of L1303?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"impresario\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"L1303\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1303\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the entity with ICD-10 code R10 represent pain?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"pain\" . ?e <ICD-10> ?pv_1 . ?pv_1 <pred:value> \"R10\" . ?e <ICD-10> ?pv . ?pv <pred:value> \"R10\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the entity with an IAB code of 69 belong to the category of equity?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"equity\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"69\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"69\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a technology with a Classification of Instructional Programs code of 11.0103?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"technology\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"11.0103\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"11.0103\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a science with an ACM Classification Code (2012) of 10002979?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10002979\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10002979\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a sea with an area of 214000.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"214000.0\" . ?e <area> ?pv . ?pv <pred:value> \"214000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a guitar with a Hornbostel-Sachs classification of 321.322?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a fiction with an IAB code of 642?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"fiction\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the death with Iconclass notation 31E21 have the same Iconclass notation as another death with Iconclass notation 31E21?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"death\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"31E21\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"31E21\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does basketball have the IAB code 489?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"489\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"489\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the profession with SOC Code (2010) 11-1021 the same as the profession with SOC Code (2010) 11-1021?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <SOC_Code_(2010)> ?pv_1 . ?pv_1 <pred:value> \"11-1021\" . ?e <SOC_Code_(2010)> ?pv . ?pv <pred:value> \"11-1021\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the governor (whose name is \"governor\") http://governor.ky.gov/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://governor.ky.gov/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://governor.ky.gov/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an actor with the NOC Occupation Code of 5232?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"actor\" . ?e <NOC_Occupation_Code> ?pv_1 . ?pv_1 <pred:value> \"5232\" . ?e <NOC_Occupation_Code> ?pv . ?pv <pred:value> \"5232\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the novel \"Watchmen\" http://www.dccomics.com/watchmen?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.dccomics.com/watchmen\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dccomics.com/watchmen\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the process have an IPTC Newscode of mediatopic/20000737?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"process\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000737\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a mathematician with an ISCO occupation code of 2122?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematician\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2122\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2122\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the band with ISNI 0000 0001 1089 9660 have the same ISNI as its name?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1089 9660\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1089 9660\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the university with ISNI 0000 0001 2214 904X have the same ISNI value?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2214 904X\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2214 904X\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the foundation have an ACM Classification Code (2012) of 10011263?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10011263\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10011263\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the duo with ISNI 0000 0001 0728 0445 have the same ISNI as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"duo\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0728 0445\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0728 0445\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the state with British Museum person-institution code 191764 have a British Museum person-institution code of 191764?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"191764\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"191764\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a school with a Hornbostel-Sachs classification of 211.212.1?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"211.212.1\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"211.212.1\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the comedy genre have a TV show with exactly 25 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"25.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a peninsula with an area of 622918.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"peninsula\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"622918.0\" . ?e <area> ?pv . ?pv <pred:value> \"622918.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the college with ISNI 0000 0004 0499 5877 have the same ISNI as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0499 5877\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0499 5877\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a lawyer with an ISCO occupation code of 2421?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"lawyer\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2421\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2421\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a screenwriter with an ISCO occupation code of 2451?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"screenwriter\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the position with Iconclass notation 44B151211 have the same Iconclass notation?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"44B151211\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"44B151211\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a monarch with an IPTC Newscode of mediatopic/20000704?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"monarch\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000704\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000704\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"The Life of Henry the Fifth\" the title of a play?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Life of Henry the Fifth\" . ?e <title> ?pv . ?pv <pred:value> \"The Life of Henry the Fifth\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a nationality with a population of 6e+06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"nationality\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6e+06\" . ?e <population> ?pv . ?pv <pred:value> \"6e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Islam have a Dewey Decimal Classification of 297.82?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"297.82\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"297.82\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a miniseries with exactly 11 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"11.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"11.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a subject in mathematics with a Classification of Instructional Programs code of 27.0301?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematics\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"27.0301\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"27.0301\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the occupation with Iconclass notation 13H2 exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"13H2\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"13H2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the stroke have an ICD-10 code of I61?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"stroke\" . ?e <ICD-10> ?pv_1 . ?pv_1 <pred:value> \"I61\" . ?e <ICD-10> ?pv . ?pv <pred:value> \"I61\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the neighborhood with postal code 02119 have a postal code of 02119?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"02119\" . ?e <postal_code> ?pv . ?pv <pred:value> \"02119\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a landform with an area of 11190.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"11190.0\" . ?e <area> ?pv . ?pv <pred:value> \"11190.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an art with Dewey Decimal Classification of 820?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"820\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"820\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an initialism with a Dewey Decimal Classification of 306.7663?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"306.7663\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.7663\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Christianity have the Library of Congress Classification of BR1644-1644.7?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a drama with Dewey Decimal Classification of 809.2523 and 792.23?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"drama\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"792.23\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an announcer with an ISCO occupation code of 2451?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"announcer\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the seminary with ISNI 0000 0001 2184 9191 have the same ISNI value as 0000 0001 2184 9191?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"seminary\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2184 9191\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2184 9191\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the stop-motion have 56 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"stop-motion\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"56.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a scientist with an ISCO occupation code of 2212?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2212\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"https://stackoverflow.com/tags/project-management\" a Stack Exchange tag for management?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"management\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/project-management\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/project-management\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the folklore have an Iconclass notation of 95?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"folklore\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the campus with ISNI 0000 0001 2150 6738 have the same ISNI value as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2150 6738\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2150 6738\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is \"https://www.treasury.gov/about/Pages/Secretary.aspx\" the official website of an official?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a religion with a Library of Congress Classification of BR1644-1644.7?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the conservatory with ISNI 0000 0001 2325 014X have the same ISNI as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2325 014X\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2325 014X\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the residue with Iconclass notation 41B152 have the same Iconclass notation as itself?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"residue\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"41B152\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"41B152\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does vegetarianism have an IAB code of 212?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"vegetarianism\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"212\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"212\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Armondo Munoz the birth name of a superhero?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Armondo Munoz\" . ?e <birth_name> ?pv . ?pv <pred:value> \"Armondo Munoz\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]