[{"question": "Is the population of Sardinia 1.65865e+06 and its Dewey Decimal Classification 2--459?", "sparql": "ASK { ?e <pred:name> \"Sardinia\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--459\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.65865e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Jackson 67685 and the area 151.417?", "sparql": "ASK { ?e <pred:name> \"Jackson\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"151.417\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"67685.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Kanpur 2.70132e+06 and the area 3.029e+09?", "sparql": "ASK { ?e <pred:name> \"Kanpur\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"3.029e+09\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.70132e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the movie \"It\" have a duration of 180.0 minutes and 2.0 episodes?", "sparql": "ASK { ?e <pred:name> \"It\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"180.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Tyrol 739,002 and does it have a Dewey Decimal Classification of 2--43642?", "sparql": "ASK { ?e <pred:name> \"Tyrol\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43642\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"739002.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Sunnyvale, with an ISNI of 0000 0004 0601 4083, have a population of 140081?", "sparql": "ASK { ?e <pred:name> \"Sunnyvale\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0601 4083\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"140081.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Zimbabwe have a Dewey Decimal Classification of 2--6891 and a Human Development Index of 0.509?", "sparql": "ASK { ?e <pred:name> \"Zimbabwe\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6891\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.509\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Frasier have a Dewey Decimal Classification of 791.4572 and a number of episodes equal to 264.0?", "sparql": "ASK { ?e <pred:name> \"Frasier\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"791.4572\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"264.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Huntington 48113.0 and the area 47.8153?", "sparql": "ASK { ?e <pred:name> \"Huntington\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"47.8153\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"48113.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Dessau equal to 83616.0 and has a NUTS code of DEE11?", "sparql": "ASK { ?e <pred:name> \"Dessau\" . ?e <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"DEE11\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"83616.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Allahabad 5.95439e+06 and the area 82.0?", "sparql": "ASK { ?e <pred:name> \"Allahabad\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"82.0\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.95439e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Washington equal to 1.35662e+06 and does it have a British Museum person-institution value of 100674?", "sparql": "ASK { ?e <pred:name> \"Washington\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"100674\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.35662e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hildesheim 275330.0 and its Dewey Decimal Classification 2--435958?", "sparql": "ASK { ?e <pred:name> \"Hildesheim\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--435958\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"275330.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Clearwater 107,685 and its Dewey Decimal Classification 2--75963?", "sparql": "ASK { ?e <pred:name> \"Clearwater\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--75963\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"107685.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Senegal have a Human Development Index of 0.422 and a British Museum person-institution ID of 185171?", "sparql": "ASK { ?e <pred:name> \"Senegal\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"185171\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.422\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Emilia-Romagna have a Dewey Decimal Classification of 2--454 and a Human Development Index of 0.909?", "sparql": "ASK { ?e <pred:name> \"Emilia-Romagna\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--454\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.909\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Dallas have a total of 357 episodes?", "sparql": "ASK { ?e <pred:name> \"Dallas\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"357.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"357.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Salzburg 545,742 and its Dewey Decimal Classification 2--4363?", "sparql": "ASK { ?e <pred:name> \"Salzburg\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4363\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"545742.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Henderson 257,729 and the area 272.433?", "sparql": "ASK { ?e <pred:name> \"Henderson\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"272.433\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"257729.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Pisa 87353 and its Dewey Decimal Classification 2--45551?", "sparql": "ASK { ?e <pred:name> \"Pisa\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--45551\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"87353.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Fringe have 100 episodes?", "sparql": "ASK { ?e <pred:name> \"Fringe\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"100.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"100.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Fremont 214,089 and its Dewey Decimal Classification 2--79465?", "sparql": "ASK { ?e <pred:name> \"Fremont\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79465\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"214089.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bruges (the one with NIS/INS code 31005) have an annual number of weddings equal to 455.0?", "sparql": "ASK { ?e <pred:name> \"Bruges\" . ?e <NIS/INS_code> ?pv_1 . ?pv_1 <pred:value> \"31005\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"455.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Yuma 93064.0 and the area 313.62?", "sparql": "ASK { ?e <pred:name> \"Yuma\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"313.62\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"93064.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Ipswich 163,000 and the elevation above sea level 50.0?", "sparql": "ASK { ?e <pred:name> \"Ipswich\" . ?e <elevation_above_sea_level> ?pv_1 . ?pv_1 <pred:value> \"50.0\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"163000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Riverside 303,871 and its Dewey Decimal Classification 2--79497?", "sparql": "ASK { ?e <pred:name> \"Riverside\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79497\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"303871.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bas-Rhin 1.12141e+06 and does it have a Dewey Decimal Classification of 2--44395?", "sparql": "ASK { ?e <pred:name> \"Bas-Rhin\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--44395\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.12141e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Portland 66937 and its area 179.852?", "sparql": "ASK { ?e <pred:name> \"Portland\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"179.852\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66937.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Fergie have 1 child?", "sparql": "ASK { ?e <pred:name> \"Fergie\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"fergie\" . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pashto have a Dewey Decimal Classification of 491.593 and a number of speakers equal to 3.86e+07?", "sparql": "ASK { ?e <pred:name> \"Pashto\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"491.593\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.86e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ghent (the one with Dewey Decimal Classification 2--493142) have an annual number of weddings equal to 1157.0?", "sparql": "ASK { ?e <pred:name> \"Ghent\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--493142\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1157.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ghana have a Dewey Decimal Classification of 2--667 and a Human Development Index of 0.427?", "sparql": "ASK { ?e <pred:name> \"Ghana\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--667\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.427\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hillsboro 91611.0 and the area 64.7384?", "sparql": "ASK { ?e <pred:name> \"Hillsboro\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"64.7384\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"91611.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Chittagong (WOEID: 1915031) 2.58164e+06?", "sparql": "ASK { ?e <pred:name> \"Chittagong\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"1915031\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.58164e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Messina 236,962 and its Dewey Decimal Classification 2--458111?", "sparql": "ASK { ?e <pred:name> \"Messina\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--458111\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"236962.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Latvia have a Dewey Decimal Classification of 2--4796 and a Human Development Index of 0.806?", "sparql": "ASK { ?e <pred:name> \"Latvia\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4796\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.806\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Sacramento 466,488 and its Dewey Decimal Classification 2--79454?", "sparql": "ASK { ?e <pred:name> \"Sacramento\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79454\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"466488.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Douala 2.44694e+06 and the area 210.0?", "sparql": "ASK { ?e <pred:name> \"Douala\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"210.0\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.44694e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Taxi have a duration of 25.0 and a number of episodes of 114.0?", "sparql": "ASK { ?e <pred:name> \"Taxi\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"114.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Stockton 291,707 and its Dewey Decimal Classification 2--79455?", "sparql": "ASK { ?e <pred:name> \"Stockton\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79455\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"291707.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Paterson, with ISNI 0000 0004 0419 528X, have a population of 78347?", "sparql": "ASK { ?e <pred:name> \"Paterson\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0419 528X\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"78347.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Cranston 80387 and the area 77.5462?", "sparql": "ASK { ?e <pred:name> \"Cranston\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"77.5462\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80387.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Baltimore have a population of 620961 and a British Museum person-institution value of 67273?", "sparql": "ASK { ?e <pred:name> \"Baltimore\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"67273\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"620961.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does FromSoftware, with a Corporate Number (Japan) of 1011001020415, have 218 employees?", "sparql": "ASK { ?e <pred:name> \"FromSoftware\" . ?e <Corporate_Number_(Japan)> ?pv_1 . ?pv_1 <pred:value> \"1011001020415\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Afrikaans have a GOST 7.75-97 code of \u0430\u0444\u0440 070 and a number of speakers equal to 7.2e+06?", "sparql": "ASK { ?e <pred:name> \"Afrikaans\" . ?e <GOST_7.75\u201397_code> ?pv_1 . ?pv_1 <pred:value> \"\u0430\u0444\u0440 070\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.2e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Plymouth (the one with FIPS 10-4 code UKK4) 267,918?", "sparql": "ASK { ?e <pred:name> \"Plymouth\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKK4\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"267918.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bulawayo 653,337 and its Dewey Decimal Classification 2--6891?", "sparql": "ASK { ?e <pred:name> \"Bulawayo\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6891\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"653337.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Angola have a Human Development Index of 0.401 and a British Museum person-institution value of 182804?", "sparql": "ASK { ?e <pred:name> \"Angola\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"182804\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.401\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Brixton 78536 and does it have an OS grid reference of TQ315755?", "sparql": "ASK { ?e <pred:name> \"Brixton\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ315755\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"78536.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Providence 178,042 and its area 53.274?", "sparql": "ASK { ?e <pred:name> \"Providence\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"53.274\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"178042.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Mauritius have a Dewey Decimal Classification of 2--6982 and a Human Development Index of 0.674?", "sparql": "ASK { ?e <pred:name> \"Mauritius\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6982\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.674\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Ogden 83793.0 and the area 70.5872?", "sparql": "ASK { ?e <pred:name> \"Ogden\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"70.5872\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"83793.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Strasbourg 279,284 and its Dewey Decimal Classification 2--443954?", "sparql": "ASK { ?e <pred:name> \"Strasbourg\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--443954\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"279284.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Waltham 60632.0 and the area 35.6448?", "sparql": "ASK { ?e <pred:name> \"Waltham\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"35.6448\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"60632.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ubisoft have a Giphy username of \"ubisoft\" and 11779 employees?", "sparql": "ASK { ?e <pred:name> \"Ubisoft\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"ubisoft\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"11779.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the atomic number of calcium 20.0 and its CAS Registry Number 7440-70-2?", "sparql": "ASK { ?e <pred:name> \"calcium\" . ?e <CAS_Registry_Number> ?pv_1 . ?pv_1 <pred:value> \"7440-70-2\" . ?e <atomic_number> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Wales have a population of 3.113e+06 and a British Museum person-institution value of 117209?", "sparql": "ASK { ?e <pred:name> \"Wales\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"117209\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.113e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kalamazoo have a PermID of 5035881551 and a population of 74262?", "sparql": "ASK { ?e <pred:name> \"Kalamazoo\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"5035881551\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"74262.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does DL-methionine have a pKa value of 2.29 and a CAS Registry Number of 59-51-8?", "sparql": "ASK { ?e <pred:name> \"DL-methionine\" . ?e <CAS_Registry_Number> ?pv_1 . ?pv_1 <pred:value> \"59-51-8\" . ?e <pKa> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.29\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Spokane 208,916 and the area 180.018?", "sparql": "ASK { ?e <pred:name> \"Spokane\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"180.018\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"208916.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bloomington 82893 and the area 9.951e+07?", "sparql": "ASK { ?e <pred:name> \"Bloomington\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"9.951e+07\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"82893.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Gameloft have a Giphy username of \"gameloft\" and 6200 employees?", "sparql": "ASK { ?e <pred:name> \"Gameloft\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"gameloft\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6200.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Leicestershire (the one with FIPS 10-4 code UKH5) 1.0438e+06?", "sparql": "ASK { ?e <pred:name> \"Leicestershire\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKH5\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0438e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Catalonia (the one whose CANTIC-ID is a11446948) have a Human Development Index of 0.904?", "sparql": "ASK { ?e <pred:name> \"Catalonia\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11446948\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.904\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Victoria 26450 and does it have a Dewey Decimal Classification of 2--696?", "sparql": "ASK { ?e <pred:name> \"Victoria\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--696\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"26450.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Vienna 1.49487e+06 and its Dewey Decimal Classification 2--43613?", "sparql": "ASK { ?e <pred:name> \"Vienna\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43613\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.49487e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ethiopia have a Dewey Decimal Classification of 2--63 and a Human Development Index of 0.423?", "sparql": "ASK { ?e <pred:name> \"Ethiopia\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--63\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.423\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Reno (with PermID 5000410682) 245,255?", "sparql": "ASK { ?e <pred:name> \"Reno\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"5000410682\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"245255.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Malaysia have a Dewey Decimal Classification of 2--5951 and a Human Development Index of 0.777?", "sparql": "ASK { ?e <pred:name> \"Malaysia\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--5951\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.777\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Brisbane 4282.0 and the area 51.9989?", "sparql": "ASK { ?e <pred:name> \"Brisbane\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"51.9989\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4282.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]