[{"question": "Is the band with ISNI 0000 0001 1089 9660 the same as the one with ISNI 0000 0001 1089 9660?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1089 9660\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 1089 9660\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1089 9660\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a trance subreddit that also has a subreddit called psytrance?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"psytrance\" . ?e <subreddit> ?pv . ?pv <pred:value> \"psytrance\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the occupation code of the critic 2451?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"critic\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a newspaper with a length of 22.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <length> ?pv_1 . ?pv_1 <pred:value> \"22.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <length> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"22.0\" . ?e <length> ?pv . ?pv <pred:value> \"22.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a businessperson with an Iconclass notation of 46A613 and a ROME Occupation Code (v3) of M1207?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"businessperson\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"46A613\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"46A613\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"M1207\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an impresario with a ROME Occupation Code (v3) of L1303 and a fact_t value of L1303?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"impresario\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"L1303\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"L1303\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1303\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the seminary with ISNI 0000 0001 2184 9191 the same as the one with ISNI 0000 0001 2184 9191?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"seminary\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2184 9191\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2184 9191\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2184 9191\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a process with an IPTC Newscode of mediatopic/20000737 and a fact_t value of mediatopic/20000737?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"process\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000737\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000737\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the ISNI 0000 0001 2166 5093 associated with a conservatory?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2166 5093\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2166 5093\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2166 5093\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a sport with an IAB code of 498?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"498\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"498\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"498\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a country that has a British Museum person-institution value of 114921?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"114921\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British_Museum_person-institution> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"114921\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"114921\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a tragedy with a Dewey Decimal Classification of 809.2523 and 792.23?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"tragedy\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"792.23\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a psychosis with DiseasesDB ID 11890 and fact_t value 11890?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"psychosis\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"11890\" . [ <pred:fact_h> ?e ; <pred:fact_r> <DiseasesDB> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"11890\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"11890\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a mythology with an Iconclass notation of 95 and 94?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"95\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"94\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a cemetery with an NRHP reference number of 97000830 and a fact_t value of 97000830?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <NRHP_reference_number> ?pv_1 . ?pv_1 <pred:value> \"97000830\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NRHP_reference_number> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"97000830\" . ?e <NRHP_reference_number> ?pv . ?pv <pred:value> \"97000830\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a science with an ACM Classification Code (2012) of 10002979 and a fact_t value of 10002979?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10002979\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ACM_Classification_Code_(2012)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"10002979\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10002979\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a concept with an IPTC Newscode of worldregion/r001 and an M.49 code of 001?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"concept\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"worldregion/r001\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"worldregion/r001\" . ?e <M.49_code> ?pv . ?pv <pred:value> \"001\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a merchant with an Iconclass notation of 48A831?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"merchant\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"48A831\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"48A831\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"48A831\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a democracy that has a British Museum person-institution value of 180889 and a fact_t value of 180889?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British_Museum_person-institution> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"180889\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"180889\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an equity with an IAB code of 69 and a fact_t value of 69?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"equity\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"69\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"69\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"69\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a vegetarianism instance with an IAB code of 212 and an OSM tag or key of Key:diet:vegan?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"vegetarianism\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"212\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"212\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Key:diet:vegan\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a method with an IPTC Newscode of mediatopic/20000037 and a fact_t of mediatopic/20000037?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"method\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000037\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000037\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000037\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the state with IPTC Newscode mediatopic/20000801 have a pronunciation audio file named LL-Q5146 (por)-NMaia-pobreza.wav?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000801\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000801\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"LL-Q5146 (por)-NMaia-pobreza.wav\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the author with ISNI 0000 0001 0873 3741 the same as the one with ISNI 0000 0001 0873 3741?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 0873 3741\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a school with an ARCHON code of 1143 and a British Museum person-institution code of 132031?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"1143\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1143\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"132031\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a star with an absolute magnitude of 4.83?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"star\" . ?e <absolute_magnitude> ?pv_1 . ?pv_1 <pred:value> \"4.83\" . [ <pred:fact_h> ?e ; <pred:fact_r> <absolute_magnitude> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"4.83\" . ?e <absolute_magnitude> ?pv . ?pv <pred:value> \"4.83\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a landform with an ISO 3166-2 code of NZ-S and also has an ISO 3166-2 code of NZ-S?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"NZ-S\" . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"NZ-S\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a zither with a Hornbostel-Sachs classification of 314.122-5?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"zither\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"314.122-5\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"314.122-5\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"314.122-5\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website of the musical http://aladdinthemusical.com?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://aladdinthemusical.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://aladdinthemusical.com\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://aladdinthemusical.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the ISNI 0000 0000 5930 3891 the same as the ISNI 0000 0000 5930 3891 for a human?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 5930 3891\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0000 5930 3891\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 5930 3891\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a lake with an area of 82350.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"lake\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"82350.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <area> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"82350.0\" . ?e <area> ?pv . ?pv <pred:value> \"82350.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a Serbo-Croatian language with a Glottolog code of serb1264 and a Dewey Decimal Classification of 491.82?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"serb1264\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"serb1264\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"491.82\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an artist with an ISCO occupation code of 2453 and a ROME Occupation Code (v3) of L1202?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"artist\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2453\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2453\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1202\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is mathematics classified under the Classification of Instructional Programs code 27.0301?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematics\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"27.0301\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Classification_of_Instructional_Programs_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"27.0301\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"27.0301\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a connection between Islam and the Dewey Decimal Classification 297.82 (the one whose OSM tag or key is Tag:denomination=shia)?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"297.82\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"297.82\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:denomination=shia\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a republic that has a British Museum person-institution value of 180889?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British_Museum_person-institution> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"180889\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"180889\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is http://www.tridelta.org the official website of a sorority?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sorority\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.tridelta.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.tridelta.org\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.tridelta.org\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a Chinese language with a Glottolog code of yuec1235?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Chinese\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"yuec1235\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"yuec1235\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"yuec1235\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a crime with ICD-9 code E960.1 and eMedicine code 806120?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <ICD-9> ?pv_1 . ?pv_1 <pred:value> \"E960.1\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ICD-9> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"E960.1\" . ?e <eMedicine> ?pv . ?pv <pred:value> \"806120\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a research with an IPTC Newscode of mediatopic/20000737 and a fact_t of mediatopic/20000737?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"research\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000737\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000737\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a property with an Iconclass notation of 31E21?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"property\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"31E21\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"31E21\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"31E21\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a village with a WOEID of 2369745 and a WOEID of 2369745?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2369745\" . [ <pred:fact_h> ?e ; <pred:fact_r> <WOEID> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2369745\" . ?e <WOEID> ?pv . ?pv <pred:value> \"2369745\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official website \"https://www.hopkinsmedicine.org/som/index.html\" related to the campus with ISNI 0000 0001 2150 6738?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2150 6738\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2150 6738\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.hopkinsmedicine.org/som/index.html\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an actor with both NOC Occupation Code and ROME Occupation Code (v3) equal to 5232 and L1204 respectively?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"actor\" . ?e <NOC_Occupation_Code> ?pv_1 . ?pv_1 <pred:value> \"5232\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NOC_Occupation_Code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"5232\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"L1204\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the native label \"Speaker of the United States House of Representatives\" associated with the speaker?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Speaker of the United States House of Representatives\" . ?e <native_label> ?pv . ?pv <pred:value> \"Speaker of the United States House of Representatives\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a basketball subreddit with an IAB code of 489 and a subreddit name of CollegeBasketball?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"489\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"489\" . ?e <subreddit> ?pv . ?pv <pred:value> \"CollegeBasketball\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a museum with an ARCHON code of 345 and a fact_t value of 345?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"345\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the anthology with OCLC control number 357792 have 218.0 pages?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"357792\" . ?e <number_of_pages> ?pv . ?pv <pred:value> \"218.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the taxon with EPPO Code 1CICHF and ITIS TSN 169770 the same?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <EPPO_Code> ?pv_1 . ?pv_1 <pred:value> \"1CICHF\" . [ <pred:fact_h> ?e ; <pred:fact_r> <EPPO_Code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1CICHF\" . ?e <ITIS_TSN> ?pv . ?pv <pred:value> \"169770\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a piano with a Hornbostel-Sachs classification of 511?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"piano\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"511\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"511\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"511\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there any art with a Dewey Decimal Classification of 820?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"820\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"820\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"820\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a genre that has an OLAC video game genre vocabulary of 1069 and a fact_t value of 1069?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <OLAC_video_game_genre_vocabulary> ?pv_1 . ?pv_1 <pred:value> \"1069\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OLAC_video_game_genre_vocabulary> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1069\" . ?e <OLAC_video_game_genre_vocabulary> ?pv . ?pv <pred:value> \"1069\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a drum with a Hornbostel-Sachs classification of 211.212.11?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"211.212.11\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"211.212.11\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"211.212.11\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a designer with an ISCO occupation code of 2141 and an OSM tag or key of Key:architect?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"designer\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2141\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2141\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Key:architect\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]