[
    {
        "question": "What entertainment was published on November 30th, 2006 for the Xbox 360 platform?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" . ?e <pred:instance of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin for the miniseries that was published on 1990-11-18 and was produced in the United States of America?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1990-11-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <country> ?qpv . ?qpv <pred:value> \"United States of America\" . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital of a place that has an instance of \"statement with Gregorian date earlier than 1584\" and a time of earliest written record of 1067-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"1067-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <time of earliest written record> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <capital of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the TeX string for the currency that applies to demand deposit and was established on 1999-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> currency . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <applies to part> ?qpv . ?qpv <pred:value> \"demand deposit\" . ?e <TeX string> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the organization whose inception was caused by the National Park Service Organic Act on 1916-08-25?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1916-08-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <has cause> ?qpv . ?qpv <pred:value> \"National Park Service Organic Act\" . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the place of birth of the human who died on 2000-01-31 at the stated age of 73.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <date of death> ?pv_1 . ?pv_1 <pred:date> \"2000-01-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date of death> ; <pred:fact_t> ?pv_1 ] <stated age at event> ?qpv . ?qpv <pred:value> \"73.0\" . ?e <place of birth> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the activity that was published on 2006-11-30 and has a platform of Xbox 360?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" . ?e <language of work or name> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the show titled Network have a duration of 121.0?",
        "sparql": "ASK { ?e <pred:name> Network . ?e <title> ?pv_1 . ?pv_1 <pred:value> Network . ?e <duration> ?pv . ?pv <pred:value> \"121.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of the title May 93.0?",
        "sparql": "ASK { ?e <pred:name> May . ?e <title> ?pv_1 . ?pv_1 <pred:value> May . ?e <duration> ?pv . ?pv <pred:value> \"93.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Nebraska have a title and a duration of 115.0?",
        "sparql": "ASK { ?e <pred:name> Nebraska . ?e <title> ?pv_1 . ?pv_1 <pred:value> Nebraska . ?e <duration> ?pv . ?pv <pred:value> \"115.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a person named Norman who has a Dictionary of Medieval Names from European Sources entry of Norman and a Caverphone code of NMN111?",
        "sparql": "ASK { ?e <pred:name> Norman . ?e <Dictionary of Medieval Names from European Sources entry> ?pv_1 . ?pv_1 <pred:value> Norman . ?e <Caverphone> ?pv . ?pv <pred:value> \"NMN111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of Lagaan 224.0?",
        "sparql": "ASK { ?e <pred:name> Lagaan . ?e <title> ?pv_1 . ?pv_1 <pred:value> Lagaan . ?e <duration> ?pv . ?pv <pred:value> \"224.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the movie Yentl have a box office of 4.02e+07?",
        "sparql": "ASK { ?e <pred:name> Yentl . ?e <title> ?pv_1 . ?pv_1 <pred:value> Yentl . ?e <box office> ?pv . ?pv <pred:value> \"4.02e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does riboflavin have an ATC code of A11HA04 and a World Health Organisation International Nonproprietary Name of riboflavin?",
        "sparql": "ASK { ?e <pred:name> riboflavin . ?e <World Health Organisation International Nonproprietary Name> ?pv_1 . ?pv_1 <pred:value> riboflavin . ?e <ATC code> ?pv . ?pv <pred:value> \"A11HA04\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Sting have an ISNI of 0000 0000 4519 6685 and a Twitter username of Sting?",
        "sparql": "ASK { ?e <pred:name> Sting . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> Sting . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 4519 6685\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Poaceae have an EPPO Code of 1GRAF and a taxon name of Poaceae?",
        "sparql": "ASK { ?e <pred:name> Poaceae . ?e <taxon name> ?pv_1 . ?pv_1 <pred:value> Poaceae . ?e <EPPO Code> ?pv . ?pv <pred:value> \"1GRAF\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What language pertains to the official website http://www.ucc.org/ regarding Protestantism?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Protestantism . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ucc.org/\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.ucc.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the position that has an official website of http://www.whitehouse.gov/about/first ladies/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> position . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.whitehouse.gov/about/first ladies/\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.whitehouse.gov/about/first ladies/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the manga that has an official website of http://tezukaosamu.net?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> manga . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" . ?e <official website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the interdisciplinarity classification code for the program with the Classification of Instructional Programs code of 05.0207?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> interdisciplinarity . ?e <Classification of Instructional Programs code> ?pv_1 . ?pv_1 <pred:value> \"05.0207\" . ?e <Classification of Instructional Programs code> ?pv . ?pv <pred:value> \"05.0207\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Classification of Instructional Programs code> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the science category on Yahoo Answers with category ID 396545303?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> science . ?e <Yahoo Answers category> ?pv_1 . ?pv_1 <pred:value> \"396545303\" . ?e <Yahoo Answers category> ?pv . ?pv <pred:value> \"396545303\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Yahoo Answers category> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate for Elektra's title in the opera named Elektra?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> opera . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Elektra\" . ?e <title> ?pv . ?pv <pred:value> \"Elektra\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the property associated with Iconclass notation 31E21?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> property . ?e <Iconclass notation> ?pv_1 . ?pv_1 <pred:value> \"31E21\" . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"31E21\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass notation> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the researcher whose KldB-2010 occupation code is 41284?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> researcher . ?e <KldB-2010 occupation code> ?pv_1 . ?pv_1 <pred:value> \"41284\" . ?e <KldB-2010 occupation code> ?pv . ?pv <pred:value> \"41284\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KldB-2010 occupation code> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate fact for the clarinet with Dewey Decimal Classification of 788.65?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> clarinet . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"788.65\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"788.65\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Iconclass notation for the entity that is a paranormal and has an Iconclass notation of 13A361?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> paranormal . ?e <Iconclass notation> ?pv_1 . ?pv_1 <pred:value> \"13A361\" . ?e <Iconclass notation> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of episodes for a filmmaking instance that has 56.0 as its number of episodes?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> filmmaking . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . ?e <number of episodes> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the WOEID of the metropolis that has a WOEID of 2211096?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2211096\" . ?e <WOEID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of a biology instance that has a value of 590 and another Dewey Decimal Classification?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> biology . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"590\" . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IPTC Newscode for the method with the mediatopic/20000037 value?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> method . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000037\" . ?e <IPTC Newscode> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of episodes for the animation with 56.0 as its number of episodes?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> animation . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . ?e <number of episodes> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the person with ISNI 0000 0000 2456 2682 belong to the human category?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 2456 2682\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 2456 2682\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an entity that has a Classification of Instructional Programs code of \"05.0207\" for both interdisciplinarity and another category?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> interdisciplinarity . ?e <Classification of Instructional Programs code> ?pv_1 . ?pv_1 <pred:value> \"05.0207\" . ?e <Classification of Instructional Programs code> ?pv . ?pv <pred:value> \"05.0207\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a crime with ICD-9 code E960.1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> crime . ?e <ICD-9> ?pv_1 . ?pv_1 <pred:value> \"E960.1\" . ?e <ICD-9> ?pv . ?pv <pred:value> \"E960.1\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the occupation code of the chemist equal to 2212?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> chemist . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2212\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact that distinguishes the Traffic with ISNI 0000 0001 1544 3179 from the Traffic with a publication date of 2001-03-09?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Traffic . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1544 3179\" . ?e_2 <pred:name> Traffic . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2001-03-09\"^^xsd:date . ?e_1 <different from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different from> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Grenada's demonym and inception date in relation to the country it belongs to?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Grenada . ?e_1 <demonym> ?pv . ?pv <pred:value> \"\" . ?e_2 <pred:name> Grenada . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index of Angola and when did Angola become a country?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Angola . ?e_1 <Human Development Index> ?pv . ?pv <pred:value> \"0.48\" . ?e_2 <pred:name> Angola . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Normandy (the one whose native label is Normandie) become different from another entity with the same name and what is the reason for this difference?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Normandy . ?e_1 <native label> ?pv . ?pv <pred:value> \"Normandie\" . ?e_2 <pred:name> Normandy . ?e_2 <start time> ?pv_1 . ?pv_1 <pred:date> \"2016-01-01\"^^xsd:date . ?e_1 <different from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different from> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the production cost of Bolt and when was its derivative work published?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Bolt . ?e_1 <cost> ?pv . ?pv <pred:value> \"1.5e+08\" . ?e_2 <pred:name> Bolt . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2009-02-13\"^^xsd:date . ?e_1 <derivative work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative work> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Mongolia and when did it become a country?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Mongolia . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--517\" . ?e_2 <pred:name> Mongolia . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1911-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the production cost of the derivative work of RoboCop (the one published on 2014-02-07)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> RoboCop . ?e_1 <cost> ?pv . ?pv <pred:value> \"1.3e+07\" . ?e_2 <pred:name> RoboCop . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2014-02-07\"^^xsd:date . ?e_1 <derivative work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative work> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publication date of the derivative work of Carrie (the one with the title \"Carrie\")?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Carrie . ?e_1 <title> ?pv . ?pv <pred:value> \"Carrie\" . ?e_2 <pred:name> Carrie . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"1977-04-22\"^^xsd:date . ?e_1 <derivative work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <derivative work> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Bahrain and when did it become a country, and what is the connection between them?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Bahrain . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--5365\" . ?e_2 <pred:name> Bahrain . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-08-14\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact that distinguishes Quadrophenia (the one with the title \"Quadrophenia\") from the one published on 1973-10-19?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> Quadrophenia . ?e_1 <title> ?pv . ?pv <pred:value> \"Quadrophenia\" . ?e_2 <pred:name> Quadrophenia . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"1973-10-19\"^^xsd:date . ?e_1 <different from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different from> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]