[{"question": "Does Adele (the one whose CANTIC-ID is a11706351) have 1 child?", "sparql": "ASK { ?e <pred:name> \"Adele\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11706351\" . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Livonia 96942 and the area 92.863?", "sparql": "ASK { ?e <pred:name> \"Livonia\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"92.863\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"96942.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bismarck 4913.0 and the area 87.3817?", "sparql": "ASK { ?e <pred:name> \"Bismarck\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"87.3817\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4913.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bari 326,344 and its Dewey Decimal Classification 2--457511?", "sparql": "ASK { ?e <pred:name> \"Bari\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--457511\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"326344.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Saginaw 51508.0 and the area 18.1?", "sparql": "ASK { ?e <pred:name> \"Saginaw\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"18.1\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"51508.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Trenton 84913 and the area 21.2492?", "sparql": "ASK { ?e <pred:name> \"Trenton\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"21.2492\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"84913.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bangladesh have a Dewey Decimal Classification of 2--5492 and a Human Development Index of 0.563?", "sparql": "ASK { ?e <pred:name> \"Bangladesh\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--5492\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.563\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Tabriz 1.495e+06 and its Dewey Decimal Classification 2--553?", "sparql": "ASK { ?e <pred:name> \"Tabriz\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--553\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.495e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Angel have a duration of 41.0 and 5.0 seasons?", "sparql": "ASK { ?e <pred:name> \"Angel\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"41.0\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Saxony-Anhalt have a population of 2.24547e+06 and a Consolidated code of the electronic catalog of libraries of Belarus equal to 2249653?", "sparql": "ASK { ?e <pred:name> \"Saxony-Anhalt\" . ?e <Consolidated_code_of_the_electronic_catalog_of_libraries_of_Belarus> ?pv_1 . ?pv_1 <pred:value> \"2249653\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.24547e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Sudan's FIPS 10-4 code \"SU\" and its Human Development Index 0.477?", "sparql": "ASK { ?e <pred:name> \"Sudan\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"SU\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.477\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Brandon 46061 and the area 4.6516e+08?", "sparql": "ASK { ?e <pred:name> \"Brandon\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"4.6516e+08\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"46061.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Thessaloniki 406,413 and its Dewey Decimal Classification 2--49565?", "sparql": "ASK { ?e <pred:name> \"Thessaloniki\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--49565\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"406413.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Guatemala have a Dewey Decimal Classification of 2--7281 and a Human Development Index of 0.455?", "sparql": "ASK { ?e <pred:name> \"Guatemala\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7281\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.455\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Italian have a GOST 7.75-97 code of \u0438\u0442\u0430 235 and a number of speakers equal to 3.026e+06?", "sparql": "ASK { ?e <pred:name> \"Italian\" . ?e <GOST_7.75\u201397_code> ?pv_1 . ?pv_1 <pred:value> \"\u0438\u0442\u0430 235\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.026e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Missoula with WOEID 2452373 equal to 12668.0?", "sparql": "ASK { ?e <pred:name> \"Missoula\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2452373\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"12668.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Natchez, with an ISNI of 0000 0001 0668 9396, have a population of 15792.0?", "sparql": "ASK { ?e <pred:name> \"Natchez\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0668 9396\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"15792.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Grenoble 160,779 and its Dewey Decimal Classification 2--445865?", "sparql": "ASK { ?e <pred:name> \"Grenoble\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--445865\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"160779.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Miami 346,681 and its Dewey Decimal Classification 2--759381?", "sparql": "ASK { ?e <pred:name> \"Miami\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--759381\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"346681.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Srinagar 1.18057e+06 and its Dewey Decimal Classification 2--546?", "sparql": "ASK { ?e <pred:name> \"Srinagar\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--546\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.18057e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Burnaby, whose Statistics Canada Geographic code is 5915025, equal to 232,755?", "sparql": "ASK { ?e <pred:name> \"Burnaby\" . ?e <Statistics_Canada_Geographic_code> ?pv_1 . ?pv_1 <pred:value> \"5915025\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"232755.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Bewitched have 8 seasons and 254 episodes?", "sparql": "ASK { ?e <pred:name> \"Bewitched\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"254.0\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Chillicothe 21796 and the area 27.4417?", "sparql": "ASK { ?e <pred:name> \"Chillicothe\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"27.4417\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"21796.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Rome have a duration of 50.0 and a number of episodes of 22.0?", "sparql": "ASK { ?e <pred:name> \"Rome\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"50.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"22.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Taipei equal to 2.69764e+06 and its FIPS 10-4 code TW03?", "sparql": "ASK { ?e <pred:name> \"Taipei\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"TW03\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.69764e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hove equal to 91900 and does it have an OS grid reference of TQ285055?", "sparql": "ASK { ?e <pred:name> \"Hove\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ285055\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"91900.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Guinea-Bissau have a Dewey Decimal Classification of 2--6657 and a Human Development Index of 0.418?", "sparql": "ASK { ?e <pred:name> \"Guinea-Bissau\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6657\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.418\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 208,157,000 speakers of French with a Dewey Decimal Classification of 440?", "sparql": "ASK { ?e <pred:name> \"French\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"440\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.08157e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Seine-et-Marne have an annual number of weddings equal to 4973.0 and a Dewey Decimal Classification of 2--4437?", "sparql": "ASK { ?e <pred:name> \"Seine-et-Marne\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4437\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4973.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Casablanca 3.63106e+06 and its Dewey Decimal Classification 2--6438?", "sparql": "ASK { ?e <pred:name> \"Casablanca\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6438\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.63106e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Exeter (with TOID 4000000074556577) 124,180?", "sparql": "ASK { ?e <pred:name> \"Exeter\" . ?e <TOID> ?pv_1 . ?pv_1 <pred:value> \"4000000074556577\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"124180.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Brunei's Dewey Decimal Classification 2--5955 and Human Development Index 0.819?", "sparql": "ASK { ?e <pred:name> \"Brunei\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--5955\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.819\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Isfahan 1.75613e+06 and does it have a Dewey Decimal Classification of 2--5595?", "sparql": "ASK { ?e <pred:name> \"Isfahan\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--5595\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.75613e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Dakar 1,146,050?", "sparql": "ASK { ?e <pred:name> \"Dakar\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--663\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.14605e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hoboken 50005 and the area 5.18023?", "sparql": "ASK { ?e <pred:name> \"Hoboken\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"5.18023\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50005.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Yvelines have an annual number of weddings equal to 4669.0 and a Dewey Decimal Classification of 2--44366?", "sparql": "ASK { ?e <pred:name> \"Yvelines\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--44366\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4669.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Romanian have a GOST 7.75-97 code of \u0440\u0443\u043c 565 and a number of speakers equal to 2.4e+07?", "sparql": "ASK { ?e <pred:name> \"Romanian\" . ?e <GOST_7.75\u201397_code> ?pv_1 . ?pv_1 <pred:value> \"\u0440\u0443\u043c 565\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.4e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Tashkent 2.3529e+06 and its Dewey Decimal Classification 2--587?", "sparql": "ASK { ?e <pred:name> \"Tashkent\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--587\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.3529e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nashville have a duration of 42.0 and a number of episodes of 108.0?", "sparql": "ASK { ?e <pred:name> \"Nashville\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"42.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"108.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Topeka 127,473 and the area 1.5921e+08?", "sparql": "ASK { ?e <pred:name> \"Topeka\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"1.5921e+08\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"127473.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Tyler 96900 and the area 147.996?", "sparql": "ASK { ?e <pred:name> \"Tyler\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"147.996\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"96900.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bhopal 1.88338e+06 and its Dewey Decimal Classification 2--543?", "sparql": "ASK { ?e <pred:name> \"Bhopal\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--543\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.88338e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Uxbridge (with WOEID 2510576) 13,457?", "sparql": "ASK { ?e <pred:name> \"Uxbridge\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2510576\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13457.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Saskatchewan 1.09835e+06 and its Dewey Decimal Classification 2--7124?", "sparql": "ASK { ?e <pred:name> \"Saskatchewan\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7124\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.09835e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Norwich 40493 and the area 76.164?", "sparql": "ASK { ?e <pred:name> \"Norwich\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"76.164\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"40493.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Wanted\" have 1 season and 13 episodes?", "sparql": "ASK { ?e <pred:name> \"Wanted\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"13.0\" . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Mansfield 50212 and the area 80.0955?", "sparql": "ASK { ?e <pred:name> \"Mansfield\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"80.0955\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50212.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Preston (with GSS code E07000123) 141,300?", "sparql": "ASK { ?e <pred:name> \"Preston\" . ?e <GSS_code_(2011)> ?pv_1 . ?pv_1 <pred:value> \"E07000123\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"141300.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Marche 1.54424e+06 and its Dewey Decimal Classification 2--4567?", "sparql": "ASK { ?e <pred:name> \"Marche\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4567\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.54424e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Greenland 52700.0 and its Dewey Decimal Classification 2--982?", "sparql": "ASK { ?e <pred:name> \"Greenland\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--982\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"52700.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Jalisco 7.84483e+06 and its Dewey Decimal Classification 2--7235?", "sparql": "ASK { ?e <pred:name> \"Jalisco\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7235\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.84483e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Freakazoid! have a duration of 25.0 and a number of episodes of 24.0?", "sparql": "ASK { ?e <pred:name> \"Freakazoid!\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"24.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Spain (the one whose CANTIC-ID is a11466121) have a Human Development Index of 0.87?", "sparql": "ASK { ?e <pred:name> \"Spain\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11466121\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.87\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Binghamton 47376 and its Dewey Decimal Classification 2--74775?", "sparql": "ASK { ?e <pred:name> \"Binghamton\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--74775\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"47376.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Samoa's FIPS 10-4 code WS and its Human Development Index 0.679?", "sparql": "ASK { ?e <pred:name> \"Samoa\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"WS\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.679\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Yangon 5.20954e+06 and its Dewey Decimal Classification 2--591?", "sparql": "ASK { ?e <pred:name> \"Yangon\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--591\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.20954e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Africa have a population of 1.1 billion and is associated with the British Museum person-institution with a value of 148397?", "sparql": "ASK { ?e <pred:name> \"Africa\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"148397\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1e+09\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Fargo, with a Twitter username of FargoFX, have 30.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Fargo\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"FargoFX\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"30.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Indonesia have a Dewey Decimal Classification of 2--598 and a Human Development Index of 0.671?", "sparql": "ASK { ?e <pred:name> \"Indonesia\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--598\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.671\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show M*A*S*H have a duration of 25.0 and a number of episodes of 256.0?", "sparql": "ASK { ?e <pred:name> \"M*A*S*H\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"256.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Palau have a Human Development Index of 0.775 and a British Museum person-institution value of 204348?", "sparql": "ASK { ?e <pred:name> \"Palau\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"204348\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.775\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Merlin have a duration of 175.0 and a number of episodes of 2.0?", "sparql": "ASK { ?e <pred:name> \"Merlin\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"175.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 202,225,000 speakers of the Portuguese language?", "sparql": "ASK { ?e <pred:name> \"Portuguese\" . ?e <Ethnologue.com_language_code> ?pv_1 . ?pv_1 <pred:value> \"por\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.02225e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Grimsby 88243.0 and its OS grid reference TA279087?", "sparql": "ASK { ?e <pred:name> \"Grimsby\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TA279087\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"88243.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Czechoslovakia have an INSEE countries and foreign territories code of 99115 and a population of 1.57e+07?", "sparql": "ASK { ?e <pred:name> \"Czechoslovakia\" . ?e <INSEE_countries_and_foreign_territories_code> ?pv_1 . ?pv_1 <pred:value> \"99115\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.57e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Burundi have a Dewey Decimal Classification of 2--67572 and a Human Development Index of 0.328?", "sparql": "ASK { ?e <pred:name> \"Burundi\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--67572\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.328\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Medina 1,180,770?", "sparql": "ASK { ?e <pred:name> \"Medina\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--538\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.18077e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Delft have 53644.0 households and an Amsterdam code of 10928?", "sparql": "ASK { ?e <pred:name> \"Delft\" . ?e <Amsterdam_code> ?pv_1 . ?pv_1 <pred:value> \"10928\" . ?e <number_of_households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"53644.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Sherlock have 13 episodes?", "sparql": "ASK { ?e <pred:name> \"Sherlock\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"13.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Durban (with WOEID 1580913) 595,061?", "sparql": "ASK { ?e <pred:name> \"Durban\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"1580913\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"595061.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]