[{"question": "Does Bismarck have a population of 61272?", "sparql": "ASK { ?e <pred:name> \"Bismarck\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"61272.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pasadena have 13.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Pasadena\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is NBCUniversal ranked 134,355.0 in terms of Alexa rank?", "sparql": "ASK { ?e <pred:name> \"NBCUniversal\" . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"134355.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Stockton have a population of 291,707?", "sparql": "ASK { ?e <pred:name> \"Stockton\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"291707.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Starbucks have 238,000 employees?", "sparql": "ASK { ?e <pred:name> \"Starbucks\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"238000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Eurasia have a population of 1.12e+09?", "sparql": "ASK { ?e <pred:name> \"Eurasia\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.12e+09\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Goa have a female population of 719,405?", "sparql": "ASK { ?e <pred:name> \"Goa\" . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"719405.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Hindi have a number of speakers equal to 3.2223e+08?", "sparql": "ASK { ?e <pred:name> \"Hindi\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.2223e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the Greek TV show have 74 episodes?", "sparql": "ASK { ?e <pred:name> \"Greek\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"74.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bruges have an annual number of weddings equal to 455.0?", "sparql": "ASK { ?e <pred:name> \"Bruges\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"455.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Oakville have a population of 182,520?", "sparql": "ASK { ?e <pred:name> \"Oakville\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"182520.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Lucerne have a population of 79478?", "sparql": "ASK { ?e <pred:name> \"Lucerne\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"79478.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Turkish have a number of speakers equal to 7.85272e+07?", "sparql": "ASK { ?e <pred:name> \"Turkish\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.85272e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bristol have a population of 442,500?", "sparql": "ASK { ?e <pred:name> \"Bristol\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"442500.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Paisley have a population of 76220?", "sparql": "ASK { ?e <pred:name> \"Paisley\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"76220.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Yvelines have an annual number of weddings equal to 4669.0?", "sparql": "ASK { ?e <pred:name> \"Yvelines\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4669.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Grenoble have a population of 160,779?", "sparql": "ASK { ?e <pred:name> \"Grenoble\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"160779.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Zeeland have a population of 380,726?", "sparql": "ASK { ?e <pred:name> \"Zeeland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"380726.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Roots have 8.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Roots\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Sherbrooke have a population of 154,601?", "sparql": "ASK { ?e <pred:name> \"Sherbrooke\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"154601.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Canberra have a population of 357,222?", "sparql": "ASK { ?e <pred:name> \"Canberra\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"357222.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Albuquerque have a population of 559,277?", "sparql": "ASK { ?e <pred:name> \"Albuquerque\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"559277.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Perth have a population of 2.0392e+06?", "sparql": "ASK { ?e <pred:name> \"Perth\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0392e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Hartford have a population of 124,775?", "sparql": "ASK { ?e <pred:name> \"Hartford\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"124775.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Milan have a population of 701,401?", "sparql": "ASK { ?e <pred:name> \"Milan\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"701401.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kankakee have a population of 27491?", "sparql": "ASK { ?e <pred:name> \"Kankakee\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"27491.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Cincinnati have a population of 24831?", "sparql": "ASK { ?e <pred:name> \"Cincinnati\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"24831.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Greenland have a population of 76186.0?", "sparql": "ASK { ?e <pred:name> \"Greenland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"76186.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Newburgh have a population of 28866?", "sparql": "ASK { ?e <pred:name> \"Newburgh\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"28866.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Tyler have a population of 96900?", "sparql": "ASK { ?e <pred:name> \"Tyler\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"96900.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Uganda have a Human Development Index of 0.476?", "sparql": "ASK { ?e <pred:name> \"Uganda\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.476\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Tokyo have a population of 9,272,560?", "sparql": "ASK { ?e <pred:name> \"Tokyo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9.27256e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Oceania have 1,104,070 out-of-school children?", "sparql": "ASK { ?e <pred:name> \"Oceania\" . ?e <number_of_out-of-school_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.10407e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nantucket have a population of 10399?", "sparql": "ASK { ?e <pred:name> \"Nantucket\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10399.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Arizona have a population of 6.82806e+06?", "sparql": "ASK { ?e <pred:name> \"Arizona\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.82806e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Maastricht have 67775 households?", "sparql": "ASK { ?e <pred:name> \"Maastricht\" . ?e <number_of_households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"67775.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Topeka have a population of 127,473?", "sparql": "ASK { ?e <pred:name> \"Topeka\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"127473.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nelson have a population of 46437?", "sparql": "ASK { ?e <pred:name> \"Nelson\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"46437.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Lufthansa have 129,424 employees?", "sparql": "ASK { ?e <pred:name> \"Lufthansa\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"129424.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Redding have a population of 89861?", "sparql": "ASK { ?e <pred:name> \"Redding\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"89861.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Fujian have a population of 3.68942e+07?", "sparql": "ASK { ?e <pred:name> \"Fujian\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.68942e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does AT&T have 273,000 employees?", "sparql": "ASK { ?e <pred:name> \"AT&T\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"273000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Koblenz have a population of 112,586?", "sparql": "ASK { ?e <pred:name> \"Koblenz\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"112586.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many employees does Genentech have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Genentech\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"14815.0\"^^xsd:double . ?e <employees> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What work is Sherlock based on and how many episodes does it have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sherlock\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13.0\"^^xsd:double . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the China administrative division code for Chongqing (the one with a population of 2.89e+06)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chongqing\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.89e+06\"^^xsd:double . ?e <China_administrative_division_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Kalamazoo?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kalamazoo\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"74262.0\"^^xsd:double . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of Bulawayo (the one with a population of 653337.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bulawayo\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"653337.0\"^^xsd:double . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of EMI and how many employees does it have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"EMI\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"15000.0\"^^xsd:double . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Sunnyvale (the one with a population of 140081.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sunnyvale\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"140081.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Bermuda (the one with a population of 59746.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bermuda\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"59746.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the elevation above sea level of Lima (the one with a population of 38771.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lima\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"38771.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which country is Yorkshire located in and has a population of 5.2347e+06?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Yorkshire\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.2347e+06\"^^xsd:double . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the net profit of Walmart (the one with 2.3e+06 employees)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Walmart\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.3e+06\"^^xsd:double . ?e <net_profit> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Andorra (the one with a Human Development Index of 0.819)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Andorra\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.819\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Kenya (the one with a Human Development Index of 0.539)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kenya\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.539\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the located_on_terrain_feature of Anguilla (the one with a population of 16086.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Anguilla\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"16086.0\"^^xsd:double . ?e <located_on_terrain_feature> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Indian census area code (2011) for Darjeeling (the one with a female population of 59618.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Darjeeling\" . ?e <female_population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"59618.0\"^^xsd:double . ?e <Indian_census_area_code_(2011)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member of the TV show Angel, which has 110.0 episodes?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Angel\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"110.0\"^^xsd:double . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Mozambique (the one with a Human Development Index of 0.218)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mozambique\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.218\"^^xsd:double . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of Bozeman (the one with a population of 37280.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bozeman\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"37280.0\"^^xsd:double . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Oman (the one with a Human Development Index of 0.793)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Oman\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.793\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Yuma founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Yuma\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"93064.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which country has Croatian as a language with 7 million speakers?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Croatian\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"7e+06\"^^xsd:double . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Ponce?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ponce\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"149028.0\"^^xsd:double . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity where Sindh (with a population of 5.52455e+07) is located?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sindh\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.52455e+07\"^^xsd:double . ?e <located_in_the_administrative_territorial_entity> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many children does Shrek have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Shrek\" . ?e <number_of_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.0\"^^xsd:double . ?e <number_of_children> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the time zone that Ridgewood is located in?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ridgewood\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"24958.0\"^^xsd:double . ?e <located_in_time_zone> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPv4 routing prefix for Boeing (the one with 165500.0 employees)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Boeing\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"165500.0\"^^xsd:double . ?e <IPv4_routing_prefix> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Summit founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Summit\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"21457.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of Plainfield (the one with a population of 49808.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Plainfield\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"49808.0\"^^xsd:double . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Erfurt (the one with a population of 13602.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Erfurt\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13602.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Lawton founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lawton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"96867.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Greenwood founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Greenwood\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"16087.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the maximum capacity of Olympia?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Olympia\" . ?e <maximum_capacity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"17200.0\"^^xsd:double . ?e <pred:name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the chief executive officer of Yahoo (the one with an Alexa rank of 6.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Yahoo\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.0\"^^xsd:double . ?e <chief_executive_officer> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Maldives (the one with a Human Development Index of 0.603)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Maldives\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.603\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Tartu (the one with a population of 93715.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tartu\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"93715.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the head of government of Kabul (the one with a population of 4.012e+06)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kabul\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.012e+06\"^^xsd:double . ?e <office_held_by_head_of_government> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Burnaby?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Burnaby\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"232755.0\"^^xsd:double . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Edmonton (the one with a population of 616306.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Edmonton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"616306.0\"^^xsd:double . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]