[{"question": "When did the Malay language stop using the ISO 639-1 code \"in\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <ISO_639-1_code> ?pv_1 . ?pv_1 <pred:value> \"in\" . ?e <ISO_639-1_code> ?pv . ?pv <pred:value> \"in\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_639-1_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the phenomenon with the subreddit \"nature\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"nature\" . ?e <subreddit> ?pv . ?pv <pred:value> \"nature\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for a writer?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2451\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the SOC Code (2010) for the designer with the code 17-1011?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"designer\" . ?e <SOC_Code_(2010)> ?pv_1 . ?pv_1 <pred:value> \"17-1011\" . ?e <SOC_Code_(2010)> ?pv . ?pv <pred:value> \"17-1011\" . [ <pred:fact_h> ?e ; <pred:fact_r> <SOC_Code_(2010)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the village with the name \"Underhill's Crossing\" in native language cease to exist?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Underhill's Crossing\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Underhill's Crossing\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Universal Decimal Classification for mathematics?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematics\" . ?e <Universal_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"514\" . ?e <Universal_Decimal_Classification> ?pv . ?pv <pred:value> \"514\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Universal_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the KldB-2010_occupation_code of the scientist with a KldB-2010_occupation_code of 41284?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e <KldB-2010_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"41284\" . ?e <KldB-2010_occupation_code> ?pv . ?pv <pred:value> \"41284\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KldB-2010_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the subreddit \"CollegeBasketball\" regarding the instance of basketball?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"CollegeBasketball\" . ?e <subreddit> ?pv . ?pv <pred:value> \"CollegeBasketball\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISWC of the single with the value \"T-070.067.752-6\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-070.067.752-6\" . ?e <ISWC> ?pv . ?pv <pred:value> \"T-070.067.752-6\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the subreddit \"lesbians\" regarding the instance of LGBT?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the news with the Twitter username TODAYshow have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"TODAYshow\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.nymag.com website regarding the manifestation?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.nymag.com/\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.nymag.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OCLC control number for the anthology with the OCLC control number 357792?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISO 639-2 code for Tagalog?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <ISO_639-2_code> ?pv_1 . ?pv_1 <pred:value> \"fil\" . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"fil\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_639-2_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the National Heritage List for England number of the palace with the number 1117776?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"palace\" . ?e <National_Heritage_List_for_England_number> ?pv_1 . ?pv_1 <pred:value> \"1117776\" . ?e <National_Heritage_List_for_England_number> ?pv . ?pv <pred:value> \"1117776\" . [ <pred:fact_h> ?e ; <pred:fact_r> <National_Heritage_List_for_England_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for mythology?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the army with the Twitter username \"armeedeterre\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"armeedeterre\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"armeedeterre\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the process with an IPTC Newscode of mediatopic/20000737?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"process\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000737\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for medicine?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medicine\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"49G6131\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"49G6131\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) for a businessperson with the code M1207?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"businessperson\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"M1207\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"M1207\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME_Occupation_Code_(v3)> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for musicians?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musician\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2453\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2453\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO_occupation_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What collection does the painting with inventory number 47.106 belong to?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"painting\" . ?e <inventory_number> ?pv_1 . ?pv_1 <pred:value> \"47.106\" . ?e <inventory_number> ?pv . ?pv <pred:value> \"47.106\" . [ <pred:fact_h> ?e ; <pred:fact_r> <inventory_number> ; <pred:fact_t> ?pv ] <collection> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What occupation has the Iconclass notation 13H2?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"13H2\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"13H2\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Glottolog code for the language Tagalog?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"fili1244\" . ?e <Glottolog_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the capital city with a Dewey Decimal Classification of 2--543?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--543\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the novel with the official website http://www.dccomics.com/watchmen?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.dccomics.com/watchmen\" . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the DiseasesDB value for the disease with DiseasesDB value of 14226?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"14226\" . ?e <DiseasesDB> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode of the organization with the IPTC Newscode mediatopic/20000536?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000536\" . ?e <IPTC_Newscode> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code of the sound with an IAB code of 344?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"344\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the entity that is both an instance of \"paranormal\" and has an Iconclass notation of \"13A361\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"paranormal\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"13A361\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference of the town with an OS grid reference of TQ510887?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ510887\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of a drum with a value of 211.212.11?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"211.212.11\" . ?e <Hornbostel-Sachs_classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the subreddit for reggae music that is also the subreddit for RootsReggae?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"RootsReggae\" . ?e <subreddit> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Snapchat username of the newscast with the Snapchat username \"gma\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <Snapchat_username> ?pv_1 . ?pv_1 <pred:value> \"gma\" . ?e <Snapchat_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the position with the Iconclass notation 44B151211?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"44B151211\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for biology?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"biology\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"590\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the RIA Novosti reference for the marketing entity with a RIA Novosti reference of 61684885?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"61684885\" . ?e <RIA_Novosti_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of a piano?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"piano\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"511\" . ?e <Hornbostel-Sachs_classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What subreddit is associated with the genre \"techno\" and also associated with \"minimal\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" . ?e <subreddit> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for chemists?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemist\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the NRHP reference number for the cemetery with the reference number 97000830?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <NRHP_reference_number> ?pv_1 . ?pv_1 <pred:value> \"97000830\" . ?e <NRHP_reference_number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code of the equity with an IAB code of 69?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"equity\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"69\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code of a researcher with the ISCO occupation code 2212?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the university with ISNI 0000 0001 2214 904X?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2214 904X\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of a republic with a Dewey Decimal Classification of 2--6773?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6773\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the city/town that has a Dewey Decimal Classification of 2--4779?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4779\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OSM tag or key for the empire that has the name \"byzantine\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:historic:civilization=byzantine\" . ?e <OSM_tag_or_key> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OKPD2 code of the food with the code 01.23.13?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"food\" . ?e <OKPD2_code_of_the_good_or_service> ?pv_1 . ?pv_1 <pred:value> \"01.23.13\" . ?e <OKPD2_code_of_the_good_or_service> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISWC of the song with the value \"T-010.162.677-0\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-010.162.677-0\" . ?e <ISWC> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Stack Exchange tag for the activity related to project management?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/project-management\" . ?e <Stack_Exchange_tag> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for a residue with the value of 41B152?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"residue\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"41B152\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the medal that has the official website http://www.ras.org.uk/awards-and-grants/awards?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ras.org.uk/awards-and-grants/awards\" . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the violin (the one with a value of 321.322-71)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"violin\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322-71\" . ?e <Hornbostel-Sachs_classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ICD-9 code for the crime with the code E960.1?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <ICD-9> ?pv_1 . ?pv_1 <pred:value> \"E960.1\" . ?e <ICD-9> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OCLC control number of the anthology with an OCLC control number of 357792?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . ?e <OCLC_control_number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the sRGB color hex triplet for the color red (FF2400)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"red\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"FF2400\" . ?e <sRGB_color_hex_triplet> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the merchant who has the Iconclass notation 48A831?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"merchant\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"48A831\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code of the artist with ISCO occupation code 2453?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"artist\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2453\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Classification_of_Instructional_Programs_code for the technology with a code of 11.0103?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"technology\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"11.0103\" . ?e <Classification_of_Instructional_Programs_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISO 4217 code for the currency with the name \"INR\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <ISO_4217_code> ?pv_1 . ?pv_1 <pred:value> \"INR\" . ?e <ISO_4217_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ACM Classification Code (2012) for the science category with a value of 10002979?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10002979\" . ?e <ACM_Classification_Code_(2012)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the EPPO Code of the taxon with the code 1CICHF?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <EPPO_Code> ?pv_1 . ?pv_1 <pred:value> \"1CICHF\" . ?e <EPPO_Code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OSM tag or key for a restaurant that has the value \"Tag:shop=deli\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"restaurant\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:shop=deli\" . ?e <OSM_tag_or_key> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode of the problem with the mediatopic/20000800 value?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"problem\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000800\" . ?e <IPTC_Newscode> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code of the fiction with an IAB code of 642?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fiction\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"642\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Stack Exchange tag for the software that has the URL https://stackoverflow.com/tags/solaris?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/solaris\" . ?e <Stack_Exchange_tag> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]