[{"question": "What is the official name of Aspen (the one with a population of 6658.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aspen\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6658.0\"^^xsd:double . ?e <official_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "In which administrative territorial entity is Ocala located and has a population of 56315.0?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ocala\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56315.0\"^^xsd:double . ?e <located_in_the_administrative_territorial_entity> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Guatemala (the one with a Human Development Index of 0.455)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Guatemala\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.455\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Seville (the one with a population of 689434.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Seville\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"689434.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of Cleveland (the one with a population of 396815.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cleveland\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"396815.0\"^^xsd:double . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CBS municipality code for Leiden (the one with 64280.0 households)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Leiden\" . ?e <number_of_households> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"64280.0\"^^xsd:double . ?e <CBS_municipality_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Turku (the one with a population of 187604.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Turku\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"187604.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Gmelin number of L-alanine (the one with a pKa of 2.61)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"L-alanine\" . ?e <pKa> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.61\"^^xsd:double . ?e <Gmelin_number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Mansfield founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mansfield\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"50212.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Baden-Baden (the one with a population of 49142.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Baden-Baden\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"49142.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the elevation above sea level of Mangalore (the one with a population of 623,841)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mangalore\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"623841.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the composer of the song \"Brave\" with a beats per minute of 72.0?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brave\" . ?e <beats_per_minute> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"72.0\"^^xsd:double . ?e <composer> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Nancy (the one with a population of 105162.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nancy\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"105162.0\"^^xsd:double . ?e <official_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Toulouse (the one with a population of 471941.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Toulouse\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"471941.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of Beaufort (the one with a population of 12361.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Beaufort\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"12361.0\"^^xsd:double . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 6-4 code for Denver (the one with a population of 4749.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Denver\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4749.0\"^^xsd:double . ?e <FIPS_6-4_(US_counties)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the head of government for Chico (the one with a population of 86187.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chico\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"86187.0\"^^xsd:double . ?e <office_held_by_head_of_government> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the postal code of Burbank (the one with a population of 103340.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Burbank\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"103340.0\"^^xsd:double . ?e <postal_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the demonym of the population of 1.45e+07 Hungarians?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hungarians\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.45e+07\"^^xsd:double . ?e <demonym> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Luxembourg (the one with a Human Development Index of 0.89)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Luxembourg\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.89\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Devon (the one whose population is 1.1357e+06) different from?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Devon\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1357e+06\"^^xsd:double . ?e <different_from> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the narrative location of the TV show Taxi (which has 114.0 episodes)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Taxi\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"114.0\"^^xsd:double . ?e <narrative_location> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many episodes does My-HiME have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"My-HiME\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"26.0\"^^xsd:double . ?e <pred:instance_of> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the number of out-of-school children in Africa (the one whose value is 1.06e+08) according to the British Museum person-institution?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Africa\" . ?e <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.06e+08\"^^xsd:double . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Statistics Canada Geographic code for Surrey (the one with a population of 468251.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Surrey\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"468251.0\"^^xsd:double . ?e <Statistics_Canada_Geographic_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the organization with ISNI 0000 0000 9987 0743 established on January 1, 1946?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 9987 0743\" . ?e <inception> ?pv . ?pv <pred:date> \"1946-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the Medal of Honor established on July 12, 1862?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Medal of Honor\" . ?e <inception> ?pv . ?pv <pred:date> \"1862-07-12\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the activity with the official website http://www.medalofhonor.com published on 1999-10-31?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.medalofhonor.com\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-10-31\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a town with a Dewey Decimal Classification of 2--43724 and a time of earliest written record on January 17, 1091?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43724\" . ?e <time_of_earliest_written_record> ?pv . ?pv <pred:date> \"1091-01-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a dynasty that had a British Museum person-institution value of 152002 and was dissolved, abolished, or demolished on January 1, 1780?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"152002\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1780-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Protestantism (the one with ISNI 0000 0004 0508 6616) start on January 1, 1957?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anime with 13 episodes that was published on 2008-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"13.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the horse with the native label \"Northern Dancer\" die on November 16, 1990?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" . ?e <date_of_death> ?pv . ?pv <pred:date> \"1990-11-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the island with FIPS 10-4 code GQ established on January 1, 1898?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"GQ\" . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the superhero with the birth name \"Anung un Rama\" and date of birth 1617-10-05?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Anung un Rama\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1617-10-05\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the metropolis with a Dewey Decimal Classification of 2--71428 established on May 17, 1642?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--71428\" . ?e <inception> ?pv . ?pv <pred:date> \"1642-05-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the album published on 1976-04-23 and has a duration of 1744.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"1744.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1976-04-23\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the war with KulturNav-id f0a37482-3736-4dd0-b56c-c7d26fb32a95 end on January 1, 1648?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . ?e <end_time> ?pv . ?pv <pred:date> \"1648-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the author with ISNI 0000 0001 0873 3741 born on August 18, 1934?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the republic with British Museum person-institution ID 180889 established on January 7, 1822?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" . ?e <inception> ?pv . ?pv <pred:date> \"1822-01-07\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the division with the official name \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" dissolved, abolished, or demolished on September 16, 2015?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"2015-09-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the taxon with the native label \"Northern Dancer\" born on May 27, 1961?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1961-05-27\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a capital city with a Dewey Decimal Classification of 2--43712 and a time of earliest written record on January 17, 0965?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43712\" . ?e <time_of_earliest_written_record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the agent with ISNI 0000 0000 9987 0743 established on January 1, 1946?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 9987 0743\" . ?e <inception> ?pv . ?pv <pred:date> \"1946-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a country with a Dewey Decimal Classification of 2--492 and an inception date of 1954-12-15?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--492\" . ?e <inception> ?pv . ?pv <pred:date> \"1954-12-15\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the manga with the official website http://tezukaosamu.net published on 1952-04-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1952-04-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the college with ISNI 0000 0001 0719 5427 established on January 1, 1824?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0719 5427\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anthology with an OCLC control number of 357792 and a publication date of 1960-04-11?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1960-04-11\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the genre \"techno\" with subreddit \"minimal\" created on January 1, 1991?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" . ?e <inception> ?pv . ?pv <pred:date> \"1991-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the miniseries with 6.0 episodes end on December 21, 1986?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"6.0\" . ?e <end_time> ?pv . ?pv <pred:date> \"1986-12-21\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did marketing have its first flight on 1967-04-09 and have a RIA_Novosti_reference of 61684885?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"61684885\" . ?e <first_flight> ?pv . ?pv <pred:date> \"1967-04-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the person with ISNI 0000 0001 0873 3741 and a date of birth of 1934-08-18 an occupation?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the comedy with a duration of 25.0 end on 1992-05-09?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . ?e <end_time> ?pv . ?pv <pred:date> \"1992-05-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the neighborhood with a postal code of 02119 established on September 28, 1630?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"02119\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-28\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the soundtrack with the title \"Iron Man 2\" published on 2010-04-19?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-04-19\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the newspaper with an Alexa rank of 112.0 established on September 18, 1851?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . ?e <inception> ?pv . ?pv <pred:date> \"1851-09-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the army with the name in kana \"\u3060\u3044\u306b\u3063\u307d\u3093\u3066\u3044\u3053\u304f\u308a\u304f\u3050\u3093\" established on January 1, 1868?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <name_in_kana> ?pv_1 . ?pv_1 <pred:value> \"\u3060\u3044\u306b\u3063\u307d\u3093\u3066\u3044\u3053\u304f\u308a\u304f\u3050\u3093\" . ?e <inception> ?pv . ?pv <pred:date> \"1868-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the sound with IAB code 368 created on January 1, 1975?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"368\" . ?e <inception> ?pv . ?pv <pred:date> \"1975-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the trance genre, which has a subreddit called psytrance, originate on January 1, 1995?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Mormonism (the one whose CANTIC-ID is a11336638) established on April 6, 1830?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11336638\" . ?e <inception> ?pv . ?pv <pred:date> \"1830-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the cemetery located at Avenue Samson, 37 established on January 1, 1825?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <located_at_street_address_(DEPRECATED)> ?pv_1 . ?pv_1 <pred:value> \"Avenue Samson, 37\" . ?e <inception> ?pv . ?pv <pred:date> \"1825-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a film with a duration of 98.0 minutes and a publication date of 2001-08-16?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Christianity (the one with ISNI 0000 0004 0508 6616) start on January 1, 1957?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a state with an area of 603700.0 and an inception date of 1919-03-10?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"603700.0\" . ?e <inception> ?pv . ?pv <pred:date> \"1919-03-10\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the opera with 1.0 number of parts and the date of first performance on 1909-01-25?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <number_of_parts_of_this_work_of_art> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1909-01-25\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the governor, whose official website is http://governor.ky.gov/, in office since 1792-06-04?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://governor.ky.gov/\" . ?e <inception> ?pv . ?pv <pred:date> \"1792-06-04\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a politician whose native label is \"Speaker of the United States House of Representatives\" and whose inception date is April 1, 1789?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the print with the IIIF manifest \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" created on January 17, 1860?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"print\" . ?e <IIIF_manifest> ?pv_1 . ?pv_1 <pred:value> \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" . ?e <inception> ?pv . ?pv <pred:date> \"1860-01-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a painting with a height of 99.6 and an inception date of 1905-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"painting\" . ?e <height> ?pv_1 . ?pv_1 <pred:value> \"99.6\" . ?e <inception> ?pv . ?pv <pred:date> \"1905-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]