[
    {
        "question": "What is the Wikimedia username associated with the foundation whose Alexa rank was 29145.0 on 2017-11-28?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> foundation . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29145.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-28\"^^xsd:date . ?e <Wikimedia username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the continent of the state that had 101331.0 out-of-school children on 2001-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <number of out-of-school children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"101331.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of out-of-school children> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2001-01-01\"^^xsd:date . ?e <continent> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who composed the film that had an attendance of 8446.0 on 2018-05-30?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8446.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date . ?e <composer> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the WOEID of the village with a population of 6323.0 as of January 1, 2010?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date . ?e <WOEID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the licence plate code of the capital city whose population was 1.18219e+06 on 1980-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.18219e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"1980-01-01\"^^xsd:date . ?e <licence plate code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IAB code of the language with 4.02e+07 speakers as of January 1, 2007?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> language . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.02e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of speakers> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2007-01-01\"^^xsd:date . ?e <IAB code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the administrative territorial entity contained within the republic that had an annual number of weddings equal to 265404.0 on January 1st, 2008?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <annual number of weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"265404.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual number of weddings> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2008-01-01\"^^xsd:date . ?e <contains administrative territorial entity> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the inception time of the city whose population was 928850.0 on January 1st, 2014?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"928850.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <inception> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the metropolis with a population of 1.64952e+06 as of January 1, 2011?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.64952e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the administrative territorial entity contained within the democracy that had an annual number of weddings equal to 265404.0 in 2008?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <annual number of weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"265404.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual number of weddings> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2008-01-01\"^^xsd:date . ?e <contains administrative territorial entity> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity is a peninsula with an area of 622918.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> peninsula . ?e <area> ?pv . ?pv <pred:value> \"622918.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity has an ISO 15924 alpha-4 code of \"Arab\" and is an instance of abjad?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> abjad . ?e <ISO 15924 alpha-4 code> ?pv . ?pv <pred:value> \"Arab\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which neighborhood has a postal code of 02119?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <postal code> ?pv . ?pv <pred:value> \"02119\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which techno subreddit has the value \"minimal\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> techno . ?e <subreddit> ?pv . ?pv <pred:value> \"minimal\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the army whose name in kana is \"\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> army . ?e <name in kana> ?pv . ?pv <pred:value> \"\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the army with ISNI 0000 0004 0498 1870 have the same ISNI as itself?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> army . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0498 1870\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0498 1870\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a band with ISNI 0000 0001 1089 9660?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> band . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1089 9660\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1089 9660\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a school with an ARCHON code of 1143?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> school . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"1143\" . ?e <ARCHON code> ?pv . ?pv <pred:value> \"1143\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the entity with Iconclass notation 95 and 94 belong to mythology?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> mythology . ?e <Iconclass notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"94\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the entity with Serbo-Croatian as its instance_of have Dewey Decimal Classification of 491.82 twice?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Serbo-Croatian . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"491.82\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"491.82\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a software that has Stack Exchange tags of https://stackoverflow.com/tags/windows-7?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <Stack Exchange tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/windows-7\" . ?e <Stack Exchange tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/windows-7\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the entity with an IAB code of 69 belong to the equity category?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> equity . ?e <IAB code> ?pv_1 . ?pv_1 <pred:value> \"69\" . ?e <IAB code> ?pv . ?pv <pred:value> \"69\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the occupation of the entity with ROME Occupation Code (v3) L1303 an impresario?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> impresario . ?e <ROME Occupation Code (v3)> ?pv_1 . ?pv_1 <pred:value> \"L1303\" . ?e <ROME Occupation Code (v3)> ?pv . ?pv <pred:value> \"L1303\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the entity with OCLC control number 16386945 belong to the category \"single\" and have another OCLC control number of 16386945?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> single . ?e <OCLC control number> ?pv_1 . ?pv_1 <pred:value> \"16386945\" . ?e <OCLC control number> ?pv . ?pv <pred:value> \"16386945\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the activity with an official website of https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php# and a publication date of 2006-11-30 released on Xbox 360?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php#\" . ?e <publication date> ?pv . ?pv <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a republic with a demonym of \"velencei\", an inception date of 0697-01-01, and an instance of a statement with a Gregorian date earlier than 1584?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"velencei\" . ?e <inception> ?pv . ?pv <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital city that has a Dewey Decimal Classification of 2--4786 and has the earliest written record dating back to 1067-01-01 (according to a statement with Gregorian date earlier than 1584)?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4786\" . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"1067-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <time of earliest written record> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there an anime published on 2010-09-16 with a duration of 101.0 and a place of publication in Germany?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> anime . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"101.0\" . ?e <publication date> ?pv . ?pv <pred:date> \"2010-09-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a university with a CANTIC-ID of a11184668, an inception date of 1457-09-21, and an instance of a statement with a Gregorian date earlier than 1584?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11184668\" . ?e <inception> ?pv . ?pv <pred:date> \"1457-09-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a miniseries published on 1999-05-23 with a duration of 177.0 and a place of publication in the United States of America?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"177.0\" . ?e <publication date> ?pv . ?pv <pred:date> \"1999-05-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city has a FIPS 10-4 code of UKI7, an inception date of 0200-01-01, and is associated with a statement with a Gregorian date earlier than 1584?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"UKI7\" . ?e <inception> ?pv . ?pv <pred:date> \"0200-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the entertainment with an official website of https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php# published on November 30, 2006 and available on Xbox 360 platform?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php#\" . ?e <publication date> ?pv . ?pv <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the activity that has two official websites, one being https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php# and the other being http://sonic.sega.jp/sonic/?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php#\" . ?e <official website> ?pv . ?pv <pred:value> \"http://sonic.sega.jp/sonic/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the discharge rate of a river that is 6800.0 units long and has a fact with a value of ?qpv and a discharge rate of 168700.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> river . ?e <discharge> ?pv_1 . ?pv_1 <pred:value> \"168700.0\" . ?e <length> ?pv . ?pv <pred:value> \"6800.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <length> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What language pertains to the official website https://www.united.com/ regarding the airline with a Corporate Number (Japan) of 3700150005378?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <Corporate Number (Japan)> ?pv_1 . ?pv_1 <pred:value> \"3700150005378\" . ?e <official website> ?pv . ?pv <pred:value> \"https://www.united.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the collection of the painting with an inventory number of 47.106 and a height of 99.6?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> painting . ?e <height> ?pv_1 . ?pv_1 <pred:value> \"99.6\" . ?e <inventory number> ?pv . ?pv <pred:value> \"47.106\" . [ <pred:fact_h> ?e ; <pred:fact_r> <inventory number> ; <pred:fact_t> ?pv ] <collection> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the scientist whose ISCO occupation code is 2212 and KldB-2010 occupation code is 41284?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> scientist . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <KldB-2010 occupation code> ?pv . ?pv <pred:value> \"41284\" . [ <pred:fact_h> ?e ; <pred:fact_r> <KldB-2010 occupation code> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What language pertains to the official website http://www.speaker.gov/ regarding the politician whose native label is Speaker of the United States House of Representatives?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> politician . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.speaker.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for the republic with a Dewey Decimal Classification of 2--6662 and a Human Development Index of 0.424?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6662\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.424\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the genre book that has 218 pages and an OCLC control number of 357792?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv_1 . ?pv_1 <pred:value> \"218.0\" . ?e <OCLC control number> ?pv . ?pv <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC control number> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the number of episodes for the animation equal to 56.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> animation . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"56.0\" . ?e <number of episodes> ?pv . ?pv <pred:value> \"56.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a village with a WOEID of 2369745 and two facts stating that its WOEID is 2369745 and its fact_t is also 2369745?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2369745\" . [ <pred:fact_h> ?e ; <pred:fact_r> <WOEID> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2369745\" . ?e <WOEID> ?pv . ?pv <pred:value> \"2369745\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]