[
    {
        "question": "Which capital has a population of 8.1878e+06 and has a fact with the same value?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.1878e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"8.1878e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which facility has 2.74113e+06 visitors per year?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.74113e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors per year> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2.74113e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which organization has 33 seats and a number of seats equal to 33.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <number of seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seats> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"33.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which metropolis has a population of 1.49104e+07 and when was this fact recorded?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.49104e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"1.49104e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Yangon stop being the capital of Myanmar (the one with a population of 4.73212e+07 and Yangon's population is 5.20954e+06)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Myanmar\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.73212e+07\"^^xsd:double . ?e_2 <pred:name> Yangon . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.20954e+06\"^^xsd:double . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population ratio between Maharashtra (whose population is 1.12373e+08) and Mumbai (whose population is 1.24424e+07), the capital of Maharashtra?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Maharashtra\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.12373e+08\"^^xsd:double . ?e_2 <pred:name> Mumbai . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.24424e+07\"^^xsd:double . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the twinning of Ljubljana (with a population of 287,000) and Wiesbaden (with a population of 275,976) begin?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ljubljana\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"287000.0\"^^xsd:double . ?e_2 <pred:name> Wiesbaden . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"275976.0\"^^xsd:double . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Germany establish diplomatic relations with Benin, given that Germany's Human Development Index is 0.926 and Benin's is 0.473?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Germany\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.926\"^^xsd:double . ?e_2 <pred:name> Benin . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.473\"^^xsd:double . ?e_1 <diplomatic relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic relation> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of North Holland and its administrative territorial entity Hilversum, and what is the fact pertaining to this information?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"North Holland\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.81347e+06\"^^xsd:double . ?e_2 <pred:name> Hilversum . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"87817.0\"^^xsd:double . ?e_1 <contains administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the difference in Human Development Index between Angola and the country it is a part of?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Angola\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.533\"^^xsd:double . ?e_2 <pred:name> Angola . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.488\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the twinning administrative body between Taipei (population 2.65868e+06) and Riga (population 698529.0) start?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Taipei\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.65868e+06\"^^xsd:double . ?e_2 <pred:name> Riga . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"698529.0\"^^xsd:double . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did India start containing Sikkim as an administrative territorial entity, given that India's population is 1.22116e+09 and Sikkim's population is 610577.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"India\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.22116e+09\"^^xsd:double . ?e_2 <pred:name> Sikkim . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"610577.0\"^^xsd:double . ?e_1 <contains administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains administrative territorial entity> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of Saginaw County and Saginaw (the one with a population of 51508.0) and what is the relationship between them?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Saginaw County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"198154.0\"^^xsd:double . ?e_2 <pred:name> Saginaw . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"51508.0\"^^xsd:double . ?e_1 <contains administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Montpellier and Sherbrooke become twinned administrative bodies, given that Montpellier's population is 275318.0 and Sherbrooke's population is 154601.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Montpellier\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"275318.0\"^^xsd:double . ?e_2 <pred:name> Sherbrooke . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"154601.0\"^^xsd:double . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the OCLC control number of the genre book with 218 pages?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <OCLC control number> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Twitter hashtag for the software that has an Alexa rank of 1.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <Twitter hashtag> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a cast member in the film with a box office of 8.96911e+08?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the OCLC control number of the anthology with 218.0 pages?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anthology . ?e <number of pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <OCLC control number> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the original network of the filmmaking entity with 1 episode and a duration of 56.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> filmmaking . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . ?e <original network> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of the neighborhood with a population of 68469.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"68469.0\"^^xsd:double . ?e <country> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the nationality with a population of 6 million?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> nationality . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6e+06\"^^xsd:double . ?e <pred:name> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISO 639-3 code for Tagalog, which has 9e+07 speakers?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Tagalog . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9e+07\"^^xsd:double . ?e <ISO 639-3 code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of the business that has 500 employees?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"500.0\"^^xsd:double . ?e <country> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the agent with 80.0 seats (unit: 1)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <number of seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a subreddit for dogs named Yorkies with 2394 subscribers and a unit of 1, and is it related to a dog instance?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> dog . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2394.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Yorkies\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city/town has a population of 758400.0 and the same population value is also associated with a fact?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"758400.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"758400.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"758400.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What conservatory has 40 employees, with each employee having a value of 40.0, according to the facts?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"40.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"40.0\"^^xsd:double . ?e <employees> ?pv . ?pv <pred:value> \"40.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an LGBT-related subreddit with the name \"lesbians\" that has 194100 subscribers and a unit of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> LGBT . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"194100.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an anime with 13 episodes and a number of episodes equal to 13.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> anime . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"13.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"13.0\"^^xsd:double . ?e <number of episodes> ?pv . ?pv <pred:value> \"13.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an industry that has 1447.0 episodes and the same number of episodes is also its number of episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"1447.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1447.0\"^^xsd:double . ?e <number of episodes> ?pv . ?pv <pred:value> \"1447.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a cemetery with 20000 graves, where the unit of measurement is 1, and the number of graves is also 20000?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> cemetery . ?e <number of graves> ?pv_1 . ?pv_1 <pred:value> \"20000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of graves> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"20000.0\"^^xsd:double . ?e <number of graves> ?pv . ?pv <pred:value> \"20000.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a village with a population of 6323.0 and is the population of that village also 6323.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6323.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6323.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"6323.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which republic has an inception date earlier than 1584 and a population of 1.5 million?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> republic . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.5e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the human who died on 2018-11-30 in the Central Time Zone have 6 children?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <date of death> ?pv_1 . ?pv_1 <pred:date> \"2018-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date of death> ; <pred:fact_t> ?pv_1 ] <located in time zone> ?qpv . ?qpv <pred:value> \"Central Time Zone\" . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a democracy whose inception date is earlier than 1584 and has a population of 1.5 million?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> democracy . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.5e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which empire was dissolved, abolished or demolished on January 1st, 1453 and had a population of 3.4e+07?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> empire . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1453-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved, abolished or demolished> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.4e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital city that has the earliest written record dated 1067-01-01 (according to the Gregorian calendar before 1584) and a population of 1.98248e+06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"1067-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <time of earliest written record> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.98248e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a university whose inception date is earlier than 1584 and has 6979 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1558-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6979.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the miniseries with a publication date of 1990-11-18, produced in the United States of America, and has 2.0 episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1990-11-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <country> ?qpv . ?qpv <pred:value> \"United States of America\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which state has an inception date earlier than 1584, a population of 65345.0, and a statement with Gregorian date of 1204-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1204-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"65345.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]