[
    {
        "question": "What was the population of the metropolitan area whose population was 2.71049e+06 on 2014-01-01?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.71049e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2014-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:value> \"2.71049e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the film with an attendance of 8446.0 end its attendance (the attendance is the same for both instances)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8446.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv_1 . ?qpv_1 <pred:date> \"2018-05-30\"^^xsd:date . ?e <attendance> ?pv . ?pv <pred:value> \"8446.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between James Stewart and the Academy Award for Best Actor?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"James Stewart\" . ?e_2 <pred:name> \"Academy Award for Best Actor\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Somerset and Sigourney Weaver?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Somerset\" . ?e_2 <pred:name> \"Sigourney Weaver\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Inyo County and Independence?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Inyo County\" . ?e_2 <pred:name> \"Independence\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of A Midsummer Night's Dream?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Midsummer Night's Dream\" . ?e_2 <pred:name> \"A Midsummer Night's Dream\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Abidjan and Ivory Coast?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Abidjan\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Lady Sings the Blues and Billie Holiday?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lady Sings the Blues\" . ?e_2 <pred:name> \"Billie Holiday\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cleveland Institute of Music and Case Western Reserve University?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cleveland Institute of Music\" . ?e_2 <pred:name> \"Case Western Reserve University\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Sigourney Weaver and Sarah Lawrence College?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sigourney Weaver\" . ?e_2 <pred:name> \"Sarah Lawrence College\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Real Zaragoza and Zaragoza?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Real Zaragoza\" . ?e_2 <pred:name> \"Zaragoza\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Buster Keaton and Harold Lloyd?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Buster Keaton\" . ?e_2 <pred:name> \"Harold Lloyd\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between bebop and Charlie Parker?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"bebop\" . ?e_2 <pred:name> \"Charlie Parker\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between evolution and Charles Darwin?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"evolution\" . ?e_2 <pred:name> \"Charles Darwin\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Andrzej Wajda and Poles?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Andrzej Wajda\" . ?e_2 <pred:name> \"Poles\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Rajesh Khanna and the Indian National Congress?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rajesh Khanna\" . ?e_2 <pred:name> \"Indian National Congress\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Dwayne Johnson and the Calgary Stampeders?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dwayne Johnson\" . ?e_2 <pred:name> \"Calgary Stampeders\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cleopatra and Julius Caesar?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cleopatra\" . ?e_2 <pred:name> \"Julius Caesar\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Jonah Hex and Apache?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jonah Hex\" . ?e_2 <pred:name> \"Apache\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Get Smart and Mel Brooks?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Get Smart\" . ?e_2 <pred:name> \"Mel Brooks\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the University of Chicago and the University of Chicago Law School?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"University of Chicago\" . ?e_2 <pred:name> \"University of Chicago Law School\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between homelessness and poverty?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"homelessness\" . ?e_2 <pred:name> \"poverty\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Roger Moore?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roger Moore\" . ?e_2 <pred:name> \"Roger Moore\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Lil Wayne and Cash Money Records?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lil Wayne\" . ?e_2 <pred:name> \"Cash Money Records\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Philadelphia Flyers and Keith Allen?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Philadelphia Flyers\" . ?e_2 <pred:name> \"Keith Allen\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the title of Buzz Aldrin's rank in relation to the word \"colonel\"?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Buzz Aldrin\" . ?e_2 <pred:name> \"colonel\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of The Sum of All Fears?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Sum of All Fears\" . ?e_2 <pred:name> \"The Sum of All Fears\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Messenger and Canal+?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Messenger\" . ?e_2 <pred:name> \"Canal+\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Shortbus and heterosexuality?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shortbus\" . ?e_2 <pred:name> \"heterosexuality\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between congregational church and Calvinism?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"congregational church\" . ?e_2 <pred:name> \"Calvinism\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Thelonious Monk and Rocky Mount?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Thelonious Monk\" . ?e_2 <pred:name> \"Rocky Mount\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between John Bailey and Dorchester?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"John Bailey\" . ?e_2 <pred:name> \"Dorchester\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Fifth Element and Hudson Soft?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Fifth Element\" . ?e_2 <pred:name> \"Hudson Soft\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities both named \"blue\"?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"blue\" . ?e_2 <pred:name> \"blue\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ernest Hemingway and the Spanish Civil War?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ernest Hemingway\" . ?e_2 <pred:name> \"Spanish Civil War\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between A Great Day in Harlem and Charles Mingus Jr.?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"A Great Day in Harlem\" . ?e_2 <pred:name> \"Charles Mingus Jr.\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between a teacher and Lake Superior?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"teacher\" . ?e_2 <pred:name> \"Lake Superior\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Gujarat?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gujarat\" . ?e_2 <pred:name> \"Gujarat\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the World Fantasy Award for Best Anthology and an anthology?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"World Fantasy Award for Best Anthology\" . ?e_2 <pred:name> \"anthology\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Vince Gill and Dobro?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vince Gill\" . ?e_2 <pred:name> \"Dobro\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Georgy Zhukov and the Imperial Russian Army?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Georgy Zhukov\" . ?e_2 <pred:name> \"Imperial Russian Army\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Harold Lloyd and the executive producer?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harold Lloyd\" . ?e_2 <pred:name> \"executive producer\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between ESPN and Hearst?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"ESPN\" . ?e_2 <pred:name> \"Hearst\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the relationship between Christianity and being a Christian?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Christianity\" . ?e_2 <pred:name> \"Christian\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between FC Erzgebirge Aue and archery?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"FC Erzgebirge Aue\" . ?e_2 <pred:name> \"archery\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the National Gallery and Georgian architecture?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"National Gallery\" . ?e_2 <pred:name> \"Georgian architecture\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the Sun and Mars?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sun\" . ?e_2 <pred:name> \"Mars\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population and area of the U.S. city whose population is 25514.0 and area is 37.5618?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"25514.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"37.5618\" . [ <pred:fact_h> ?e ; <pred:fact_r> <area> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of representatives in an organization/legislature for Bharatiya Janata Party (the one founded in 1980-01-01)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1980-01-01\"^^xsd:date . ?e <number of representatives in an organization/legislature> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the position played on team/speciality of Chris Carter (the one born on 1982-09-16)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chris Carter\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1982-09-16\"^^xsd:date . ?e <position played on team / speciality> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the British Museum person-institution of Fred Astaire (the one who died on 1987-06-22)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fred Astaire\" . ?e <date of death> ?pv_1 . ?pv_1 <pred:date> \"1987-06-22\"^^xsd:date . ?e <British Museum person-institution> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Utah (the one with a population of 1.72285e+06) and the subreddit snowboarding?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Utah\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.72285e+06\"^^xsd:double . ?e_2 <pred:name> \"snowboarding\" . ?e_2 <subreddit> ?pv_1 . ?pv_1 <pred:value> \"snowboarding\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Ultimate Fighter (the one with 1 season and a value of 27.0) to Spike TV (the one with an official name of Spike TV)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Ultimate Fighter\" . ?e_1 <number of seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"27.0\"^^xsd:double . ?e_2 <pred:name> \"Spike TV\" . ?e_2 <official name> ?pv_1 . ?pv_1 <pred:value> \"Spike TV\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Iron Man 2 (the one with an attendance of 918409) and the title \"Iron Man 2\"?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Iron Man 2\" . ?e_1 <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"918409.0\"^^xsd:double . ?e_2 <pred:name> \"Iron Man 2\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between NBCUniversal (the one with an Alexa rank of 134355.0) and Telemundo (the one with a Twitter username of Telemundo)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"NBCUniversal\" . ?e_1 <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"134355.0\"^^xsd:double . ?e_2 <pred:name> \"Telemundo\" . ?e_2 <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"Telemundo\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]