[
    {
        "question": "How many industries have both https://www.apple.com/ios/ and https://www.apple.com/at/ios/ as their official website?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <official website> ?pv . ?pv <pred:value> \"https://www.apple.com/ios/\" . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"https://www.apple.com/at/ios/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many films have a title of \"Kill Bill Volume 2\" and a cost of 3e+07?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <title> ?pv . ?pv <pred:value> \"Kill Bill Volume 2\" . ?e <cost> ?pv_1 . ?pv_1 <pred:value> \"3e+07\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many neighborhoods have an NRHP reference number of 79001604?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <NRHP reference number> ?pv . ?pv <pred:value> \"79001604\" . ?e <NRHP reference number> ?pv_1 . ?pv_1 <pred:value> \"79001604\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many announcers have an ISCO occupation code of 2451 and a ROME Occupation Code (v3) of E1106?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> announcer . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2451\" . ?e <ROME Occupation Code (v3)> ?pv_1 . ?pv_1 <pred:value> \"E1106\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many software have official websites of https://www.apple.com/ios/ and https://www.apple.com/at/ios/?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <official website> ?pv . ?pv <pred:value> \"https://www.apple.com/ios/\" . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"https://www.apple.com/at/ios/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many albums have a duration of 2313.0?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> album . ?e <duration> ?pv . ?pv <pred:value> \"2313.0\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"2313.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Passaic's area equal to 8.39409?",
        "sparql": "ASK { ?e <pred:name> Passaic . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"8.39409\" . ?e <area> ?pv . ?pv <pred:value> \"8.39409\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the elevation above sea level of Lucknow equal to 123.0?",
        "sparql": "ASK { ?e <pred:name> Lucknow . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"123.0\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"123.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does ANTI- have an official website with the URL http://Anti.com listed twice?",
        "sparql": "ASK { ?e <pred:name> ANTI- . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://Anti.com\" . ?e <official website> ?pv . ?pv <pred:value> \"http://Anti.com\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the elevation above sea level of Mysore 763.0?",
        "sparql": "ASK { ?e <pred:name> Mysore . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"763.0\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"763.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the area of Chichester 8.61?",
        "sparql": "ASK { ?e <pred:name> Chichester . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"8.61\" . ?e <area> ?pv . ?pv <pred:value> \"8.61\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the area of Bozeman equal to 51.9518?",
        "sparql": "ASK { ?e <pred:name> Bozeman . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"51.9518\" . ?e <area> ?pv . ?pv <pred:value> \"51.9518\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Babyface's ISNI 0000 0000 7828 7057?",
        "sparql": "ASK { ?e <pred:name> Babyface . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7828 7057\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7828 7057\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cyprus have a Human Development Index of 0.668?",
        "sparql": "ASK { ?e <pred:name> Cyprus . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.668\" . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.668\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the elevation above sea level of Varanasi 76.0?",
        "sparql": "ASK { ?e <pred:name> Varanasi . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"76.0\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"76.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the organization with ISNI 0000 0001 2172 7549 have 80 seats?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2172 7549\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0000 0001 2172 7549\" . ?e <number of seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What facility has an ARCHON code of 345, a visitors per year of 6.41672e+06, and a fact t value of 345?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"345\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"345\" . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.41672e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a landform in New Zealand with an ISO 3166-2 code of NZ-S and a population of 1.1158e+06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> landform . ?e <ISO 3166-2 code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"NZ-S\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1158e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the annual number of visitors for the museum with an ARCHON code of 345?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"345\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"345\" . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.41672e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a filmmaking instance with 56 episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> filmmaking . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"56.0\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an airline with an IATA airline designator of FR, whose number of employees is 13000.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <IATA airline designator> ?pv_1 . ?pv_1 <pred:value> \"FR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IATA airline designator> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"FR\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13000.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a business with 500 employees and an additional fact stating that it has 500 employees with a unit of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"500.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"500.0\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city/town has a population of 758400 and a Dewey Decimal Classification of 2--4779?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4779\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2--4779\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"758400.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of the neighborhood whose elevation above sea level is 242.0 and has a population of 68469.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"242.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"242.0\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"68469.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Veneto (with a population of 4.92682e+06) and Carinthia (with a population of 560300.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Veneto\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.92682e+06\"^^xsd:double . ?e_2 <pred:name> Carinthia . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"560300.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Detroit (the one with a population of 713777.0) and Minsk (the one with a population of 1.98248e+06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Detroit\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"713777.0\"^^xsd:double . ?e_2 <pred:name> Minsk . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.98248e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kenya (whose Human Development Index is 0.539) and Namibia (whose Human Development Index is 0.62)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kenya\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.539\"^^xsd:double . ?e_2 <pred:name> Namibia . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.62\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Malaysia (with a population of 9.56978e+06) and Sabah (with a population of 3.1174e+06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Malaysia\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9.56978e+06\"^^xsd:double . ?e_2 <pred:name> Sabah . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.1174e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Chattanooga (with a population of 173366.0) and Swindon (with a population of 182441.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chattanooga\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"173366.0\"^^xsd:double . ?e_2 <pred:name> Swindon . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"182441.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between New Castle County (with a population of 549684.0) and Wilmington (with a population of 71525.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"New Castle County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"549684.0\"^^xsd:double . ?e_2 <pred:name> Wilmington . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"71525.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Salt Lake City (with a population of 186440) and Utah (with a population of 1.72285e+06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Salt Lake City\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"186440.0\"^^xsd:double . ?e_2 <pred:name> Utah . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.72285e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between France (with a population of 5.40331e+07) and Algiers (with a population of 2.08621e+06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"France\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.40331e+07\"^^xsd:double . ?e_2 <pred:name> Algiers . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.08621e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Michigan (with a population of 5.25611e+06) and Lansing (with a population of 114297.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michigan\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.25611e+06\"^^xsd:double . ?e_2 <pred:name> Lansing . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"114297.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Oswego County (with a population of 121165.0) and Oswego (with a population of 18142.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oswego County\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"121165.0\"^^xsd:double . ?e_2 <pred:name> Oswego . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"18142.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Liaoning have a China administrative division code of 21?",
        "sparql": "ASK { ?e <pred:name> Liaoning . ?e <China administrative division code> ?pv . ?pv <pred:value> \"21\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Colchester have an OS grid reference of TL997254?",
        "sparql": "ASK { ?e <pred:name> Colchester . ?e <OS grid reference> ?pv . ?pv <pred:value> \"TL997254\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the area of Altoona 25.3594?",
        "sparql": "ASK { ?e <pred:name> Altoona . ?e <area> ?pv . ?pv <pred:value> \"25.3594\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is http://www.dccomics.com/watchmen the official website of Watchmen?",
        "sparql": "ASK { ?e <pred:name> Watchmen . ?e <official website> ?pv . ?pv <pred:value> \"http://www.dccomics.com/watchmen\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Tucson's area equal to 598.61?",
        "sparql": "ASK { ?e <pred:name> Tucson . ?e <area> ?pv . ?pv <pred:value> \"598.61\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the area of Warwick 128.963?",
        "sparql": "ASK { ?e <pred:name> Warwick . ?e <area> ?pv . ?pv <pred:value> \"128.963\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of Spartacus 167.0?",
        "sparql": "ASK { ?e <pred:name> Spartacus . ?e <duration> ?pv . ?pv <pred:value> \"167.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the occupation code for an organist 2453?",
        "sparql": "ASK { ?e <pred:name> organist . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2453\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a folklore instance with Iconclass notation 95 and another Iconclass notation 94, where the latter is connected to 94 through a fact?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> folklore . ?e <Iconclass notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"94\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass notation> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"94\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a post-hardcore subreddit that is also a subreddit for Emo?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> post-hardcore . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Emo\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"Emo\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city/town has a Dewey Decimal Classification of 2--4779 and a licence plate code of BC?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4779\" . ?e <licence plate code> ?pv . ?pv <pred:value> \"BC\" . [ <pred:fact_h> ?e ; <pred:fact_r> <licence plate code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"BC\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a town with two OS grid references of TQ510887?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> town . ?e <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"TQ510887\" . ?e <OS grid reference> ?pv . ?pv <pred:value> \"TQ510887\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OS grid reference> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"TQ510887\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a musician with ISCO occupation code 2453 and ROME Occupation Code (v3) L1202?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> musician . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2453\" . ?e <ROME Occupation Code (v3)> ?pv . ?pv <pred:value> \"L1202\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ROME Occupation Code (v3)> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"L1202\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]