[
    {
        "question": "Does the sovereign state have a Human Development Index of 0.436?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the film have a box office of 8.96911e+08 with unit 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the date of birth of the person born on 1971-07-13?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1971-07-13\"^^xsd:date . ?e <date of birth> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the first performance of the film that had its first performance on 1982-02-04?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <date of first performance> ?pv_1 . ?pv_1 <pred:date> \"1982-02-04\"^^xsd:date . ?e <date of first performance> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the date of official opening for the television network that opened on 1970-10-05?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"television network\" . ?e <date of official opening> ?pv_1 . ?pv_1 <pred:date> \"1970-10-05\"^^xsd:date . ?e <date of official opening> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the date of dissolution, abolition or demolition for the first-level administrative country subdivision that was dissolved on 1803-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1803-01-01\"^^xsd:date . ?e <dissolved, abolished or demolished> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the end time of the anthology that ended on 1964-06-19?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1964-06-19\"^^xsd:date . ?e <end time> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the aircraft functional class have its first flight?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <first flight> ?pv_1 . ?pv_1 <pred:date> \"1969-02-09\"^^xsd:date . ?e <first flight> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Top Hat and Fred Astaire (whose name in native language is Fred Astaire)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Top Hat\" . ?e_2 <pred:name> \"Fred Astaire\" . ?e_2 <name in native language> ?pv . ?pv <pred:value> \"Fred Astaire\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Stuttgarter Kickers and Stuttgart (the one with the Twitter hashtag \"Stuttgart\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stuttgarter Kickers\" . ?e_2 <pred:name> \"Stuttgart\" . ?e_2 <Twitter hashtag> ?pv . ?pv <pred:value> \"Stuttgart\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Suffolk County and Boston (the one whose native label is \"Boston\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Suffolk County\" . ?e_2 <pred:name> \"Boston\" . ?e_2 <native label> ?pv . ?pv <pred:value> \"Boston\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon and Cameroon (the one with subreddit \"Cameroon\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <subreddit> ?pv . ?pv <pred:value> \"Cameroon\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of \"Harry Potter and the Order of the Phoenix\" with the title \"Harry Potter and the Order of the Phoenix\"?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_2 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_2 <title> ?pv . ?pv <pred:value> \"Harry Potter and the Order of the Phoenix\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Vladimir Lenin and the PhilPapers topic of heterosexuality?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vladimir Lenin\" . ?e_2 <pred:name> \"heterosexuality\" . ?e_2 <PhilPapers topic> ?pv . ?pv <pred:value> \"heterosexuality\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the nickname of Lawrence, who is the given name of Larry David?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Larry David\" . ?e_2 <pred:name> \"Lawrence\" . ?e_2 <nickname> ?pv . ?pv <pred:value> \"Larry\" . ?e_1 <given name> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <given name> ; <pred:fact_t> ?e_2 ] <nickname> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many episodes of Angel was the person with the name Angel present in?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Angel\" . ?e_2 <pred:name> \"Angel\" . ?e_2 <number of episodes> ?pv . ?pv <pred:value> \"110.0\" . ?e_1 <present in work> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <present in work> ; <pred:fact_t> ?e_2 ] <number of episodes> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many Spanish speakers are there in Australia (the one with 4.37e+08 speakers)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Australia\" . ?e_2 <pred:name> \"Spanish\" . ?e_2 <number of speakers> ?pv . ?pv <pred:value> \"4.37e+08\" . ?e_1 <language used> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <language used> ; <pred:fact_t> ?e_2 ] <number of speakers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official website of the Museum of Modern Art where Walter Benjamin's archives are located?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Walter Benjamin\" . ?e_2 <pred:name> \"Museum of Modern Art\" . ?e_2 <official website> ?pv . ?pv <pred:value> \"http://moma.org/\" . ?e_1 <archives at> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <archives at> ; <pred:fact_t> ?e_2 ] <official website> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of Russians living in Morocco (the one whose population is 2.51281e+07)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Russians\" . ?e_2 <pred:name> \"Morocco\" . ?e_2 <population> ?pv . ?pv <pred:value> \"2.51281e+07\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <population> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the postal code of the headquarters location of Harvard Business School in Boston (the one whose postal code is 02150)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Harvard Business School\" . ?e_2 <pred:name> \"Boston\" . ?e_2 <postal code> ?pv . ?pv <pred:value> \"02150\" . ?e_1 <headquarters location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <headquarters location> ; <pred:fact_t> ?e_2 ] <postal code> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the timezone offset between Eastern European Time and the location of the European Union?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"European Union\" . ?e_2 <pred:name> \"Eastern European Time\" . ?e_2 <timezone offset> ?pv . ?pv <pred:value> \"2.0\" . ?e_1 <located in time zone> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in time zone> ; <pred:fact_t> ?e_2 ] <timezone offset> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the object role of snowboarding in Utah, which has a population of 890627 and has snowboarding as an official symbol with subreddit \"snowboarding\"?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Utah\" . ?e_1 <population> ?pv . ?pv <pred:value> \"890627.0\" . ?e_2 <pred:name> \"snowboarding\" . ?e_2 <subreddit> ?pv_1 . ?pv_1 <pred:value> \"snowboarding\" . ?e_1 <official symbol> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <official symbol> ; <pred:fact_t> ?e_2 ] <object has role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Theofanis Gekas start being a member of FC Sion (the one with a native label of \"FC Sion\") and has a height of 179.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Theofanis Gekas\" . ?e_1 <height> ?pv . ?pv <pred:value> \"179.0\" . ?e_2 <pred:name> \"FC Sion\" . ?e_2 <native label> ?pv_1 . ?pv_1 <pred:value> \"FC Sion\" . ?e_1 <member of sports team> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <member of sports team> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many big cities have a population greater than arg1 and a detail map named \"Map Toulouse.jpg\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"big city\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . ?e <detail map> ?pv_1 . ?pv_1 <pred:value> \"Map Toulouse.jpg\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one whose Human Development Index is 0.39) and Africa (the one whose British Museum person-institution is 148397)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.39\"^^xsd:double . ?e_2 <pred:name> \"Africa\" . ?e_2 <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"148397\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of seats for an agent whose number of seats is less than arg1 and has a seat with a value of 59.0?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <number of seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 < \"arg1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seats> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"59.0\"^^xsd:double . ?e <number of seats> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Boston (the one whose inception is 1630-09-07) twin with Barcelona (the one with 6166.0 households)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Boston\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date . ?e_2 <pred:name> \"Barcelona\" . ?e_2 <number of households> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6166.0\"^^xsd:double . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Boston?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Boston\" . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--74461\" . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the OSM tag or key for a commercial art gallery with the value \"Tag:shop=art\"?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"commercial art gallery\" . ?e <OSM tag or key> ?pv_1 . ?pv_1 <pred:value> \"Tag:shop=art\" . ?e <OSM tag or key> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the OS grid reference for Burton upon Trent?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Burton upon Trent\" . ?e <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"SK245225\" . ?e <OS grid reference> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a cast member in the movie Miracle at St. Anna and what is the duration of the movie?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Miracle at St. Anna\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"160.0\" . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the city of the United States whose native label is Boston and whose inception date is 1630-09-07 also named Boston?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"Boston\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"Boston\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the city of the United States, whose inception date is 1630-09-07 and population is 617594, in the knowledge graph?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"617594.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the person born on 1899-05-10 have 2 children?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1899-05-10\"^^xsd:date . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the film with a publication date of 2005-11-06 and a box office of 8.96911e+08 belong to the film category?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-06\"^^xsd:date . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the theatrical genre with an end time of 1968-03-25 and one episode lasting 58.0 units exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1968-03-25\"^^xsd:date . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"58.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the video game console model that sold 1.5368e+08 units and was discontinued on 2013-01-04?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <discontinued date> ?pv_1 . ?pv_1 <pred:date> \"2013-01-04\"^^xsd:date . ?e <units sold> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.5368e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the aircraft functional class with a first flight on 1969-02-09 and a total production of 1527.0 units?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <first flight> ?pv_1 . ?pv_1 <pred:date> \"1969-02-09\"^^xsd:date . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1527.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which metropolitan area has a population of 6.155e+06?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.155e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6.155e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the city of the United States that was founded on 1630-09-07 founded only once?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the person born on 1931-09-21 have a date of birth equal to 1931-09-21?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1931-09-21\"^^xsd:date . ?e <date of birth> ?pv . ?pv <pred:date> \"1931-09-21\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the film published on 2008-09-07 if its publication date is 2008-01-01?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <publication date> ?pv . ?pv <pred:date> \"2008-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the play's date of first performance on November 16, 1959?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <date of first performance> ?pv_1 . ?pv_1 <pred:date> \"1959-11-16\"^^xsd:date . ?e <date of first performance> ?pv . ?pv <pred:date> \"1959-11-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the theatrical genre that ended on 1968-03-25 also have an end time on 1968-03-25?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"1968-03-25\"^^xsd:date . ?e <end time> ?pv . ?pv <pred:date> \"1968-03-25\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the 1968-04-10 Academy Awards ceremony take place on April 10, 1968?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <point in time> ?pv_1 . ?pv_1 <pred:date> \"1968-04-10\"^^xsd:date . ?e <point in time> ?pv . ?pv <pred:date> \"1968-04-10\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the capital city whose earliest written record is on 0965-01-17 the same as the one whose time of earliest written record is also on 0965-01-17?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"0965-01-17\"^^xsd:date . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]