[{"question": "What is the point in time for the organization with an Alexa rank of 360.0 (as of 2017-11-20) and an official website of https://www.target.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"360.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.target.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the town with a population of 344218.0 (as of 1970-01-01) stop being called \"\u0411\u0440\u044e\u043d\u043d\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"344218.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"1970-01-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"\u0411\u0440\u044e\u043d\u043d\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the point in time for the island with a population of 468730.0 (as of 2010-04-01) and a local dialing code of 347?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"468730.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2010-04-01\"^^xsd:date . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"347\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local_dialing_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the village with a population of 6323.0 (as of 2010-01-01) and a name in native language of Underhill's Crossing cease to exist?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2010-01-01\"^^xsd:date . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Underhill's Crossing\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the point in time when the city/town with a population of 816171.0 (as of 1989-01-21) has a local dialing code of 322?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"816171.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"1989-01-21\"^^xsd:date . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"322\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local_dialing_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many speakers did the language with the Wikimedia language code \"pl\" have on January 1, 2007?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.02e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2007-01-01\"^^xsd:date . ?e <Wikimedia_language_code> ?pv . ?pv <pred:value> \"pl\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Wikimedia_language_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the point in time for the country with a population of 56295.0 (as of 2014-07-01) and has a demonym of \u05d2\u05e8\u05d9\u05e0\u05dc\u05e0\u05d3\u05d9?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56295.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2014-07-01\"^^xsd:date . ?e <demonym> ?pv . ?pv <pred:value> \"\u05d2\u05e8\u05d9\u05e0\u05dc\u05e0\u05d3\u05d9\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the jurisdiction that the newspaper with an Alexa rank of 112.0 on 2017-11-20 and an official website of https://www.nytimes.com/ applies to?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.nytimes.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <applies_to_jurisdiction> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the business with an Alexa rank of 360.0 on 2017-11-20 and an official website of https://www.target.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"360.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.target.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Google have on Twitter in the industry with an Alexa rank of 1.0 as of 2017-11-20?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Google\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the point in time for the award whose Alexa rank is 126668.0 (as of 2018-01-09) and has an official website of http://www.emmys.com/ (the language of this statement is English)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"126668.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2018-01-09\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.emmys.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers did RafaelNadal have on Twitter on 2005-08-08 when his ranking was 26.0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ranking> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"26.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2005-08-08\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"RafaelNadal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the software with an Alexa rank of 1.0 and a Twitter username of Google have as of November 20, 2017?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Google\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of the university with an official website of http://www.sussex.ac.uk, a student count of 13725.0 on 2014-01-12?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13725.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2014-01-12\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sussex.ac.uk\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <country> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the point in time for the foundation with an Alexa rank of 29145.0 (as of 2017-11-28) and an official website of https://wikimediafoundation.org/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29145.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-28\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://wikimediafoundation.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the point in time for the manifestation with an Alexa rank of 112.0 (as of 2017-11-20) that applies to the jurisdiction of https://www.nytimes.com/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.nytimes.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <applies_to_jurisdiction> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the airline with the Twitter username \"lufthansa\" have as of December 31, 2017, and how many employees does it have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"129424.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-12-31\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"lufthansa\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the subreddit \"Yorkies\" have for the dog instance?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"2394.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the vegetarianism subreddit have, and how many subscribers does the vegan subreddit have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"vegetarianism\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"vegan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"189580.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"vegan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the activity with the Twitter username \"sonic20th\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"31585.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the philosophy subreddit with the name \"Conservative\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Conservative\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"133265.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Conservative\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the superhero with the subreddit \"batman\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"batman\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"194291.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"batman\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the drug with subreddit \"Marijuana\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"106576.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Carleton College's Twitter account have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"CarletonCollege\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"8047.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"CarletonCollege\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the LGBT subreddit \"lesbians\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"194100.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the sound with subreddit \"kpop\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"kpop\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"281136.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"kpop\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Twitter account \"LDSchurch\" have for Mormonism?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"LDSchurch\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"461456.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"LDSchurch\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the art subreddit \"photocritique\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"photocritique\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"166070.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"photocritique\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the science subreddit \"Anthropology\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Anthropology\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"56966.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Anthropology\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the subreddit \"MediterraneanSea\" have for the sea?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sea\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"MediterraneanSea\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"50.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"MediterraneanSea\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the number of subscribers for the business with the Twitter username HearstCorp?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"HearstCorp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"110.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"HearstCorp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the basketball subreddit \"CollegeBasketball\" have and what is its number of subscribers?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"CollegeBasketball\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"256367.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"CollegeBasketball\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the phenomenon with subreddit \"nature\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"nature\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"47980.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"nature\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the music subreddit \"kpop\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"kpop\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"281136.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"kpop\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the entertainment entity with the Twitter username \"sonic20th\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"31585.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the number of subscribers for the initialism with the subreddit \"lesbians\" and the number of subscribers equal to 194100.0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"194100.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the band with the Twitter username \"goldfingermusic\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"goldfingermusic\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"20707.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"goldfingermusic\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the number of subscribers for the airline with the Twitter username \"united\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"united\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"988612.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"united\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the color of Louisiana (the one with a publication date of 1919-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Louisiana\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1919-01-01\"^^xsd:date . ?e <color> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Management\" released on 2008-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Management\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Germany (the one whose inception date is 1949-05-23)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Germany\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1949-05-23\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Chicago (the one whose inception date is 1833-08-12)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chicago\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1833-08-12\"^^xsd:date . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Michelangelo (the one born on 1475-04-02)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Michelangelo\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1475-04-02\"^^xsd:date . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What work was published after Carrie (published on 2002-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Carrie\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2002-01-01\"^^xsd:date . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]