[{"question": "Does Swahili have an ISO 639-2 code of \"swa\" and a number of speakers equal to 1.54374e+07?", "sparql": "ASK { ?e <pred:name> \"Swahili\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.54374e+07\"^^xsd:double . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"swa\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Georgetown 235,017 and the area 147.6?", "sparql": "ASK { ?e <pred:name> \"Georgetown\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"235017.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"147.6\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Melbourne 70.0 and the area 112.011?", "sparql": "ASK { ?e <pred:name> \"Melbourne\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"70.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"112.011\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the demonym of Kosovo \"\u043a\u043e\u0441\u043e\u0432\u0430\u0440\u043a\u0430\" and its population 1.88302e+06?", "sparql": "ASK { ?e <pred:name> \"Kosovo\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.88302e+06\"^^xsd:double . ?e <demonym> ?pv . ?pv <pred:value> \"\u043a\u043e\u0441\u043e\u0432\u0430\u0440\u043a\u0430\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Lost have exactly 121 episodes?", "sparql": "ASK { ?e <pred:name> \"Lost\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"121.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"121.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Grenoble 160,779 and its elevation above sea level 212?", "sparql": "ASK { ?e <pred:name> \"Grenoble\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"160779.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"212.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Savannah have 34 episodes with a duration of 60 minutes each?", "sparql": "ASK { ?e <pred:name> \"Savannah\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"34.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"60.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Jackson 67685 and does it have an official website of http://www.cityofjackson.net/?", "sparql": "ASK { ?e <pred:name> \"Jackson\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"67685.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cityofjackson.net/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Limitless\" have 1 season with 22 episodes?", "sparql": "ASK { ?e <pred:name> \"Limitless\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"22.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Wuhan have a population of 11,895,000 and a local dialing code of 027?", "sparql": "ASK { ?e <pred:name> \"Wuhan\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1895e+07\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"027\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Detroit 713,777 and does it have a PermID of 5035884391?", "sparql": "ASK { ?e <pred:name> \"Detroit\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"713777.0\"^^xsd:double . ?e <PermID> ?pv . ?pv <pred:value> \"5035884391\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Cincinnati 24831.0 and does it have a Dewey Decimal Classification of 2--77178?", "sparql": "ASK { ?e <pred:name> \"Cincinnati\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"24831.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--77178\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Midland 41863.0 and the area 9.244e+07?", "sparql": "ASK { ?e <pred:name> \"Midland\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"41863.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"9.244e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Valencia 1.39632e+06 and the area 119.0?", "sparql": "ASK { ?e <pred:name> \"Valencia\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.39632e+06\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"119.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the female population of Bihar 4.98213e+07 and its FIPS 10-4 code IN04?", "sparql": "ASK { ?e <pred:name> \"Bihar\" . ?e <female_population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.98213e+07\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"IN04\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Pangasinan 2.95673e+06 and the area 5451.01?", "sparql": "ASK { ?e <pred:name> \"Pangasinan\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.95673e+06\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"5451.01\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hamburg 271,000 and does it have a Dewey Decimal Classification of 2--43515?", "sparql": "ASK { ?e <pred:name> \"Hamburg\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"271000.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--43515\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of McLean 38929 and the elevation above sea level 87?", "sparql": "ASK { ?e <pred:name> \"McLean\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"38929.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"87.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show \"Monk\" have exactly 125 episodes?", "sparql": "ASK { ?e <pred:name> \"Monk\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"125.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"125.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the Finnish language have an ISO 639-1 code of \"fi\" and a number of speakers equal to 272,000?", "sparql": "ASK { ?e <pred:name> \"Finnish\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"272000.0\"^^xsd:double . ?e <ISO_639-1_code> ?pv . ?pv <pred:value> \"fi\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Rochester 106769.0 and does it have a PermID of 5000362152?", "sparql": "ASK { ?e <pred:name> \"Rochester\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"106769.0\"^^xsd:double . ?e <PermID> ?pv . ?pv <pred:value> \"5000362152\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Yokohama 3.57963e+06 and does it have a Corporate Number (Japan) of 3000020141003?", "sparql": "ASK { ?e <pred:name> \"Yokohama\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.57963e+06\"^^xsd:double . ?e <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"3000020141003\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Drenthe have a population of 488,871 and a NUTS code of NL13?", "sparql": "ASK { ?e <pred:name> \"Drenthe\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"488871.0\"^^xsd:double . ?e <NUTS_code> ?pv . ?pv <pred:value> \"NL13\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Leipzig 560,472 and does it have a Dewey Decimal Classification of 2--432122?", "sparql": "ASK { ?e <pred:name> \"Leipzig\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"560472.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--432122\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Mecca 1,675,370 and the demonym Meccan?", "sparql": "ASK { ?e <pred:name> \"Mecca\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.67537e+06\"^^xsd:double . ?e <demonym> ?pv . ?pv <pred:value> \"Meccan\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Rwanda have a Human Development Index of 0.479 and a Dewey Decimal Classification of 2--67571?", "sparql": "ASK { ?e <pred:name> \"Rwanda\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.479\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--67571\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Durban 595,061 and its local dialing code 031?", "sparql": "ASK { ?e <pred:name> \"Durban\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"595061.0\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"031\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Yakima have a population of 91067.0 and a postal code of 98909?", "sparql": "ASK { ?e <pred:name> \"Yakima\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"91067.0\"^^xsd:double . ?e <postal_code> ?pv . ?pv <pred:value> \"98909\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Australia's Human Development Index 0.932 and its FIPS 10-4 code AS?", "sparql": "ASK { ?e <pred:name> \"Australia\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.932\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"AS\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Walsall equal to 276100.0 and does it have a FIPS 10-4 code of UKO8?", "sparql": "ASK { ?e <pred:name> \"Walsall\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"276100.0\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"UKO8\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Petaluma have a population of 58921 and a local dialing code of 707?", "sparql": "ASK { ?e <pred:name> \"Petaluma\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"58921.0\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"707\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Fife equal to 371400 and does it have an ISNI of 0000 0000 9146 3465?", "sparql": "ASK { ?e <pred:name> \"Fife\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"371400.0\"^^xsd:double . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9146 3465\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the Netherlands have a Human Development Index of 0.909 and a Dewey Decimal Classification of 2--492?", "sparql": "ASK { ?e <pred:name> \"Netherlands\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.909\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--492\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Waco 124,805 and the area 262.411?", "sparql": "ASK { ?e <pred:name> \"Waco\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"124805.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"262.411\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ghana have a Human Development Index of 0.427 and a Dewey Decimal Classification of 2--667?", "sparql": "ASK { ?e <pred:name> \"Ghana\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.427\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--667\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Chemnitz 243,521 and does it have a Dewey Decimal Classification of 2--432164?", "sparql": "ASK { ?e <pred:name> \"Chemnitz\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"243521.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--432164\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Doha 587,055 and does it have a Dewey Decimal Classification of 2--5363?", "sparql": "ASK { ?e <pred:name> \"Doha\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"587055.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5363\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Petersburg 32420.0 and does it have a Dewey Decimal Classification of 2--755581?", "sparql": "ASK { ?e <pred:name> \"Petersburg\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"32420.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--755581\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Mozambique's Human Development Index 0.218 and does it have a British Museum person-institution value of 179887?", "sparql": "ASK { ?e <pred:name> \"Mozambique\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.218\"^^xsd:double . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"179887\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Baku 111,904 and its FIPS 10-4 code AJ09?", "sparql": "ASK { ?e <pred:name> \"Baku\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"111904.0\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"AJ09\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Cupertino 58302.0 and the elevation above sea level 236.0?", "sparql": "ASK { ?e <pred:name> \"Cupertino\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"58302.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"236.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Yahoo's Alexa rank equal to 6.0?", "sparql": "ASK { ?e <pred:name> \"Yahoo\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.0\"^^xsd:double . ?e <Alexa_rank> ?pv . ?pv <pred:value> \"6.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Asia have a population of 9.47e+08 and a Dewey Decimal Classification of 2--5?", "sparql": "ASK { ?e <pred:name> \"Asia\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9.47e+08\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Dothan 65496 and does it have an official website of http://www.dothan.org/?", "sparql": "ASK { ?e <pred:name> \"Dothan\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"65496.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.dothan.org/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bremerton 37259 and does it have an official website of http://www.ci.bremerton.wa.us/?", "sparql": "ASK { ?e <pred:name> \"Bremerton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"37259.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.ci.bremerton.wa.us/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Guangzhou equal to 1.40435e+07 and does it have an official website of http://www.gz.gov.cn/?", "sparql": "ASK { ?e <pred:name> \"Guangzhou\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.40435e+07\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.gz.gov.cn/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Seoul's population 9.80654e+06 and its area 605.25?", "sparql": "ASK { ?e <pred:name> \"Seoul\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9.80654e+06\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"605.25\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Cuba have a Human Development Index of 0.685 and a Dewey Decimal Classification of 2--7291?", "sparql": "ASK { ?e <pred:name> \"Cuba\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.685\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--7291\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Rabat 375,000 and does it have an official website of http://www.rabat.ma?", "sparql": "ASK { ?e <pred:name> \"Rabat\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"375000.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.rabat.ma\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Chelmsford 115369.0 and the area 25.7?", "sparql": "ASK { ?e <pred:name> \"Chelmsford\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"115369.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"25.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Gloucester 28789.0 and the area 107.515?", "sparql": "ASK { ?e <pred:name> \"Gloucester\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"28789.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"107.515\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Alabama 2.64625e+06 and does it have a British Museum person-institution value of 102550?", "sparql": "ASK { ?e <pred:name> \"Alabama\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.64625e+06\"^^xsd:double . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"102550\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Flint 100,515 and does it have a native label equal to Flint?", "sparql": "ASK { ?e <pred:name> \"Flint\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"100515.0\"^^xsd:double . ?e <native_label> ?pv . ?pv <pred:value> \"Flint\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Ipswich 163,000 and the elevation above sea level 50?", "sparql": "ASK { ?e <pred:name> \"Ipswich\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"163000.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"50.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Normandy have an annual number of weddings equal to 12482.0 and an INSEE region code of 28?", "sparql": "ASK { ?e <pred:name> \"Normandy\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"12482.0\"^^xsd:double . ?e <INSEE_region_code> ?pv . ?pv <pred:value> \"28\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Austria have a Human Development Index of 0.853 and a Dewey Decimal Classification of 2--436?", "sparql": "ASK { ?e <pred:name> \"Austria\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.853\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--436\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Portsmouth 20909.0 and the area 28.6763?", "sparql": "ASK { ?e <pred:name> \"Portsmouth\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20909.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"28.6763\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Chuck have 91 episodes and a duration of 42 minutes?", "sparql": "ASK { ?e <pred:name> \"Chuck\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"91.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"42.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Bangkok's population 890,453 and its Dewey Decimal Classification 2--593?", "sparql": "ASK { ?e <pred:name> \"Bangkok\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"890453.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--593\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hastings 22172.0 and the area 28.7947?", "sparql": "ASK { ?e <pred:name> \"Hastings\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"22172.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"28.7947\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Easton 26800 and does it have an official website of http://www.easton-pa.com?", "sparql": "ASK { ?e <pred:name> \"Easton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"26800.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.easton-pa.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Geelong 184,182 and does it have an official website of http://www.geelong.vic.gov.au/?", "sparql": "ASK { ?e <pred:name> \"Geelong\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"184182.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.geelong.vic.gov.au/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Missoula 12668.0 and does it have a WOEID of 2452373?", "sparql": "ASK { ?e <pred:name> \"Missoula\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"12668.0\"^^xsd:double . ?e <WOEID> ?pv . ?pv <pred:value> \"2452373\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Irvine 33090.0 and does it have an OS grid reference of NS325395?", "sparql": "ASK { ?e <pred:name> \"Irvine\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"33090.0\"^^xsd:double . ?e <OS_grid_reference> ?pv . ?pv <pred:value> \"NS325395\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Tonga's FIPS 10-4 code TN and its Human Development Index 0.639?", "sparql": "ASK { ?e <pred:name> \"Tonga\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.639\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"TN\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Welsh the language with ISO 639-2 code \"cym\" and has 724,000 speakers?", "sparql": "ASK { ?e <pred:name> \"Welsh\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"724000.0\"^^xsd:double . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"cym\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Trenton have a population of 84913.0 and a postal code of 08620?", "sparql": "ASK { ?e <pred:name> \"Trenton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"84913.0\"^^xsd:double . ?e <postal_code> ?pv . ?pv <pred:value> \"08620\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Nauru 10084 and the demonym Nauruan?", "sparql": "ASK { ?e <pred:name> \"Nauru\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"10084.0\"^^xsd:double . ?e <demonym> ?pv . ?pv <pred:value> \"nauruan\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Enid 46436 and the area 191.755?", "sparql": "ASK { ?e <pred:name> \"Enid\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"46436.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"191.755\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Pleasantville 20249 and the area 18.8627?", "sparql": "ASK { ?e <pred:name> \"Pleasantville\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20249.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"18.8627\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]