[
    {
        "question": "What is the connection between two entities named Nuclear Blast?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nuclear Blast\" . ?e_2 <pred:name> \"Nuclear Blast\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Universal Pictures?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Universal Pictures\" . ?e_2 <pred:name> \"Universal Pictures\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Alice in Wonderland?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alice in Wonderland\" . ?e_2 <pred:name> \"Alice in Wonderland\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Richard III?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Richard III\" . ?e_2 <pred:name> \"Richard III\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Stephen Colbert?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stephen Colbert\" . ?e_2 <pred:name> \"Stephen Colbert\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Seal?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Seal\" . ?e_2 <pred:name> \"Seal\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Erin Brockovich?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Erin Brockovich\" . ?e_2 <pred:name> \"Erin Brockovich\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Havok?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Havok\" . ?e_2 <pred:name> \"Havok\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Python?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Python\" . ?e_2 <pred:name> \"Python\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Malcolm X?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Malcolm X\" . ?e_2 <pred:name> \"Malcolm X\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the relationship between two instances of chicken?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"chicken\" . ?e_2 <pred:name> \"chicken\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many entertainment items have a publication date of 2008-11-04 and a Nintendo GameID of RRGP52?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication date> ?pv . ?pv <pred:date> \"2008-11-04\"^^xsd:date . ?e <Nintendo GameID> ?pv_1 . ?pv_1 <pred:value> \"RRGP52\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What work did Michael Douglas receive the Academy Award for Best Picture for (assuming his name in native language is \"Michael Douglas\")?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Michael Douglas\" . ?e_1 <name in native language> ?pv . ?pv <pred:value> \"Michael Douglas\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <award received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award received> ; <pred:fact_t> ?e_2 ] <for work> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which political party had less than arg1 representatives in an organization/legislature, but had 199 representatives as of 2019-01-03?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"199.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of representatives in an organization/legislature> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"2019-01-03\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which agent had an Alexa rank less than arg1 and a rank of 42.0 on 2017-11-20?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"42.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Gene Kelly (the one born on 1912-08-23) and Fred Astaire (the one born on 1899-05-10)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gene Kelly\" . ?e_1 <date of birth> ?pv . ?pv <pred:date> \"1912-08-23\"^^xsd:date . ?e_2 <pred:name> \"Fred Astaire\" . ?e_2 <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1899-05-10\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two editions of Harry Potter and the Order of the Phoenix, one published on 2007-06-25 and the other on 2007-06-28?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_1 <publication date> ?pv . ?pv <pred:date> \"2007-06-25\"^^xsd:date . ?e_2 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2007-06-28\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Midway Games (which was dissolved, abolished or demolished on 2009-01-01) and Atari Games (which was dissolved, abolished or demolished on 2003-02-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Midway Games\" . ?e_1 <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"2009-01-01\"^^xsd:date . ?e_2 <pred:name> \"Atari Games\" . ?e_2 <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"2003-02-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which TV production company has 8200 employees?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"TV production company\" . ?e <employees> ?pv . ?pv <pred:value> \"8200.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"8200.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Boston's elevation above sea level 43.0?",
        "sparql": "ASK { ?e <pred:name> \"Boston\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"43.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"43.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Bharatiya Janata Party have 117 representatives in Lok Sabha?",
        "sparql": "ASK { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:value> \"117.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of representatives in an organization/legislature> ; <pred:fact_t> ?pv ] <legislative body> ?qpv . ?qpv <pred:value> \"Lok Sabha\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many sovereign states have a nominal GDP of 6.7044e+09 and a total fertility rate less than arg4?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <nominal GDP> ?pv . ?pv <pred:value> \"6.7044e+09\" . ?e <total fertility rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does MegaMan NT Warrior have less than 56 episodes?",
        "sparql": "ASK { ?e <pred:name> \"MegaMan NT Warrior\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"56.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit \"PortHuron\" related to the city with a WOEID of 2475403 named Port Huron?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Port Huron\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2475403\" . ?e <subreddit> ?pv . ?pv <pred:value> \"PortHuron\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the subject's role for Burton upon Trent, which has a TOID of 4000000074552364 and an OS grid reference of SK245225?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Burton upon Trent\" . ?e <OS grid reference> ?pv_1 . ?pv_1 <pred:value> \"SK245225\" . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074552364\" . [ <pred:fact_h> ?e ; <pred:fact_r> <TOID> ; <pred:fact_t> ?pv ] <subject has role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the date of birth of the child of John Adams whose name is John Quincy Adams and was born on 1767-07-11?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"John Adams\" . ?e_2 <pred:name> \"John Quincy Adams\" . ?e_2 <date of birth> ?pv . ?pv <pred:date> \"1767-07-11\"^^xsd:date . ?e_1 <child> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <child> ; <pred:fact_t> ?e_2 ] <date of birth> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Bas-Rhin stop being located in the administrative territorial entity of Alsace?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Bas-Rhin\" . ?e_2 <pred:name> \"Alsace\" . ?e_2 <end time> ?pv . ?pv <pred:date> \"2016-01-01\"^^xsd:date . ?e_1 <located in the administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in the administrative territorial entity> ; <pred:fact_t> ?e_2 ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Australia start using pound sterling as its currency?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Australia\" . ?e_2 <pred:name> \"pound sterling\" . ?e_2 <start time> ?pv . ?pv <pred:date> \"1694-07-27\"^^xsd:date . ?e_1 <currency> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <currency> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Club Olimpia Deportivo founded on January 1st, 1912?",
        "sparql": "ASK { ?e <pred:name> \"Club Olimpia Deportivo\" . ?e <inception> ?pv . ?pv <pred:date> \"1912-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did The Sound of Music have its first performance on November 16, 1959?",
        "sparql": "ASK { ?e <pred:name> \"The Sound of Music\" . ?e <date of first performance> ?pv . ?pv <pred:date> \"1959-11-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Chris Carter born on September 16th, 1982?",
        "sparql": "ASK { ?e <pred:name> \"Chris Carter\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1982-09-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Get Carter published on August 16, 2001?",
        "sparql": "ASK { ?e <pred:name> \"Get Carter\" . ?e <publication date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Somerset end on December 31st, 1976?",
        "sparql": "ASK { ?e <pred:name> \"Somerset\" . ?e <end time> ?pv . ?pv <pred:date> \"1976-12-31\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Raja Casablanca officially open on March 6th, 1955?",
        "sparql": "ASK { ?e <pred:name> \"Raja Casablanca\" . ?e <date of official opening> ?pv . ?pv <pred:date> \"1955-03-06\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Hudson Soft dissolved, abolished or demolished on March 1st, 2012?",
        "sparql": "ASK { ?e <pred:name> \"Hudson Soft\" . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"2012-03-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the 40th Academy Awards take place on April 10th, 1968?",
        "sparql": "ASK { ?e <pred:name> \"40th Academy Awards\" . ?e <point in time> ?pv . ?pv <pred:date> \"1968-04-10\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the PlayStation 2 discontinued on January 4th, 2013?",
        "sparql": "ASK { ?e <pred:name> \"PlayStation 2\" . ?e <discontinued date> ?pv . ?pv <pred:date> \"2013-01-04\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the earliest written record of Prague (the one dated 0965-01-17)?",
        "sparql": "ASK { ?e <pred:name> \"Prague\" . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the date of baptism in early childhood for Johann Sebastian Bach (born on 1685-03-23)?",
        "sparql": "ASK { ?e <pred:name> \"Johann Sebastian Bach\" . ?e <date of baptism in early childhood> ?pv . ?pv <pred:date> \"1685-03-23\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the Boeing 747 have its first flight on February 9th, 1969?",
        "sparql": "ASK { ?e <pred:name> \"Boeing 747\" . ?e <first flight> ?pv . ?pv <pred:date> \"1969-02-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Boston (the one whose inception date is 1630-09-07 and native label is Boston)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Boston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <native label> ?pv . ?pv <pred:value> \"Boston\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the People's Democratic Party (whose native label is People's Democratic Party) to Nigeria (the one whose Human Development Index is 0.499)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"People's Democratic Party\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"People's Democratic Party\" . ?e_2 <pred:name> \"Nigeria\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.499\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States had an area of 259.0 and ended on 1846-07-09?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <area> ?pv . ?pv <pred:value> \"259.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <area> ; <pred:fact_t> ?pv ] <end time> ?qpv . ?qpv <pred:date> \"1846-07-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many humans died on September 1st, 1988?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of death> ?pv . ?pv <pred:date> \"1988-09-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many films were published on February 20th, 1997?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv . ?pv <pred:date> \"1997-02-20\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit PortHuron, which is related to the city of the United States with a WOEID of 2475403?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2475403\" . [ <pred:fact_h> ?e ; <pred:fact_r> <WOEID> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"2475403\" . ?e <subreddit> ?pv . ?pv <pred:value> \"PortHuron\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cameroon have a Human Development Index of 0.436?",
        "sparql": "ASK { ?e <pred:name> \"Cameroon\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Bharatiya Janata Party have 1.1e+08 members and 117 representatives in an organization/legislature?",
        "sparql": "ASK { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <member count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1e+08\"^^xsd:double . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Harry Potter and the Goblet of Fire have a box office revenue of 8.96911e+08 in the same unit as the one mentioned in the statement?",
        "sparql": "ASK { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]