[
    {
        "question": "Is the foundation with an Alexa rank of 29145.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> foundation . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29145.0\"^^xsd:double . ?e <Alexa rank> ?pv . ?pv <pred:value> \"29145.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the PhilPapers topic of a philosophy instance related to philosophy-of-mind?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> philosophy . ?e <PhilPapers topic> ?pv_1 . ?pv_1 <pred:value> \"philosophy-of-mind\" . ?e <PhilPapers topic> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IPTC Newscode for a homicide with a Dewey Decimal Classification of 364.66?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> homicide . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"364.66\" . ?e <IPTC Newscode> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who are the famous people associated with the funk subreddit that is related to electro?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> funk . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"electro\" . ?e <famous people> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin for the disco genre subreddit, italodisco?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> disco . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISCO occupation code for a chemist?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> chemist . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO occupation code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin for the trance subreddit that is related to psytrance?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> trance . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IPTC Newscode of the product with the name \"product\" and the mediatic topic code \"mediatopic/20000245\"?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> product . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000245\" . ?e <IPTC Newscode> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the seminary that has an ISNI of 0000 0001 2184 9191?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> seminary . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2184 9191\" . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the DiseasesDB ID for psychosis?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> psychosis . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"11890\" . ?e <DiseasesDB> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISNI of the university whose ISNI is 0000 0004 1936 8286?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1936 8286\" . ?e <ISNI> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact t for the symptom with DiseasesDB ID 25363?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> symptom . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"25363\" . [ <pred:fact_h> ?e ; <pred:fact_r> <DiseasesDB> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"25363\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"25363\" . [ <pred:fact_h> ?e ; <pred:fact_r> <DiseasesDB> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact t for the song with ISWC T-010.162.677-0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> song . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-010.162.677-0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"T-010.162.677-0\" . ?e <ISWC> ?pv . ?pv <pred:value> \"T-010.162.677-0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISCO occupation code for a scientist and what is the fact t for this code?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> scientist . ?e <ISCO occupation code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"2212\" . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2212\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the landform with an ISO 3166-2 code of NZ-S and has a fact t value of NZ-S? Also, what is its fact t value for another ISO 3166-2 code of NZ-S?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> landform . ?e <ISO 3166-2 code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"NZ-S\" . ?e <ISO 3166-2 code> ?pv . ?pv <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IAB code for fiction and what is the fact t for that code?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> fiction . ?e <IAB code> ?pv_1 . ?pv_1 <pred:value> \"642\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"642\" . ?e <IAB code> ?pv . ?pv <pred:value> \"642\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact t for the manga with the official website http://tezukaosamu.net, and what is the fact t for its official website?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> manga . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"http://tezukaosamu.net\" . ?e <official website> ?pv . ?pv <pred:value> \"http://tezukaosamu.net\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IPTC Newscode fact t for the phenomenon with IPTC Newscode \"mediatopic/20000441\" in both cases?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> phenomenon . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000441\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"mediatopic/20000441\" . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000441\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IAB code for a music instance that has a code of 368 and has a fact t value of 368?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> music . ?e <IAB code> ?pv_1 . ?pv_1 <pred:value> \"368\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB code> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"368\" . ?e <IAB code> ?pv . ?pv <pred:value> \"368\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IPTC Newscode fact t for a product with IPTC Newscode \"mediatopic/20000245\" in two different instances?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> product . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000245\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"mediatopic/20000245\" . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000245\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Library of Congress Classification for law that has a value of HV4708 and has a fact t value of HV4708, and also has another fact t value of HV4708?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> law . ?e <Library of Congress Classification> ?pv_1 . ?pv_1 <pred:value> \"HV4708\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Library of Congress Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"HV4708\" . ?e <Library of Congress Classification> ?pv . ?pv <pred:value> \"HV4708\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Library of Congress Classification> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Scotland (the one with a native label of Scotland) and Fife?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Scotland\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"Scotland\" . ?e_2 <pred:name> Fife . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the subreddit \"breakbeat\" and sound in relation to breakbeat?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"breakbeat\" . ?e_1 <subreddit> ?pv . ?pv <pred:value> \"breakbeat\" . ?e_2 <pred:name> sound . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Mariah Carey (whose birth name is Mariah Carey) and Huntington?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mariah Carey\" . ?e_1 <birth name> ?pv . ?pv <pred:value> \"Mariah Carey\" . ?e_2 <pred:name> Huntington . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Laura Dern (whose name in native language is also Laura Dern) and someone named Laura?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Laura Dern\" . ?e_1 <name in native language> ?pv . ?pv <pred:value> \"Laura Dern\" . ?e_2 <pred:name> Laura . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the Danube (the one with an official name of Danube) and a river?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Danube\" . ?e_1 <official name> ?pv . ?pv <pred:value> \"Danube\" . ?e_2 <pred:name> river . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Leuven (the one with a native label of Leuven) and Belgium?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Leuven\" . ?e_1 <native label> ?pv . ?pv <pred:value> \"Leuven\" . ?e_2 <pred:name> Belgium . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Annie (the one with the title \"Annie\") and Rihanna?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Annie\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Annie\" . ?e_2 <pred:name> Rihanna . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the month August and Norwegian (the one with a Dictionary of Medieval Names from European Sources entry of \"August\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"August\" . ?e_1 <Dictionary of Medieval Names from European Sources entry> ?pv . ?pv <pred:value> \"August\" . ?e_2 <pred:name> Norwegian . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Bill Wyman (the one whose name in native language is Bill Wyman) and photography?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bill Wyman\" . ?e_1 <name in native language> ?pv . ?pv <pred:value> \"Bill Wyman\" . ?e_2 <pred:name> photographer . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Brooklyn (the one with subreddit \"Brooklyn\") and Queens?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brooklyn\" . ?e_1 <subreddit> ?pv . ?pv <pred:value> \"Brooklyn\" . ?e_2 <pred:name> Queens . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity has an ICD-10 code of R10 and is related to pain?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> pain . ?e <ICD-10> ?pv . ?pv <pred:value> \"R10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ICD-10> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"R10\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which governor has an official website of http://governor.ky.gov/?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> governor . ?e <official website> ?pv . ?pv <pred:value> \"http://governor.ky.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"http://governor.ky.gov/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which news entity has a Snapchat username of \"gma\" and a fact t value of \"gma\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> news . ?e <Snapchat username> ?pv . ?pv <pred:value> \"gma\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Snapchat username> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"gma\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which position has the Iconclass notation of 44B151211?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> position . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"44B151211\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass notation> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"44B151211\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity is related to bobsleigh and has an IPTC Newscode of \"mediatopic/20001055\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> bobsleigh . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20001055\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"mediatopic/20001055\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which fiction has an IAB code of 642?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> fiction . ?e <IAB code> ?pv . ?pv <pred:value> \"642\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"642\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity has the instance of Tagalog and Glottolog code equal to fili1244?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Tagalog . ?e <Glottolog code> ?pv . ?pv <pred:value> \"fili1244\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"fili1244\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which industry has a NACE code of \"C\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <NACE code> ?pv . ?pv <pred:value> \"C\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NACE code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"C\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an animation with 56 episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> animation . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a university with ISNI 0000 0001 2288 3033 that has 500 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2288 3033\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Serbo-Croatian the language with Dewey Decimal Classification of 491.82 and 1.2e+07 speakers?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Serbo-Croatian . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"491.82\" . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.2e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a business with 500 employees and the same number of employees in unit 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"500.0\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a facility with an ARCHON code of 345 that has 6.41672e+06 visitors per year?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"345\" . ?e <visitors per year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.41672e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Chinese (the one with Glottolog code yuec1235) spoken by 6.22216e+07 people?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Chinese . ?e <Glottolog code> ?pv_1 . ?pv_1 <pred:value> \"yuec1235\" . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.22216e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the capital, whose Dewey Decimal Classification is 2--43712, have 4787 employees?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43712\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4787.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]