[
    {
        "question": "Is the OLAC video game genre vocabulary for the life simulation game equal to 1041?",
        "sparql": "ASK { ?e <pred:name> \"life simulation game\" . ?e <OLAC video game genre vocabulary> ?pv_1 . ?pv_1 <pred:value> \"1041\" . ?e <OLAC video game genre vocabulary> ?pv . ?pv <pred:value> \"1041\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of the U.S. city with Dewey Decimal Classification 2--74461 equal to 617594 and also has a Dewey Decimal Classification of 2--74461?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--74461\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2--74461\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"617594.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one with a Human Development Index of 0.39) and Ivory Coast (also with a Human Development Index of 0.39)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.39\"^^xsd:double . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.39\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon (the one whose inception is 1960-01-01) and Cameroon (the one whose Human Development Index is 0.436)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Harry Potter and the Goblet of Fire (published on 2000-07-08) and Harry Potter and the Goblet of Fire (with a box office of 8.96911e+08)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_1 <publication date> ?pv . ?pv <pred:date> \"2000-07-08\"^^xsd:date . ?e_2 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the National Gallery (the one with a date of first performance of 2014-05-17) and the National Gallery (the one with 6.41672e+06 visitors per year)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"National Gallery\" . ?e_1 <date of first performance> ?pv . ?pv <pred:date> \"2014-05-17\"^^xsd:date . ?e_2 <pred:name> \"National Gallery\" . ?e_2 <visitors per year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.41672e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has an elevation above sea level of 184.0 and a population greater than arg6?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"184.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"184.0\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg6\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the knight have an Iconclass notation of 46A124?",
        "sparql": "ASK { ?e <pred:name> \"knight\" . ?e <Iconclass notation> ?pv . ?pv <pred:value> \"46A124\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Ipswich's elevation above sea level 50.0?",
        "sparql": "ASK { ?e <pred:name> \"Ipswich\" . ?e <elevation above sea level> ?pv . ?pv <pred:value> \"50.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does mechanical engineering have an IPTC Newscode of mediatopic/20000716?",
        "sparql": "ASK { ?e <pred:name> \"mechanical engineering\" . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000716\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the area of Whanganui 2.3727?",
        "sparql": "ASK { ?e <pred:name> \"Whanganui\" . ?e <area> ?pv . ?pv <pred:value> \"2.3727\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"UAG Tecos\" another name for Estudiantes Tecos?",
        "sparql": "ASK { ?e <pred:name> \"Estudiantes Tecos\" . ?e <name> ?pv . ?pv <pred:value> \"UAG Tecos\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Bureau of Land Management have an ISNI of 0000 0000 9987 0743?",
        "sparql": "ASK { ?e <pred:name> \"Bureau of Land Management\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9987 0743\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the Hornbostel-Sachs classification of a bell 111.242?",
        "sparql": "ASK { ?e <pred:name> \"bell\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"111.242\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the OS grid reference of Pontefract SE455215?",
        "sparql": "ASK { ?e <pred:name> \"Pontefract\" . ?e <OS grid reference> ?pv . ?pv <pred:value> \"SE455215\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Chris Carter's height 183.0?",
        "sparql": "ASK { ?e <pred:name> \"Chris Carter\" . ?e <height> ?pv . ?pv <pred:value> \"183.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Independence have a Dewey Decimal Classification of 2--79487?",
        "sparql": "ASK { ?e <pred:name> \"Independence\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--79487\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Rafael Nadal have a CANTIC-ID of a11246789?",
        "sparql": "ASK { ?e <pred:name> \"Rafael Nadal\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11246789\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Bharatiya Janata Party have a British Museum person-institution ID of 8433?",
        "sparql": "ASK { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"8433\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Farrah Fawcett have a Deutsche Synchronkartei actor-ID of 10012?",
        "sparql": "ASK { ?e <pred:name> \"Farrah Fawcett\" . ?e <Deutsche Synchronkartei actor-ID> ?pv . ?pv <pred:value> \"10012\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Harry Potter and the Prisoner of Azkaban earn a box office revenue of 7.96688e+08?",
        "sparql": "ASK { ?e <pred:name> \"Harry Potter and the Prisoner of Azkaban\" . ?e <box office> ?pv . ?pv <pred:value> \"7.96688e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Club Olimpia Deportivo have an official website with the URL http://www.clubolimpia.com/?",
        "sparql": "ASK { ?e <pred:name> \"Club Olimpia Deportivo\" . ?e <official website> ?pv . ?pv <pred:value> \"http://www.clubolimpia.com/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Canberra have an IMO ship number of 5059953?",
        "sparql": "ASK { ?e <pred:name> \"Canberra\" . ?e <IMO ship number> ?pv . ?pv <pred:value> \"5059953\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cardiff University have an ARCHON code of 1239?",
        "sparql": "ASK { ?e <pred:name> \"Cardiff University\" . ?e <ARCHON code> ?pv . ?pv <pred:value> \"1239\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Somerset have 1710 episodes?",
        "sparql": "ASK { ?e <pred:name> \"Somerset\" . ?e <number of episodes> ?pv . ?pv <pred:value> \"1710.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Carleton University have a DOI prefix of 10.22215?",
        "sparql": "ASK { ?e <pred:name> \"Carleton University\" . ?e <DOI prefix> ?pv . ?pv <pred:value> \"10.22215\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Franz Schubert have a NSDAP membership number (1925-1945) of 44488?",
        "sparql": "ASK { ?e <pred:name> \"Franz Schubert\" . ?e <NSDAP membership number (1925\u20131945> ?pv . ?pv <pred:value> \"44488\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Guitar Hero III: Legends of Rock have a Nintendo GameID of RGHJ52?",
        "sparql": "ASK { ?e <pred:name> \"Guitar Hero III: Legends of Rock\" . ?e <Nintendo GameID> ?pv . ?pv <pred:value> \"RGHJ52\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Saskatoon have a Statistics Canada Geographic code of 4711066?",
        "sparql": "ASK { ?e <pred:name> \"Saskatoon\" . ?e <Statistics Canada Geographic code> ?pv . ?pv <pred:value> \"4711066\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the spoken text audio \"Simple en Evolution.oga\" pertain to evolution?",
        "sparql": "ASK { ?e <pred:name> \"evolution\" . ?e <spoken text audio> ?pv . ?pv <pred:value> \"Simple en Evolution.oga\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Aurora have a Caverphone code of ARR111?",
        "sparql": "ASK { ?e <pred:name> \"Aurora\" . ?e <Caverphone> ?pv . ?pv <pred:value> \"ARR111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does geography have a Classification of Instructional Programs code of 45.0799?",
        "sparql": "ASK { ?e <pred:name> \"geography\" . ?e <Classification of Instructional Programs code> ?pv . ?pv <pred:value> \"45.0799\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"Die Hard: New York\" the codename for Die Hard with a Vengeance?",
        "sparql": "ASK { ?e <pred:name> \"Die Hard with a Vengeance\" . ?e <codename> ?pv . ?pv <pred:value> \"Die Hard: New York\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Hearts and Minds have a production code of 111?",
        "sparql": "ASK { ?e <pred:name> \"Hearts and Minds\" . ?e <production code> ?pv . ?pv <pred:value> \"111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does serum have a UMLS CUI of C0229671?",
        "sparql": "ASK { ?e <pred:name> \"serum\" . ?e <UMLS CUI> ?pv . ?pv <pred:value> \"C0229671\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the ISO 4217 code for the Canadian dollar CAD?",
        "sparql": "ASK { ?e <pred:name> \"Canadian dollar\" . ?e <ISO 4217 code> ?pv . ?pv <pred:value> \"CAD\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the occupation code for a cartoonist 2452?",
        "sparql": "ASK { ?e <pred:name> \"cartoonist\" . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2452\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Parkinson disease have a DiseasesDB ID of 9651?",
        "sparql": "ASK { ?e <pred:name> \"Parkinson disease\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"9651\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Trainspotting have an ISBN-10 of 85-325-1773-0?",
        "sparql": "ASK { ?e <pred:name> \"Trainspotting\" . ?e <ISBN-10> ?pv . ?pv <pred:value> \"85-325-1773-0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Adobe Inc. have an ACM Classification Code (2012) of 10011154?",
        "sparql": "ASK { ?e <pred:name> \"Adobe Inc.\" . ?e <ACM Classification Code (2012)> ?pv . ?pv <pred:value> \"10011154\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does John Adams have a Biografisch Portaal number of 57767253?",
        "sparql": "ASK { ?e <pred:name> \"John Adams\" . ?e <Biografisch Portaal number> ?pv . ?pv <pred:value> \"57767253\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"life simulation game\" categorized under OLAC video game genre vocabulary with code 1041?",
        "sparql": "ASK { ?e <pred:name> \"life simulation game\" . ?e <OLAC video game genre vocabulary> ?pv . ?pv <pred:value> \"1041\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a Bulbapedia article about Shigeru Miyamoto?",
        "sparql": "ASK { ?e <pred:name> \"Shigeru Miyamoto\" . ?e <Bulbapedia article> ?pv . ?pv <pred:value> \"Shigeru Miyamoto\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which first-level administrative country subdivision has more than arg1 representatives in an organization/legislature and exactly 135 representatives in an organization/legislature?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"arg1\"^^xsd:double ) . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"135.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the Primetime Emmy Award have a higher Alexa rank than 126668.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v_1 . FILTER ( ?v_1 > \"arg1\"^^xsd:double ) . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"126668.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]