[
    {
        "question": "When did Underhill's Crossing (the village with a population of 6323.0 as of 2010-01-01) stop having its name in native language?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> village . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2010-01-01\"^^xsd:date . ?e <name in native language> ?pv . ?pv <pred:value> \"Underhill's Crossing\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name in native language> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the population of the island with a local dialing code of 347 on April 1st, 2010? And what is the point in time for this fact?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"468730.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2010-04-01\"^^xsd:date . ?e <local dialing code> ?pv . ?pv <pred:value> \"347\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local dialing code> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many subscribers did RafaelNadal have on Twitter on August 8th, 2005, when he was ranked number 1 among humans?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <ranking> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"26.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2005-08-08\"^^xsd:date . ?e <Twitter username> ?pv . ?pv <pred:value> \"RafaelNadal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the number of subscribers for Google's Twitter account on November 20th, 2017, for the software whose Alexa rank is 1.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> software . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <Twitter username> ?pv . ?pv <pred:value> \"Google\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the Human Development Index of the state in 2001, which had 101331 out-of-school children and the point in time for this fact was also 2001-01-01?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <number of out-of-school children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"101331.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number of out-of-school children> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2001-01-01\"^^xsd:date . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.683\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the population of the landform with a local dialing code of 347 on April 1st, 2010?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> landform . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"468730.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2010-04-01\"^^xsd:date . ?e <local dialing code> ?pv . ?pv <pred:value> \"347\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local dialing code> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the end time for the film with an attendance of 8446.0 on 2018-05-30?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8446.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv_1 . ?qpv_1 <pred:date> \"2018-05-30\"^^xsd:date . ?e <attendance> ?pv . ?pv <pred:value> \"8446.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv ] <end time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What jurisdiction does the manifestation with an Alexa rank of 112.0 on 2017-11-20 and an official website of https://www.nytimes.com/ apply to?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> manifestation . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"https://www.nytimes.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <applies to jurisdiction> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for Google's Twitter account in the industry with an Alexa rank of 1.0 as of November 20, 2017?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> industry . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv_1 . ?qpv_1 <pred:date> \"2017-11-20\"^^xsd:date . ?e <Twitter username> ?pv . ?pv <pred:value> \"Google\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the absolute magnitude of the star whose absolute magnitude is 4.83 and has a unit of 1?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> star . ?e <absolute magnitude> ?pv_1 . ?pv_1 <pred:value> \"4.83\" . [ <pred:fact_h> ?e ; <pred:fact_r> <absolute magnitude> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"4.83\"^^xsd:double . ?e <absolute magnitude> ?pv . ?pv <pred:value> \"4.83\" . [ <pred:fact_h> ?e ; <pred:fact_r> <absolute magnitude> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the street address of the cemetery with 20000 graves?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> cemetery . ?e <number of graves> ?pv_1 . ?pv_1 <pred:value> \"20000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of graves> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"20000.0\"^^xsd:double . ?e <located at street address (DEPRECATED)> ?pv . ?pv <pred:value> \"Avenue Samson, 37\" . [ <pred:fact_h> ?e ; <pred:fact_r> <located at street address (DEPRECATED)> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the time period when the population of a city was 163000.0 (with unit 1)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> city . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"163000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"163000.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"163000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the time when the organization with ISNI 0000 0001 2172 7549 had 80 seats (the unit is 1 and the value is 80.0)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <number of seats> ?pv_1 . ?pv_1 <pred:value> \"80.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seats> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"80.0\"^^xsd:double . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2172 7549\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the LGBT instance whose subreddit is \"lesbians\" and has 194100.0 subscribers?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> LGBT . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"194100.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the time period during which the crime with 6 million deaths occurred?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> crime . ?e <number of deaths> ?pv_1 . ?pv_1 <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"6e+06\"^^xsd:double . ?e <number of deaths> ?pv . ?pv <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of deaths> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the nationality of a population of 6 million and what is the fact time for this population count?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> nationality . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"6e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of pages and OCLC control number for the anthology with a page count of 218.0 and OCLC control number of 357792?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> anthology . ?e <number of pages> ?pv_1 . ?pv_1 <pred:value> \"218.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of pages> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"218.0\"^^xsd:double . ?e <OCLC control number> ?pv . ?pv <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC control number> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the drug subreddit named Marijuana?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> drug . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"106576.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of episodes and seasons for a comedy show with 25 episodes and 1 season?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> comedy . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"25.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"25.0\"^^xsd:double . ?e <number of seasons> ?pv . ?pv <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of seasons> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of origin of the protopunk genre, which was founded on January 1st, 1965?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> protopunk . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1965-01-01\"^^xsd:date . ?e <country of origin> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What work was Congo published after (the one published on 1995-08-17)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Congo . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1995-08-17\"^^xsd:date . ?e <after a work by> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Nintendo GameID for Ratatouille, which was published on 2007-06-26?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Ratatouille . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2007-06-26\"^^xsd:date . ?e <Nintendo GameID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the CANTIC-ID and publication date of the movie Psycho (released in 1960)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Psycho . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was a cast member in the 2015-08-14 publication of Brothers?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Brothers . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2015-08-14\"^^xsd:date . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was a cast member in Zoolander, which was published on 2001-12-27?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Zoolander . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2001-12-27\"^^xsd:date . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Guinea (the one whose inception date is 1958-01-01)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Guinea . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1958-01-01\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What award did Tyrannosaur receive and when was it published?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Tyrannosaur . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2011-01-01\"^^xsd:date . ?e <award received> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What award did Yentl receive and on what date was it published?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Yentl . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1984-03-30\"^^xsd:date . ?e <award received> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was a cast member in House (published on 2008-01-01)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> House . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Illinois (the one whose FIPS 10-4 code is US17) related to its inception date of 1818-12-03?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Illinois . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1818-12-03\"^^xsd:date . ?e <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"US17\" . [ <pred:fact_h> ?e ; <pred:fact_r> <FIPS 10-4 (countries and regions)> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for Nike's official website, which was founded on 1964-01-25?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Nike . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-25\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"https://www.nike.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the author of the fact related to the title \"Amelia\" (published on 2009-01-01)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Amelia . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Amelia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the publisher of Cairo (the one published on 1942-01-01) with a duration of 100.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Cairo . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1942-01-01\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"100.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What happened to slavery (the one with IPTC Newscode mediatopic/20000807) and when did it happen?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> slavery . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"1865-12-18\"^^xsd:date . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000807\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time for Toledo (the one with an inception date of 1960-06-19) to have an electorate of 101713.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Toledo . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-06-19\"^^xsd:date . ?e <electorate> ?pv . ?pv <pred:value> \"101713.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <electorate> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with Orry-Kelly (the one whose date of birth is 1897-12-31 and ISNI is 0000 0003 6862 2319)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Orry-Kelly . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1897-12-31\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0003 6862 2319\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the city of Helena, whose inception date is 1864-10-30 and official website is http://www.ci.helena.mt.us?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Helena . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1864-10-30\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://www.ci.helena.mt.us\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the female population of Haryana on the date of its inception, which is November 1st, 1966?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Haryana . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-11-01\"^^xsd:date . ?e <female population> ?pv . ?pv <pred:value> \"1.18567e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <female population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the production company of the work named 1941, which was published on 1979-12-13 and has a duration of 113.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> 1941 . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1979-12-13\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"113.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Umbria have a population of 891,848 and an area of 8,456?",
        "sparql": "ASK { ?e <pred:name> Umbria . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"891848.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"8456.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]