[
    {
        "question": "Is the municipality of the Netherlands with Amsterdam code 11157 the same as the one with Amsterdam code 11157?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"municipality of the Netherlands\" . ?e <Amsterdam code> ?pv_1 . ?pv_1 <pred:value> \"11157\" . ?e <Amsterdam code> ?pv . ?pv <pred:value> \"11157\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Super Smash Bros. Brawl an entertainment with a Bulbapedia article that matches its name?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Bulbapedia article> ?pv_1 . ?pv_1 <pred:value> \"Super Smash Bros. Brawl\" . ?e <Bulbapedia article> ?pv . ?pv <pred:value> \"Super Smash Bros. Brawl\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a family name with a Caverphone code of NSN111?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"family name\" . ?e <Caverphone> ?pv_1 . ?pv_1 <pred:value> \"NSN111\" . ?e <Caverphone> ?pv . ?pv <pred:value> \"NSN111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the video game publisher with Corporate Number (Japan) 1011001060972 the same as the one with Corporate Number (Japan) 1011001060972?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game publisher\" . ?e <Corporate Number (Japan)> ?pv_1 . ?pv_1 <pred:value> \"1011001060972\" . ?e <Corporate Number (Japan)> ?pv . ?pv <pred:value> \"1011001060972\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the class of instruments with Common Procurement Vocabulary 37316600 have Common Procurement Vocabulary 37316600?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"class of instruments\" . ?e <Common Procurement Vocabulary> ?pv_1 . ?pv_1 <pred:value> \"37316600\" . ?e <Common Procurement Vocabulary> ?pv . ?pv <pred:value> \"37316600\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the political ideology with a Debian stable package of anarchism have another Debian stable package of anarchism?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"political ideology\" . ?e <Debian stable package> ?pv_1 . ?pv_1 <pred:value> \"anarchism\" . ?e <Debian stable package> ?pv . ?pv <pred:value> \"anarchism\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a taxon with an EPPO Code of 1CICHF?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <EPPO Code> ?pv_1 . ?pv_1 <pred:value> \"1CICHF\" . ?e <EPPO Code> ?pv . ?pv <pred:value> \"1CICHF\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a national association football team with a FIFA country code of GPE?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <FIFA country code> ?pv_1 . ?pv_1 <pred:value> \"GPE\" . ?e <FIFA country code> ?pv . ?pv <pred:value> \"GPE\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the drum with Hornbostel-Sachs classification 211.212.11 the same as the one with Hornbostel-Sachs classification 211.212.11?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs classification> ?pv_1 . ?pv_1 <pred:value> \"211.212.11\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"211.212.11\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index of Ivory Coast and when did it become a country? Also, what is the connection between Ivory Coast and the fact in the statement?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:value> \"0.376\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one with a Human Development Index of 0.39) and Ivory Coast (the one whose inception date is 1960-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.39\"^^xsd:double . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the number of pages and publication date of Harry Potter and the Philosopher's Stone?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Philosopher's Stone\" . ?e_1 <number of pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"309.0\"^^xsd:double . ?e_2 <pred:name> \"Harry Potter and the Philosopher's Stone\" . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2001-11-22\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a metropolitan area with a population of 6.155e+06 and a fact with a value of 6.155e+06, and also has a population greater than arg6?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.155e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6.155e+06\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg6\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who said \"I love you, too\" as their last words to George W. Bush and has a CANTIC-ID of a10808231?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a10808231\" . ?e <last words> ?pv_1 . ?pv_1 <pred:value> \"I love you, too.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <last words> ; <pred:fact_t> ?pv_1 ] <addressee> ?qpv . ?qpv <pred:value> \"George W. Bush\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What state of the United States has the British Museum person-institution ID of 102550, a nickname of \"The Yellowhammer State\", and a start period during the American Civil War?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state of the United States\" . ?e <British Museum person-institution> ?pv . ?pv <pred:value> \"102550\" . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"The Yellowhammer State\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nickname> ; <pred:fact_t> ?pv_1 ] <start period> ?qpv . ?qpv <pred:value> \"American Civil War\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the McCune-Reischauer romanization of the Korean martial art, whose IPTC Newscode is mediatopic/20001084 and native label is \ud0dc\uad8c\ub3c4, and is also known as t\u2019aekwondo?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"martial arts\" . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20001084\" . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"\ud0dc\uad8c\ub3c4\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv_1 ] <McCune-Reischauer romanization> ?qpv . ?qpv <pred:value> \"t\u2019aekwondo\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the academic discipline that has an Instagram username of morningmusume official and a name in kana of \u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081, with a Revised Hepburn romanization of M\u014dningu Musume?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <Instagram username> ?pv . ?pv <pred:value> \"morningmusume official\" . ?e <name in kana> ?pv_1 . ?pv_1 <pred:value> \"\u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name in kana> ; <pred:fact_t> ?pv_1 ] <Revised Hepburn romanization> ?qpv . ?qpv <pred:value> \"M\u014dningu Musume\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Boston's elevation above sea level and native label?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Boston\" . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"43.0\" . ?e <native label> ?pv . ?pv <pred:value> \"Boston\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Cameroon, which has a Human Development Index of 0.507?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Cameroon\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.507\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Cameroon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Thunder Bay (the one whose duration is 103.0) to James Stewart?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Thunder Bay\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"103.0\" . ?e_2 <pred:name> \"James Stewart\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Newport (the one with FIPS 10-4 code UKY6) and Newport?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Newport\" . ?e_1 <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"UKY6\" . ?e_2 <pred:name> \"Newport\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kevin Clash (the one with ISNI 0000 0000 7779 2799) and the Primetime Emmy Award?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kevin Clash\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0000 7779 2799\" . ?e_2 <pred:name> \"Primetime Emmy Award\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the native label of Boston equal to \"Boston\" and was it founded on 1630-09-07?",
        "sparql": "ASK { ?e <pred:name> \"Boston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <native label> ?pv . ?pv <pred:value> \"Boston\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Fred Astaire's name in native language Fred Astaire and was he born on May 10th, 1899?",
        "sparql": "ASK { ?e <pred:name> \"Fred Astaire\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1899-05-10\"^^xsd:date . ?e <name in native language> ?pv . ?pv <pred:value> \"Fred Astaire\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What film was published in Germany on August 16, 2001, has a duration of 98.0, and is of the instance_of \"film\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which aircraft functional class, with a service entry date of 1970-01-22 and an operator of Pan Am, has a total production of 1527.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <service entry> ?pv . ?pv <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" . ?e <total produced> ?pv_1 . ?pv_1 <pred:value> \"1527.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Boston (whose population is 617594.0) become a part of the United States of America (whose Human Development Index is 0.92)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Boston\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"617594.0\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.92\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast and Ivory Coast (the one with Dewey Decimal Classification 2--6668)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6668\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between St. Clair County and Port Huron (the one whose WOEID is 2475403)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"St. Clair County\" . ?e_2 <pred:name> \"Port Huron\" . ?e_2 <WOEID> ?pv . ?pv <pred:value> \"2475403\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Kurt Vonnegut and Butler University (the one located at 4600 Sunset Ave, Indianapolis, IN, 46208)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kurt Vonnegut\" . ?e_2 <pred:name> \"Butler University\" . ?e_2 <located at street address (DEPRECATED)> ?pv . ?pv <pred:value> \"4600 Sunset Ave, Indianapolis, IN, 46208\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Michael Redgrave and the knight with Iconclass notation 46A124?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Michael Redgrave\" . ?e_2 <pred:name> \"knight\" . ?e_2 <Iconclass notation> ?pv . ?pv <pred:value> \"46A124\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Harry Potter and the Order of the Phoenix, where one has a box office value of 9.39886e+08?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_2 <pred:name> \"Harry Potter and the Order of the Phoenix\" . ?e_2 <box office> ?pv . ?pv <pred:value> \"9.39886e+08\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one whose inception is 1960-01-01) and Ivory Coast (the one whose inception is also 1960-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the publication of Harry Potter and the Goblet of Fire on July 8, 2000 and November 16, 2005?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_1 <publication date> ?pv . ?pv <pred:date> \"2000-07-08\"^^xsd:date . ?e_2 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <publication date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-16\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Roger Moore (born on 1927-10-14) and Roger Moore (born on 1900-09-21)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Roger Moore\" . ?e_1 <date of birth> ?pv . ?pv <pred:date> \"1927-10-14\"^^xsd:date . ?e_2 <pred:name> \"Roger Moore\" . ?e_2 <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1900-09-21\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Brno (the ones with the earliest written record date of 1091-01-17)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brno\" . ?e_1 <time of earliest written record> ?pv . ?pv <pred:date> \"1091-01-17\"^^xsd:date . ?e_2 <pred:name> \"Brno\" . ?e_2 <time of earliest written record> ?pv_1 . ?pv_1 <pred:date> \"1091-01-17\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What conflict is associated with both Richard Nixon and World War II?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Richard Nixon\" . ?e_2 <pred:name> \"World War II\" . ?e_1 <conflict> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <conflict> ; <pred:fact_t> ?e_2 ] <conflict> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the country of citizenship of Giovani dos Santos who is related to Brazil?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Giovani dos Santos\" . ?e_2 <pred:name> \"Brazil\" . ?e_1 <country of citizenship> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country of citizenship> ; <pred:fact_t> ?e_2 ] <country of citizenship> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What administrative territorial entity is Manhattan located in, which is also the location of Fordham University School of Law?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Fordham University School of Law\" . ?e_2 <pred:name> \"Manhattan\" . ?e_1 <located in the administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <located in the administrative territorial entity> ; <pred:fact_t> ?e_2 ] <located in the administrative territorial entity> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which administrative body is twinned with both Seoul and New York City?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Seoul\" . ?e_2 <pred:name> \"New York City\" . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <twinned administrative body> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many human settlements have a male population greater than a certain value? (Note: the specific value is not provided in the query)",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human settlement\" . ?e <male population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many capitals have a rural population greater than a certain value (arg1)?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <rural population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many republics have more than arg1 out-of-school children?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <number of out-of-school children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many businesses have an Alexa rank greater than arg1?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]