[{"question": "What is the connection between Mongolia (the one with a Human Development Index of 0.524) and Mongolia (the one with an inception date of 1911-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mongolia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.524\"^^xsd:double . ?e_2 <pred:name> \"Mongolia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1911-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Grenada (the one with a Human Development Index of 0.739) and Grenada (the one with an inception date of 1974-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grenada\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.739\"^^xsd:double . ?e_2 <pred:name> \"Grenada\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Gibraltar (the one with a population of 33140.0) and Gibraltar (the one with an inception date of 1704-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gibraltar\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33140.0\"^^xsd:double . ?e_2 <pred:name> \"Gibraltar\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1704-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Liechtenstein (the one with a Human Development Index of 0.907) and Liechtenstein (the one with an inception date of 1806-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Liechtenstein\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.907\"^^xsd:double . ?e_2 <pred:name> \"Liechtenstein\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1806-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the TV show Charmed (which has 8.0 episodes) and its end time on 2006-05-21?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Charmed\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.0\"^^xsd:double . ?e_2 <pred:name> \"Charmed\" . ?e_2 <end_time> ?pv_1 . ?pv_1 <pred:date> \"2006-05-21\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Honduras (the one with a Human Development Index of 0.606) and Honduras (the one with an inception date of 1821-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Honduras\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.606\"^^xsd:double . ?e_2 <pred:name> \"Honduras\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the TV show Crash (which has 26 episodes) and the publication date of 2005-05-06?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Crash\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"26.0\"^^xsd:double . ?e_2 <pred:name> \"Crash\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-05-06\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Japan (the one with a Human Development Index of 0.886) and Japan (the one with an inception date of 1947-05-03)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Japan\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.886\"^^xsd:double . ?e_2 <pred:name> \"Japan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-05-03\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Aachen (the one with a population of 23413.0) and Aachen (the one with an inception date of 2009-10-21)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Aachen\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"23413.0\"^^xsd:double . ?e_2 <pred:name> \"Aachen\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"2009-10-21\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Venezuela (the one with a Human Development Index of 0.628) and Venezuela (the one with an inception date of 1811-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Venezuela\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.628\"^^xsd:double . ?e_2 <pred:name> \"Venezuela\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1811-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ireland (the one with a Human Development Index of 0.861) and Ireland (the one with an inception date of 1937-12-29)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ireland\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.861\"^^xsd:double . ?e_2 <pred:name> \"Ireland\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1937-12-29\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Eswatini (the one with a Human Development Index of 0.473) and Eswatini (the one with an inception date of 1968-09-06)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Eswatini\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.473\"^^xsd:double . ?e_2 <pred:name> \"Eswatini\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-09-06\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Uganda (the one with a Human Development Index of 0.476) and Uganda (the one with an inception date of 1962-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Uganda\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.476\"^^xsd:double . ?e_2 <pred:name> \"Uganda\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Maldives (the one with a Human Development Index of 0.603) and Maldives (the one with an inception date of 1965-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Maldives\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.603\"^^xsd:double . ?e_2 <pred:name> \"Maldives\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1965-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Tuvalu (the one with a population of 9590.0) and Tuvalu (the one with an inception date of 1978-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tuvalu\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9590.0\"^^xsd:double . ?e_2 <pred:name> \"Tuvalu\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bhutan (the one with a Human Development Index of 0.582) and Bhutan (the one with an inception date of 1907-12-17)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bhutan\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.582\"^^xsd:double . ?e_2 <pred:name> \"Bhutan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1907-12-17\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ethiopia (the one with a Human Development Index of 0.423) and Ethiopia (the one with an inception date of 1941-05-05)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ethiopia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.423\"^^xsd:double . ?e_2 <pred:name> \"Ethiopia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1941-05-05\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Colombia (the one with a Human Development Index of 0.573) and Colombia (the one with an inception date of 1810-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Colombia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.573\"^^xsd:double . ?e_2 <pred:name> \"Colombia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1810-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Brazil (the one with a Human Development Index of 0.692) and Brazil (the one with an inception date of 1822-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brazil\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.692\"^^xsd:double . ?e_2 <pred:name> \"Brazil\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Botswana (the one with a Human Development Index of 0.518) and Botswana (the one with an inception date of 1966-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Botswana\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.518\"^^xsd:double . ?e_2 <pred:name> \"Botswana\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Zimbabwe (the one with a Human Development Index of 0.509) and Zimbabwe (the one with an inception date of 1980-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Zimbabwe\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.509\"^^xsd:double . ?e_2 <pred:name> \"Zimbabwe\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1980-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Georgia (the one with a Human Development Index of 0.735) and Georgia (the one with an inception date of 1788-01-02)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Georgia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.735\"^^xsd:double . ?e_2 <pred:name> \"Georgia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-01-02\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Portugal (the one with a Human Development Index of 0.827) and Portugal (the one with an inception date of 1143-10-05)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Portugal\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.827\"^^xsd:double . ?e_2 <pred:name> \"Portugal\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1143-10-05\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ecuador (the one with a Human Development Index of 0.603) and Ecuador (the one with an inception date of 1811-10-11)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ecuador\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.603\"^^xsd:double . ?e_2 <pred:name> \"Ecuador\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1811-10-11\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Nicaragua (the one whose Human Development Index is 0.478) and Nicaragua (the one whose inception date is 1821-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nicaragua\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.478\"^^xsd:double . ?e_2 <pred:name> \"Nicaragua\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Luxembourg (the one with a Human Development Index of 0.89) and Luxembourg (the one with an inception date of 1815-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Luxembourg\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.89\"^^xsd:double . ?e_2 <pred:name> \"Luxembourg\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1815-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Jamaica (the one with a Human Development Index of 0.648) and Jamaica (the one with an inception date of 1962-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jamaica\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.648\"^^xsd:double . ?e_2 <pred:name> \"Jamaica\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bury (the one with a population of 78729.0) and Bury (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bury\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"78729.0\"^^xsd:double . ?e_2 <pred:name> \"Bury\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Iraq (the one with a Human Development Index of 0.552) and Iraq (the one with an inception date of 1932-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Iraq\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.552\"^^xsd:double . ?e_2 <pred:name> \"Iraq\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1932-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Dallas (the one with 357.0 number of episodes) and Dallas (the one that ended on 2014-09-22)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dallas\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"357.0\"^^xsd:double . ?e_2 <pred:name> \"Dallas\" . ?e_2 <end_time> ?pv_1 . ?pv_1 <pred:date> \"2014-09-22\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Algeria (the one with a Human Development Index of 0.644) and Algeria (the one with an inception date of 1962-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Algeria\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.644\"^^xsd:double . ?e_2 <pred:name> \"Algeria\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Norway (the one with a Human Development Index of 0.942) and Norway (the one with an inception date of 1905-06-07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Norway\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.942\"^^xsd:double . ?e_2 <pred:name> \"Norway\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1905-06-07\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Brandenburg (the one with a population of 2.725e+06) and Brandenburg (the one with an inception date of 1990-10-03)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brandenburg\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.725e+06\"^^xsd:double . ?e_2 <pred:name> \"Brandenburg\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-10-03\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Germany (the one with a Human Development Index of 0.83) and Germany (the one with an inception date of 1949-05-23)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Germany\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.83\"^^xsd:double . ?e_2 <pred:name> \"Germany\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1949-05-23\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Singapore (the one whose Human Development Index is 0.841) and Singapore (the one whose inception date is 1965-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Singapore\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.841\"^^xsd:double . ?e_2 <pred:name> \"Singapore\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1965-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Tanzania (the one with a Human Development Index of 0.5) and Tanzania (the one with an inception date of 1964-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tanzania\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.5\"^^xsd:double . ?e_2 <pred:name> \"Tanzania\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Panama (the one whose Human Development Index is 0.656) and Panama (the one whose inception date is 1903-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Panama\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.656\"^^xsd:double . ?e_2 <pred:name> \"Panama\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1903-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Nepal (the one with a Human Development Index of 0.531) and Nepal (the one with an inception date of 1768-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nepal\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.531\"^^xsd:double . ?e_2 <pred:name> \"Nepal\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1768-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Oldham (the one with a population of 96555.0) and Oldham (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oldham\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"96555.0\"^^xsd:double . ?e_2 <pred:name> \"Oldham\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Greece (the one with a Human Development Index of 0.864) and Greece (the one with an inception date of 1821-03-25)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Greece\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.864\"^^xsd:double . ?e_2 <pred:name> \"Greece\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-03-25\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guinea (the one with a Human Development Index of 0.399) and Guinea (the one with an inception date of 1958-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guinea\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.399\"^^xsd:double . ?e_2 <pred:name> \"Guinea\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1958-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Kiribati (the one with a Human Development Index of 0.589) and Kiribati (the one with an inception date of 1979-07-12)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kiribati\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.589\"^^xsd:double . ?e_2 <pred:name> \"Kiribati\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1979-07-12\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Israel (the one with a Human Development Index of 0.899) and Israel (the one with an inception date of 1948-05-14)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Israel\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.899\"^^xsd:double . ?e_2 <pred:name> \"Israel\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1948-05-14\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Cambodia (the one with a Human Development Index of 0.55) and Cambodia (the one with an inception date of 1953-11-09)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cambodia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.55\"^^xsd:double . ?e_2 <pred:name> \"Cambodia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1953-11-09\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Switzerland (the one with a Human Development Index of 0.846) and Switzerland (the one with an inception date of 1291-08-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Switzerland\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.846\"^^xsd:double . ?e_2 <pred:name> \"Switzerland\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1291-08-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Thuringia (the one with a population of 2.161e+06) and Thuringia (the one dissolved, abolished, or demolished on 1952-07-25)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Thuringia\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.161e+06\"^^xsd:double . ?e_2 <pred:name> \"Thuringia\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1952-07-25\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Jordan (the one with a Human Development Index of 0.743) and Jordan (the one with an inception date of 1946-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jordan\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.743\"^^xsd:double . ?e_2 <pred:name> \"Jordan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Pakistan (the one whose Human Development Index is 0.538) and Pakistan (the one whose inception date is 1947-08-14)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pakistan\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.538\"^^xsd:double . ?e_2 <pred:name> \"Pakistan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-08-14\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Romania (the one with a Human Development Index of 0.791) and Romania (the one with an inception date of 1859-01-24)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Romania\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.791\"^^xsd:double . ?e_2 <pred:name> \"Romania\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1859-01-24\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Melbourne (the one with a population of 70.0) and Melbourne (the one with an inception date of 1835-08-30)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Melbourne\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"70.0\"^^xsd:double . ?e_2 <pred:name> \"Melbourne\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1835-08-30\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Punjab (the one with a population of 1.01391e+08) and Punjab (the one with an inception date of 1956-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Punjab\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.01391e+08\"^^xsd:double . ?e_2 <pred:name> \"Punjab\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Animaniacs (the one with 99.0 episodes) and Animaniacs (the one with a publication date of 1997-03-07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Animaniacs\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"99.0\"^^xsd:double . ?e_2 <pred:name> \"Animaniacs\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1997-03-07\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mexico (the one with a Human Development Index of 0.634) and Mexico (the one with an inception date of 1810-09-16)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mexico\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.634\"^^xsd:double . ?e_2 <pred:name> \"Mexico\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1810-09-16\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]