[{"question": "Does Brescia have a population of 196,359?", "sparql": "ASK { ?e <pred:name> \"Brescia\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"196359.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the Philippines have a Human Development Index of 0.623?", "sparql": "ASK { ?e <pred:name> \"Philippines\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.623\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Downey have a population of 111,772?", "sparql": "ASK { ?e <pred:name> \"Downey\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"111772.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Africa have 106 million out-of-school children?", "sparql": "ASK { ?e <pred:name> \"Africa\" . ?e <number_of_out-of-school_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.06e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Chicago have a population of 350.0?", "sparql": "ASK { ?e <pred:name> \"Chicago\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"350.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nuremberg have 2.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Nuremberg\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Utica have a population of 62235?", "sparql": "ASK { ?e <pred:name> \"Utica\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"62235.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Evansville have a population of 117,429?", "sparql": "ASK { ?e <pred:name> \"Evansville\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"117429.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kyoto have a population of 100,000?", "sparql": "ASK { ?e <pred:name> \"Kyoto\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"100000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Williamsport have a population of 29381.0?", "sparql": "ASK { ?e <pred:name> \"Williamsport\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29381.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Princeton have a population of 31249?", "sparql": "ASK { ?e <pred:name> \"Princeton\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"31249.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Waterbury have a population of 110,366?", "sparql": "ASK { ?e <pred:name> \"Waterbury\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"110366.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Hokkaido have a population of 5.31056e+06?", "sparql": "ASK { ?e <pred:name> \"Hokkaid\u014d\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.31056e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Belgrade have a population of 1.2338e+06?", "sparql": "ASK { ?e <pred:name> \"Belgrade\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.2338e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Harare have a population of 1.606e+06?", "sparql": "ASK { ?e <pred:name> \"Harare\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.606e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Alice have 202.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Alice\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"202.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pretoria have a population of 741,651?", "sparql": "ASK { ?e <pred:name> \"Pretoria\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"741651.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Moline have a population of 43483?", "sparql": "ASK { ?e <pred:name> \"Moline\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"43483.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Naperville have a population of 141,853?", "sparql": "ASK { ?e <pred:name> \"Naperville\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"141853.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pisa have a population of 87353?", "sparql": "ASK { ?e <pred:name> \"Pisa\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"87353.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kampala have a population of 1.6596e+06?", "sparql": "ASK { ?e <pred:name> \"Kampala\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.6596e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Graz have a population of 282,479?", "sparql": "ASK { ?e <pred:name> \"Graz\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"282479.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Tours have a population of 41061?", "sparql": "ASK { ?e <pred:name> \"Tours\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"41061.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Galveston have a population of 57466?", "sparql": "ASK { ?e <pred:name> \"Galveston\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"57466.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Corsica have an annual number of weddings equal to 1192.0?", "sparql": "ASK { ?e <pred:name> \"Corsica\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1192.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Martinique have an annual number of weddings equal to 1017.0?", "sparql": "ASK { ?e <pred:name> \"Martinique\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1017.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Hackensack have a population of 14050?", "sparql": "ASK { ?e <pred:name> \"Hackensack\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"14050.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Palermo have a population of 671,531?", "sparql": "ASK { ?e <pred:name> \"Palermo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"671531.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Monza have a population of 123,000?", "sparql": "ASK { ?e <pred:name> \"Monza\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"123000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Jalisco have a population of 7.84483e+06?", "sparql": "ASK { ?e <pred:name> \"Jalisco\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.84483e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Rouen have a population of 110169.0?", "sparql": "ASK { ?e <pred:name> \"Rouen\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"110169.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Melaka have a population of 788,706?", "sparql": "ASK { ?e <pred:name> \"Melaka\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"788706.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Chile have a Human Development Index of 0.699?", "sparql": "ASK { ?e <pred:name> \"Chile\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.699\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Lviv have a population of 758,400?", "sparql": "ASK { ?e <pred:name> \"Lviv\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"758400.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Rockford have a population of 152,871?", "sparql": "ASK { ?e <pred:name> \"Rockford\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"152871.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 90,000,000 speakers of Filipino?", "sparql": "ASK { ?e <pred:name> \"Filipino\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Haifa have a population of 281,087?", "sparql": "ASK { ?e <pred:name> \"Haifa\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"281087.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Biloxi have a population of 44578?", "sparql": "ASK { ?e <pred:name> \"Biloxi\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"44578.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Taipei have a population of 2,697,640?", "sparql": "ASK { ?e <pred:name> \"Taipei\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.69764e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Alabama have a population of 2.64625e+06?", "sparql": "ASK { ?e <pred:name> \"Alabama\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.64625e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Milwaukee have a population of 594,833?", "sparql": "ASK { ?e <pred:name> \"Milwaukee\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"594833.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Italian have 3.026e+06 speakers?", "sparql": "ASK { ?e <pred:name> \"Italian\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.026e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bulawayo have a population of 653,337?", "sparql": "ASK { ?e <pred:name> \"Bulawayo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"653337.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 43 million speakers of Indonesian?", "sparql": "ASK { ?e <pred:name> \"Indonesian\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.3e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the maximum number of players in tennis 4.0?", "sparql": "ASK { ?e <pred:name> \"tennis\" . ?e <maximum_number_of_players> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Caracas have a population of 1.9439e+06?", "sparql": "ASK { ?e <pred:name> \"Caracas\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.9439e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Z\u00fcrich have a population of 264,043?", "sparql": "ASK { ?e <pred:name> \"Z\u00fcrich\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"264043.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does glycine have a pKa value of 2.35?", "sparql": "ASK { ?e <pred:name> \"glycine\" . ?e <pKa> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.35\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Dearborn have a population of 98153?", "sparql": "ASK { ?e <pred:name> \"Dearborn\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"98153.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Lille have a population of 231,491?", "sparql": "ASK { ?e <pred:name> \"Lille\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"231491.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kentucky have a population of 2.94481e+06?", "sparql": "ASK { ?e <pred:name> \"Kentucky\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.94481e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Madagascar have a Human Development Index of 0.505?", "sparql": "ASK { ?e <pred:name> \"Madagascar\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.505\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Sunderland have a population of 174,286?", "sparql": "ASK { ?e <pred:name> \"Sunderland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"174286.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bradenton have a population of 50672.0?", "sparql": "ASK { ?e <pred:name> \"Bradenton\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50672.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kiel have a population of 5430.0?", "sparql": "ASK { ?e <pred:name> \"Kiel\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5430.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Varna have a population of 348,058?", "sparql": "ASK { ?e <pred:name> \"Varna\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"348058.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Stockholm have a population of 935,619?", "sparql": "ASK { ?e <pred:name> \"Stockholm\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"935619.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Butte have a population of 33892.0?", "sparql": "ASK { ?e <pred:name> \"Butte\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33892.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Nijmegen have 88819.0 households?", "sparql": "ASK { ?e <pred:name> \"Nijmegen\" . ?e <number_of_households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"88819.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Oslo have a population of 623,966?", "sparql": "ASK { ?e <pred:name> \"Oslo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"623966.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Odessa have a population of 99940?", "sparql": "ASK { ?e <pred:name> \"Odessa\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"99940.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Slovakia have a Human Development Index of 0.844?", "sparql": "ASK { ?e <pred:name> \"Slovakia\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.844\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Dunfermline have a population of 50380.0?", "sparql": "ASK { ?e <pred:name> \"Dunfermline\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50380.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Gothenburg have a population of 549,839?", "sparql": "ASK { ?e <pred:name> \"Gothenburg\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"549839.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Shiraz have a female population of 842,454?", "sparql": "ASK { ?e <pred:name> \"Shiraz\" . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"842454.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bradford have a population of 531,200?", "sparql": "ASK { ?e <pred:name> \"Bradford\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"531200.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Longview have a population of 80455?", "sparql": "ASK { ?e <pred:name> \"Longview\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80455.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kanpur have a population of 2.70132e+06?", "sparql": "ASK { ?e <pred:name> \"Kanpur\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.70132e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 24 million speakers of the Dutch language?", "sparql": "ASK { ?e <pred:name> \"Dutch\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.4e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Vienna have a population of 1.49487e+06?", "sparql": "ASK { ?e <pred:name> \"Vienna\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.49487e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Waco have a population of 124,805?", "sparql": "ASK { ?e <pred:name> \"Waco\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"124805.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Guildford have a population of 146,100?", "sparql": "ASK { ?e <pred:name> \"Guildford\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"146100.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Genesis have an attendance of 1.43e+07?", "sparql": "ASK { ?e <pred:name> \"Genesis\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.43e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does York have a population of 43718?", "sparql": "ASK { ?e <pred:name> \"York\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"43718.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Singapore have a Human Development Index of 0.841?", "sparql": "ASK { ?e <pred:name> \"Singapore\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.841\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Harbin have a population of 10,636,000?", "sparql": "ASK { ?e <pred:name> \"Harbin\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0636e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Monterey have a population of 27810?", "sparql": "ASK { ?e <pred:name> \"Monterey\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"27810.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Gulfport have a population of 67793?", "sparql": "ASK { ?e <pred:name> \"Gulfport\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"67793.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Hubei have a population of 5.816e+07?", "sparql": "ASK { ?e <pred:name> \"Hubei\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.816e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Bhopal have a population of 1.88338e+06?", "sparql": "ASK { ?e <pred:name> \"Bhopal\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.88338e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Montevideo have a population of 1,319,110?", "sparql": "ASK { ?e <pred:name> \"Montevideo\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.31911e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Croatian have 7 million speakers?", "sparql": "ASK { ?e <pred:name> \"Croatian\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Sikkim have a female population of 287,507?", "sparql": "ASK { ?e <pred:name> \"Sikkim\" . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"287507.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Thailand have a Human Development Index of 0.539?", "sparql": "ASK { ?e <pred:name> \"Thailand\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.539\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Seychelles have a Human Development Index of 0.752?", "sparql": "ASK { ?e <pred:name> \"Seychelles\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.752\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Halifax have a population of 390,096?", "sparql": "ASK { ?e <pred:name> \"Halifax\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"390096.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Samoa have a Human Development Index of 0.679?", "sparql": "ASK { ?e <pred:name> \"Samoa\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.679\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ukraine have a Human Development Index of 0.705?", "sparql": "ASK { ?e <pred:name> \"Ukraine\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.705\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kagoshima have a population of 596,319?", "sparql": "ASK { ?e <pred:name> \"Kagoshima\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"596319.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Corvallis have a population of 49322?", "sparql": "ASK { ?e <pred:name> \"Corvallis\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"49322.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Montana have a population of 376,053?", "sparql": "ASK { ?e <pred:name> \"Montana\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"376053.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]