[{"question": "Is the population of Liguria 1.55881e+06 and its Dewey Decimal Classification 2--371?", "sparql": "ASK { ?e <pred:name> \"Liguria\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--371\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.55881e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Malibu have 2.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Malibu\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:value> \"2.0\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Qantas have an Australian Business Number of 16009661901 and 29596 employees?", "sparql": "ASK { ?e <pred:name> \"Qantas\" . ?e <Australian_Business_Number> ?pv_1 . ?pv_1 <pred:value> \"16009661901\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29596.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Mali have a Dewey Decimal Classification of 2--6623 and a Human Development Index of 0.199?", "sparql": "ASK { ?e <pred:name> \"Mali\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6623\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.199\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hattiesburg (with WOEID 2418681) 44779?", "sparql": "ASK { ?e <pred:name> \"Hattiesburg\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2418681\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"44779.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Katowice 303,314 and its Dewey Decimal Classification 2--43858?", "sparql": "ASK { ?e <pred:name> \"Katowice\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43858\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"303314.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bradenton 50672 and does it have a Dewey Decimal Classification of 2--75962?", "sparql": "ASK { ?e <pred:name> \"Bradenton\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--75962\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"50672.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Iran have a Human Development Index of 0.766 and a British Museum person-institution ID of 188625?", "sparql": "ASK { ?e <pred:name> \"Iran\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"188625\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.766\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Chad (the one whose inception date is 1960-08-11) and Chad (the one whose FIPS 10-4 code is CD)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chad\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-08-11\"^^xsd:date . ?e_2 <pred:name> \"Chad\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"CD\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Egypt (the one with an inception date of 1953-06-18) and Egypt (the one with a CIVICUS_Monitor_country_entry value of egypt)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Egypt\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1953-06-18\"^^xsd:date . ?e_2 <pred:name> \"Egypt\" . ?e_2 <CIVICUS_Monitor_country_entry> ?pv_1 . ?pv_1 <pred:value> \"egypt\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Kentucky (the one with a publication date of 1938-01-01) and Kentucky (the one with a FIPS 10-4 code of US21)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kentucky\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1938-01-01\"^^xsd:date . ?e_2 <pred:name> \"Kentucky\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"US21\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Texas (published on 1941-01-01) and Texas (the one with ISNI 0000 0001 0673 2585)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Texas\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1941-01-01\"^^xsd:date . ?e_2 <pred:name> \"Texas\" . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0673 2585\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Nepal (the one with an inception date of 1768-01-01) and Nepal (the one with a CIVICUS_Monitor_country_entry value of nepal)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nepal\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1768-01-01\"^^xsd:date . ?e_2 <pred:name> \"Nepal\" . ?e_2 <CIVICUS_Monitor_country_entry> ?pv_1 . ?pv_1 <pred:value> \"nepal\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Nashville (the one that started on 2012-10-10) and Nashville (the one with Dewey Decimal Classification 2--76855)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nashville\" . ?e_1 <start_time> ?pv . ?pv <pred:date> \"2012-10-10\"^^xsd:date . ?e_2 <pred:name> \"Nashville\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--76855\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Stockport (which was established on 1974-04-01) and Stockport (which has an OS grid reference of SJ895900)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stockport\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Stockport\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SJ895900\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Belgium (the one whose inception date is 1830-10-04) and Belgium (the one whose ISO 3166-1 alpha-2 code is BE)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Belgium\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1830-10-04\"^^xsd:date . ?e_2 <pred:name> \"Belgium\" . ?e_2 <ISO_3166-1_alpha-2_code> ?pv_1 . ?pv_1 <pred:value> \"BE\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Forbes (incepted on 1917-09-15) and Forbes (with ISSN 0015-6914)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Forbes\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1917-09-15\"^^xsd:date . ?e_2 <pred:name> \"Forbes\" . ?e_2 <ISSN> ?pv_1 . ?pv_1 <pred:value> \"0015-6914\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Georgia (the one with an inception date of 1788-01-02) and Georgia (the one with a CIVICUS_Monitor_country_entry value of \"georgia\")?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Georgia\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1788-01-02\"^^xsd:date . ?e_2 <pred:name> \"Georgia\" . ?e_2 <CIVICUS_Monitor_country_entry> ?pv_1 . ?pv_1 <pred:value> \"georgia\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Israel (inception date: 1948-05-14) and Israel (ITU letter code: ISR)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Israel\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1948-05-14\"^^xsd:date . ?e_2 <pred:name> \"Israel\" . ?e_2 <ITU_letter_code> ?pv_1 . ?pv_1 <pred:value> \"ISR\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the dissolved, abolished or demolished Brandenburg (the one dissolved on 1952-07-25) and Brandenburg (the one with Dewey Decimal Classification 2--4315)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Brandenburg\" . ?e_1 <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1952-07-25\"^^xsd:date . ?e_2 <pred:name> \"Brandenburg\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4315\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Alpes-Maritimes (the one with an inception date of 1793-02-04) and Alpes-Maritimes (the one with a Dewey Decimal Classification of 2--4494)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alpes-Maritimes\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1793-02-04\"^^xsd:date . ?e_2 <pred:name> \"Alpes-Maritimes\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4494\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Caravaggio (published on 1987-01-22) and Caravaggio (the one associated with the British Museum person-institution with a value of 21931)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Caravaggio\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1987-01-22\"^^xsd:date . ?e_2 <pred:name> \"Caravaggio\" . ?e_2 <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"21931\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Portugal (the one whose inception date is 1143-10-05) and Portugal (the one with the demonym Portugees)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Portugal\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1143-10-05\"^^xsd:date . ?e_2 <pred:name> \"Portugal\" . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"Portugees\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guildford (the one whose inception date is 1974-04-01) and Guildford (the one whose OS grid reference is SU9949)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guildford\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Guildford\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SU9949\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Djibouti (which was established on 1977-06-23) and Djibouti (which has a Dewey Decimal Classification of 2--6771)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Djibouti\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1977-06-23\"^^xsd:date . ?e_2 <pred:name> \"Djibouti\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6771\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Alaska (the one with a publication date of 1996-01-01) and Alaska (the one with a Dewey Decimal Classification of 2--798)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Alaska\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1996-01-01\"^^xsd:date . ?e_2 <pred:name> \"Alaska\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--798\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Rochdale (the one whose inception date is 1974-04-01) and Rochdale (the one whose OS grid reference is SD893130)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rochdale\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Rochdale\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SD893130\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Wakefield (the one with an inception date of 1974-04-01) and Wakefield (the one with a Dewey Decimal Classification of 2--42815)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Wakefield\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1974-04-01\"^^xsd:date . ?e_2 <pred:name> \"Wakefield\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--42815\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Prussia (the one dissolved, abolished or demolished on 1947-02-25) and Prussia (the one with ISNI 0000 0001 1198 8585)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Prussia\" . ?e_1 <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1947-02-25\"^^xsd:date . ?e_2 <pred:name> \"Prussia\" . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1198 8585\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Paraguay (which was founded on 1811-01-01) and Paraguay (which has a FIPS 10-4 code of PA)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paraguay\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1811-01-01\"^^xsd:date . ?e_2 <pred:name> \"Paraguay\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"PA\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the publication date of Casablanca (which is 1942-11-26) and its Dewey Decimal Classification (which is 2--6438)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Casablanca\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1942-11-26\"^^xsd:date . ?e_2 <pred:name> \"Casablanca\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6438\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ecuador (inception date: 1822-05-24) and Ecuador (GS1 country code: 786)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ecuador\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1822-05-24\"^^xsd:date . ?e_2 <pred:name> \"Ecuador\" . ?e_2 <GS1_country_code> ?pv_1 . ?pv_1 <pred:value> \"786\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Myanmar (inception date: 1948-01-01) and the entity with ISNI 0000 0001 2158 2415?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Myanmar\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1948-01-01\"^^xsd:date . ?e_2 <pred:name> \"Myanmar\" . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2158 2415\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Comoros (the one whose inception date is 1975-07-06) to Comoros (the one whose CIVICUS_Monitor_country_entry is comoros)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Comoros\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1975-07-06\"^^xsd:date . ?e_2 <pred:name> \"Comoros\" . ?e_2 <CIVICUS_Monitor_country_entry> ?pv_1 . ?pv_1 <pred:value> \"comoros\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Sudan (the one whose inception date is 1956-01-01) and Sudan (the one whose FIPS 10-4 code is SU)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sudan\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1956-01-01\"^^xsd:date . ?e_2 <pred:name> \"Sudan\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"SU\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between X-Men (published on 2000-08-31) and X-Men (whose Instagram username is xmenmovies)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"X-Men\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2000-08-31\"^^xsd:date . ?e_2 <pred:name> \"X-Men\" . ?e_2 <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"xmenmovies\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Traffic (which was released in 1967) and the song Traffic?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Traffic\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1967-01-01\"^^xsd:date . ?e_2 <pred:name> \"Traffic\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Traffic\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Haiti (the one whose inception date is 1804-01-01) to Haiti (the one whose FIPS 10-4 code is HA)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Haiti\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1804-01-01\"^^xsd:date . ?e_2 <pred:name> \"Haiti\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"HA\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the book \"Timeline\" (published on 2003-01-01) and the movie \"Timeline\" (whose native label is \"Timeline\")?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Timeline\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2003-01-01\"^^xsd:date . ?e_2 <pred:name> \"Timeline\" . ?e_2 <native_label> ?pv_1 . ?pv_1 <pred:value> \"Timeline\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Luxembourg (which was established on 1815-01-01) and Luxembourg (whose demonym is Lux\u00e4mburg\u00e4nan)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Luxembourg\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1815-01-01\"^^xsd:date . ?e_2 <pred:name> \"Luxembourg\" . ?e_2 <demonym> ?pv_1 . ?pv_1 <pred:value> \"Lux\u00e4mburg\u00e4nan\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the book \"300\" (published on 2007-04-04) and the book \"300\" (with an ISBN-10 of 1-56971-402-9)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"300\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2007-04-04\"^^xsd:date . ?e_2 <pred:name> \"300\" . ?e_2 <ISBN-10> ?pv_1 . ?pv_1 <pred:value> \"1-56971-402-9\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Somalia (the one whose inception date is 1960-01-01) and Somalia (the one whose FIPS 10-4 code is SO)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Somalia\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Somalia\" . ?e_2 <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"SO\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the book/movie Atonement (published on 2007-08-28) and the OCLC control number 248628819?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Atonement\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2007-08-28\"^^xsd:date . ?e_2 <pred:name> \"Atonement\" . ?e_2 <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"248628819\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Rango (published on 2011-03-03) and the Nintendo game with the GameID SRGP69?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rango\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2011-03-03\"^^xsd:date . ?e_2 <pred:name> \"Rango\" . ?e_2 <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"SRGP69\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Bolt (published on 2008-11-18) and the movie Bolt (with the title \"Bolt\")?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bolt\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2008-11-18\"^^xsd:date . ?e_2 <pred:name> \"Bolt\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"Bolt\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Czechoslovakia (which was dissolved on 1992-12-31) and Czechoslovakia (the one with ISNI 0000 0001 2296 6146)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Czechoslovakia\" . ?e_1 <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1992-12-31\"^^xsd:date . ?e_2 <pred:name> \"Czechoslovakia\" . ?e_2 <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2296 6146\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Perth (the one with an inception date of 1829-01-01) and Perth (the one with an OS grid reference of NO115235)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Perth\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1829-01-01\"^^xsd:date . ?e_2 <pred:name> \"Perth\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"NO115235\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Grimsby (published on 2016-02-24) and Grimsby (with an OS grid reference of TA279087)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Grimsby\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2016-02-24\"^^xsd:date . ?e_2 <pred:name> \"Grimsby\" . ?e_2 <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TA279087\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Australia (the one whose inception date is 1901-01-01) and Australia (the one whose GS1 country code is 933)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Australia\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1901-01-01\"^^xsd:date . ?e_2 <pred:name> \"Australia\" . ?e_2 <GS1_country_code> ?pv_1 . ?pv_1 <pred:value> \"933\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Tacoma (published on 2012-07-21) and Tacoma (the one with PermID 5001077871)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tacoma\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2012-07-21\"^^xsd:date . ?e_2 <pred:name> \"Tacoma\" . ?e_2 <PermID> ?pv_1 . ?pv_1 <pred:value> \"5001077871\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the book Beloved (published on 1999-04-15) and the Dewey Decimal Classification 813.54?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Beloved\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1999-04-15\"^^xsd:date . ?e_2 <pred:name> \"Beloved\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"813.54\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Thor (published on 2011-04-27) and the official website http://marvel.com/characters/bio/1009664/thor?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Thor\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"2011-04-27\"^^xsd:date . ?e_2 <pred:name> \"Thor\" . ?e_2 <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://marvel.com/characters/bio/1009664/thor\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Maryland (the one with a publication date of 1940-01-01) and Maryland (the one with a Dewey Decimal Classification of 2--752)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Maryland\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1940-01-01\"^^xsd:date . ?e_2 <pred:name> \"Maryland\" . ?e_2 <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--752\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Superman (the one whose start time is 1988-12-10) and the British Museum person-institution with a value of 169934?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Superman\" . ?e_1 <start_time> ?pv . ?pv <pred:date> \"1988-12-10\"^^xsd:date . ?e_2 <pred:name> \"Superman\" . ?e_2 <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"169934\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the movie Jaws (published on 1975-12-18) and the book Jaws (with an ISBN-10 of 0-330-24382-9)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jaws\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1975-12-18\"^^xsd:date . ?e_2 <pred:name> \"Jaws\" . ?e_2 <ISBN-10> ?pv_1 . ?pv_1 <pred:value> \"0-330-24382-9\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Seal (the one with a publication date of 1991-05-24) and Seal (the one with a Giphy username of \"seal\")?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Seal\" . ?e_1 <publication_date> ?pv . ?pv <pred:date> \"1991-05-24\"^^xsd:date . ?e_2 <pred:name> \"Seal\" . ?e_2 <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"seal\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Kosovo (the one whose inception date is 2008-02-17) and Kosovo (the one whose IOC country code is KOS)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kosovo\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"2008-02-17\"^^xsd:date . ?e_2 <pred:name> \"Kosovo\" . ?e_2 <IOC_country_code> ?pv_1 . ?pv_1 <pred:value> \"KOS\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the Bangor (inception date: 1860-01-17) and the Bangor (GSS code (2011): W04000046)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bangor\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1860-01-17\"^^xsd:date . ?e_2 <pred:name> \"Bangor\" . ?e_2 <GSS_code_(2011)> ?pv_1 . ?pv_1 <pred:value> \"W04000046\" . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]