[
    {
        "question": "Which division has an official name of \"\" and also has an official name of \"Entertainment Analysis & Development\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> division . ?e <official name> ?pv . ?pv <pred:value> \"\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official name> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"\" . ?e <official name> ?pv_1 . ?pv_1 <pred:value> \"Entertainment Analysis & Development\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which medicine has an OSM tag or key of \"Tag:healthcare:speciality=internal\" twice?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> medicine . ?e <OSM tag or key> ?pv . ?pv <pred:value> \"Tag:healthcare:speciality=internal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM tag or key> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"Tag:healthcare:speciality=internal\" . ?e <OSM tag or key> ?pv_1 . ?pv_1 <pred:value> \"Tag:healthcare:speciality=internal\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film has a duration of 98.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <duration> ?pv . ?pv <pred:value> \"98.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"98.0\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Australia?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Australia . ?e_2 <pred:name> Australia . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Tacoma?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Tacoma . ?e_2 <pred:name> Tacoma . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Rocky?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Rocky . ?e_2 <pred:name> Rocky . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Rajasthan?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Rajasthan . ?e_2 <pred:name> Rajasthan . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Samoa?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Samoa . ?e_2 <pred:name> Samoa . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Dallas?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Dallas . ?e_2 <pred:name> Dallas . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Zambia?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Zambia . ?e_2 <pred:name> Zambia . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two instances of Mars?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Mars . ?e_2 <pred:name> Mars . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Malibu?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Malibu . ?e_2 <pred:name> Malibu . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between two entities named Frankenstein?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Frankenstein . ?e_2 <pred:name> Frankenstein . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many religions were founded on January 1st, 1957 and have an OSM tag or key of \"Tag:denomination=united church of christ\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> religion . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date . ?e <OSM tag or key> ?pv_1 . ?pv_1 <pred:value> \"Tag:denomination=united church of christ\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many singles were published on October 26th, 1987 with the first line \"I had this perfect dream - Un sueo me envolvi\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> single . ?e <publication date> ?pv . ?pv <pred:date> \"1987-10-26\"^^xsd:date . ?e <first line> ?pv_1 . ?pv_1 <pred:value> \"I had this perfect dream  Un sueo me envolvi\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many soundtracks with the title \"Iron Man 2\" were published on 2010-04-19?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> soundtrack . ?e <publication date> ?pv . ?pv <pred:date> \"2010-04-19\"^^xsd:date . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many facilities have an inception date of 1937-01-01 and an ISNI of 0000 0001 2165 7333?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> facility . ?e <inception> ?pv . ?pv <pred:date> \"1937-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2165 7333\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many metropolises were founded on 1642-05-17 and have an ISNI of 0000 0001 2150 1478?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <inception> ?pv . ?pv <pred:date> \"1642-05-17\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2150 1478\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many writers were born on 1934-08-18 and have an ISNI of 0000 0001 0873 3741?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> writer . ?e <date of birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many post-hardcore bands were formed in 1987 and have a subreddit named \"Emo\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> post-hardcore . ?e <inception> ?pv . ?pv <pred:date> \"1987-01-01\"^^xsd:date . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many roads have an inception date of 1926-11-11 and a road number of US 66?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> road . ?e <inception> ?pv . ?pv <pred:date> \"1926-11-11\"^^xsd:date . ?e <road number> ?pv_1 . ?pv_1 <pred:value> \"US 66\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many conservatories were founded on September 20th, 1862 and have 75 employees?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <inception> ?pv . ?pv <pred:date> \"1862-09-20\"^^xsd:date . ?e <employees> ?pv_1 . ?pv_1 <pred:value> \"75.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many medals have an inception date of 1862-07-12 and a native label of \"Medal of Honor\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> medal . ?e <inception> ?pv . ?pv <pred:date> \"1862-07-12\"^^xsd:date . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"Medal of Honor\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the website https://web.archive.org/web/20071029004950/http://jeux.mindscape.com:80/Main/Default.aspx, which is different from Mindscape?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"https://web.archive.org/web/20071029004950/http://jeux.mindscape.com:80/Main/Default.aspx\" . ?e_1 <official website> ?pv . ?pv <pred:value> \"https://web.archive.org/web/20071029004950/http://jeux.mindscape.com:80/Main/Default.aspx\" . ?e_2 <pred:name> Mindscape . ?e_1 <different from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different from> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did E92000001 replace England?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"E92000001\" . ?e_1 <GSS code (2011)> ?pv . ?pv <pred:value> \"E92000001\" . ?e_2 <pred:name> England . ?e_1 <replaces> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <replaces> ; <pred:fact_t> ?e_2 ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the CIVICUS Monitor country entry for Kuwait and what is the fact related to it?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"kuwait\" . ?e_1 <CIVICUS Monitor country entry> ?pv . ?pv <pred:value> \"kuwait\" . ?e_2 <pred:name> Kuwait . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the CIVICUS Monitor country entry for Libya and what is the fact related to it?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"libya\" . ?e_1 <CIVICUS Monitor country entry> ?pv . ?pv <pred:value> \"libya\" . ?e_2 <pred:name> Libya . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the source material for the TV show with the official website https://cwtv.com/shows/charmed?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"https://cwtv.com/shows/charmed\" . ?e_1 <official website> ?pv . ?pv <pred:value> \"https://cwtv.com/shows/charmed\" . ?e_2 <pred:name> Charmed . ?e_1 <based on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based on> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the predicate for the fact that 0000 0001 1544 3179 is different from Traffic?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"0000 0001 1544 3179\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0001 1544 3179\" . ?e_2 <pred:name> Traffic . ?e_1 <different from> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <different from> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the narrative location of the title \"Manhattan\" in Manhattan?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Manhattan\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Manhattan\" . ?e_2 <pred:name> Manhattan . ?e_1 <narrative location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative location> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the duration of 123.0 for the work based on Coriolanus whose name is also 123.0?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"123.0\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"123.0\" . ?e_2 <pred:name> Coriolanus . ?e_1 <based on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based on> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the duration of 114.0 for the work based on Thor?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"114.0\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"114.0\" . ?e_2 <pred:name> Thor . ?e_1 <based on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based on> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the main subject of the item named \"143.0\" and whose duration is also \"143.0\", and the main subject is Transformers?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"143.0\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"143.0\" . ?e_2 <pred:name> Transformers . ?e_1 <main subject> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <main subject> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which army has 1.1299e+06 employees?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> army . ?e <employees> ?pv . ?pv <pred:value> \"1.1299e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.1299e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which filmmaking instance has 56 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> filmmaking . ?e <number of episodes> ?pv . ?pv <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of episodes> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"56.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which genre has a book with 218 pages?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <number of pages> ?pv . ?pv <pred:value> \"218.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of pages> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"218.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which award has a Twitter account with the username GolfHallofFame and has 22,884 subscribers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> award . ?e <Twitter username> ?pv . ?pv <pred:value> \"GolfHallofFame\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"22884.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which museum has a Twitter username of TowerOfLondon and has 32081 subscribers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <Twitter username> ?pv . ?pv <pred:value> \"TowerOfLondon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"32081.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which disease has 2e+07 cases?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> disease . ?e <number of cases> ?pv . ?pv <pred:value> \"2e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number of cases> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which drug has a subreddit named \"Marijuana\" with 106576 subscribers?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> drug . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"106576.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which metropolis has a population of 1.49104e+07?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> metropolis . ?e <population> ?pv . ?pv <pred:value> \"1.49104e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.49104e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Rosario have a Dewey Decimal Classification of 2--8224?",
        "sparql": "ASK { ?e <pred:name> Rosario . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--8224\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2--8224\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Showtime have a production code of K1121?",
        "sparql": "ASK { ?e <pred:name> Showtime . ?e <production code> ?pv . ?pv <pred:value> \"K1121\" . [ <pred:fact_h> ?e ; <pred:fact_r> <production code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"K1121\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the movie Hook have a box office value of 3.00855e+08?",
        "sparql": "ASK { ?e <pred:name> Hook . ?e <box office> ?pv . ?pv <pred:value> \"3.00855e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <box office> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"3.00855e+08\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the duration of the entity named Radio equal to 109.0?",
        "sparql": "ASK { ?e <pred:name> Radio . ?e <duration> ?pv . ?pv <pred:value> \"109.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"109.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the ISCO occupation code for a curator 2431?",
        "sparql": "ASK { ?e <pred:name> curator . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2431\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2431\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the ISCO occupation code for barrister equal to 2421?",
        "sparql": "ASK { ?e <pred:name> barrister . ?e <ISCO occupation code> ?pv . ?pv <pred:value> \"2421\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISCO occupation code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2421\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the Baptists who have an OSM tag or key of \"Tag:denomination=baptist\" and an IPTC Newscode of \"mediatopic/20000666\"?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Baptists . ?e <OSM tag or key> ?pv_1 . ?pv_1 <pred:value> \"Tag:denomination=baptist\" . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000666\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]