[{"question": "Which entity has a RIA Novosti reference of 61684885 and is related to marketing?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <RIA_Novosti_reference> ?pv . ?pv <pred:value> \"61684885\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a violin according to the Hornbostel-Sachs classification?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"violin\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322-71\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the research IPTC_Newscode \"mediatopic/20000737\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"research\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which synthesizer has a Hornbostel-Sachs classification of 54?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"synthesizer\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"54\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which process has an IPTC Newscode of mediatopic/20000737?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"process\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which award has an official website of http://www.grammy.com/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.grammy.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which color has an sRGB color hex triplet of FF2400?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"color\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"FF2400\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which event has the official name \"National Basketball Association World Championship Series\" and is a final?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"final\" . ?e <official_name> ?pv . ?pv <pred:value> \"National Basketball Association World Championship Series\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which dog has a catalog code of 111?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <catalog_code> ?pv . ?pv <pred:value> \"111\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which author has an ISNI of 0000 0001 0873 3741?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which subreddit is related to funk and has a value of electro?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"funk\" . ?e <subreddit> ?pv . ?pv <pred:value> \"electro\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which person has the native label \"Speaker of the United States House of Representatives\" and is an instance of \"speaker\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <native_label> ?pv . ?pv <pred:value> \"Speaker of the United States House of Representatives\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which mathematician has an ISCO occupation code of 2122?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematician\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2122\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which initialism has a Dewey Decimal Classification of 306.7663?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.7663\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which family has an official website of http://www.sachsen-coburg-gotha.de/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"family\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sachsen-coburg-gotha.de/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which song has an ISWC of T-010.162.677-0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <ISWC> ?pv . ?pv <pred:value> \"T-010.162.677-0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under \"Protestantism\" according to the Library of Congress Classification system with the code \"BR1644-1644.7\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which technology has a Classification of Instructional Programs code of 11.0103?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"technology\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"11.0103\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which seminary has an ISNI of 0000 0001 2184 9191?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"seminary\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2184 9191\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which museum has an ARCHON code of 2919?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"2919\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which product has an IPTC Newscode of mediatopic/20000245?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"product\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000245\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which medication has a MeSH Code of D27.505.954.427.040?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <MeSH_Code> ?pv . ?pv <pred:value> \"D27.505.954.427.040\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is related to the travel category with an IAB code of 672?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"travel\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"672\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a IIIF manifest of \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" and is related to print?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"print\" . ?e <IIIF_manifest> ?pv . ?pv <pred:value> \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the Stack Exchange tag \"https://stackoverflow.com/tags/project-management\" and has an instance of \"management\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"management\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/project-management\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a stroke with an ICD-10 code of I61?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"stroke\" . ?e <ICD-10> ?pv . ?pv <pred:value> \"I61\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which language has an Ethnologue.com language code of \"sin\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"sin\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which facility has an ARCHON code of 2919?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"2919\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which state has an IPTC Newscode of mediatopic/20000801?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000801\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which object has a Dewey Decimal Classification of 788.65 and is a clarinet?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"clarinet\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"788.65\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which taxon has an EPPO Code of 1CICHF?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <EPPO_Code> ?pv . ?pv <pred:value> \"1CICHF\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which subject has a Dewey Decimal Classification of 590?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"biology\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"590\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which currency has an ISO 4217 code of INR?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <ISO_4217_code> ?pv . ?pv <pred:value> \"INR\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which city/town has a Dewey Decimal Classification of 2--4779?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4779\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the cause of the organization with ISNI 0000 0001 2331 3972's inception on 1916-08-25?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2331 3972\" . ?e <inception> ?pv . ?pv <pred:date> \"1916-08-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <has_cause> ?qpv . ?qpv <pred:value> \"National Park Service Organic Act\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a democracy with a demonym of \"velencei\" and an inception date earlier than 1584 (according to the Gregorian calendar)?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"velencei\" . ?e <inception> ?pv . ?pv <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the activity with the official website https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php# published on 2006-11-30 and available on Xbox 360 platform?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php#\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the anime published in Germany on 2010-09-16 and has a duration of 101.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"101.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-09-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a republic with a demonym of \"velencei\" that has an inception date earlier than 1584?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <demonym> ?pv_1 . ?pv_1 <pred:value> \"velencei\" . ?e <inception> ?pv . ?pv <pred:date> \"0697-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the capital city that has a Dewey Decimal Classification of 2--4786 and has a time of earliest written record of 1067-01-01 (statement with Gregorian date earlier than 1584)?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4786\" . ?e <time_of_earliest_written_record> ?pv . ?pv <pred:date> \"1067-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <time_of_earliest_written_record> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the cause of the inception of the agent with ISNI 0000 0001 2331 3972 on 1916-08-25?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2331 3972\" . ?e <inception> ?pv . ?pv <pred:date> \"1916-08-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <has_cause> ?qpv . ?qpv <pred:value> \"National Park Service Organic Act\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the cause of the inception of the country with the Dewey Decimal Classification of 2--492 on 1954-12-15?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--492\" . ?e <inception> ?pv . ?pv <pred:date> \"1954-12-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <has_cause> ?qpv . ?qpv <pred:value> \"Charter for the Kingdom of the Netherlands\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a miniseries with a duration of 177.0 and a publication date of 1999-05-23, which was published in the United States of America?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"177.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-05-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the film published in Germany on 2001-08-16 and has a duration of 98.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the state with IPTC Newscode mediatopic/20000807 dissolved, abolished, or demolished in the United States of America?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000807\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1865-12-18\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved,_abolished_or_demolished> ; <pred:fact_t> ?pv ] <country> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the currency with the HTML entity \"&euro;\" and an inception date of 1999-01-01 applicable to demand deposits?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <HTML_entity> ?pv_1 . ?pv_1 <pred:value> \"&euro;\" . ?e <inception> ?pv . ?pv <pred:date> \"1999-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv . ?qpv <pred:value> \"demand deposit\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the person with ISNI 0000 0001 0916 8967 die on 2000-01-31 at the age of 73.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0916 8967\" . ?e <date_of_death> ?pv . ?pv <pred:date> \"2000-01-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date_of_death> ; <pred:fact_t> ?pv ] <stated_age_at_event> ?qpv . ?qpv <pred:value> \"73.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city with a FIPS 10-4 code of UKI7 that has an inception date earlier than 1584?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"UKI7\" . ?e <inception> ?pv . ?pv <pred:date> \"0200-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a university with a CANTIC-ID of a11184668 that has an inception date earlier than September 21, 1457?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11184668\" . ?e <inception> ?pv . ?pv <pred:date> \"1457-09-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the entertainment with the official website https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php# published on 2006-11-30 for the Xbox 360 platform?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://web.archive.org/web/20080912170009/http://www2.sega.com/gamesite/sonicnext/sonicnext full/index.php#\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-11-30\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <platform> ?qpv . ?qpv <pred:value> \"Xbox 360\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there an empire that was dissolved, abolished, or demolished on January 1, 1453, and is described as a statement with a Gregorian date earlier than 1584?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:historic:civilization=byzantine\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1453-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <dissolved,_abolished_or_demolished> ; <pred:fact_t> ?pv ] <instance_of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the country with the British Museum person-institution code of 114921 and NUTS code of UKM start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"114921\" . ?e <NUTS_code> ?pv . ?pv <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS_code> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.watchimage.com website regarding the organization with the official website http://www.watchimage.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.watchimage.com\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.watchimage.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the product with Library of Congress Classification TX556.P8 and pronunciation audio Nl-varkensvlees.ogg?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"product\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"TX556.P8\" . ?e <pronunciation_audio> ?pv . ?pv <pred:value> \"Nl-varkensvlees.ogg\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OCLC control number for the single with the OCLC control number 16386945?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"16386945\" . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"16386945\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.speaker.gov website regarding the politician with a native label of \"Speaker of the United States House of Representatives\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.speaker.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://www.warnerbros.com/studio/divisions/television/warner-bros-animation regarding the division?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.warnerbros.com/studio/divisions/television/warner-bros-animation\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.warnerbros.com/studio/divisions/television/warner-bros-animation\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the band with the Twitter username \"theroots\" have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"theroots\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"theroots\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.today.com website regarding the newscast with an Instagram username of todayshow?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.today.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the official website https://www.metmuseum.org/ regarding the facility with an ARCHON code of 1321?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"1321\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.metmuseum.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.sega.com/ironman2/us/index.html website regarding the entertainment with a Nintendo_GameID of S2IP8P?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"S2IP8P\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.sega.com/ironman2/us/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the opera that has the title \"Elektra\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Elektra\" . ?e <title> ?pv . ?pv <pred:value> \"Elektra\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]