[{"question": "Was democracy established on January 7, 1822?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-07\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1822-01-07\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the medal established on July 9, 1918?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-07-09\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1918-07-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the activity end on 2009-08-23?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2009-08-23\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"2009-08-23\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did reggae music start between 1985-01-01 and 1988-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1985-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1988-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the town's inception date 1839-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1839-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1839-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did shoegazing start on January 1, 1996?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"shoegazing\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1996-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1996-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a dynasty that was dissolved, abolished, or demolished on January 1, 1780?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1780-01-01\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1780-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the crime end on November 9, 1799?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1799-11-09\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"1799-11-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did bebop originate on January 1, 1963?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"bebop\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1963-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1963-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Protestantism start on January 1, 1957?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there an anime published on January 1, 2008?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"2008-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a horse with a date of birth of 1970-01-28?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1970-01-28\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1970-01-28\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did metalcore genre originate on January 1, 1986?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metalcore\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1986-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1986-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an entity that is considered \"official\" and has an inception date of July 1, 1867?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an island that was established on January 1, 1898?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a superhero with a date of birth of October 5, 1617?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1617-10-05\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1617-10-05\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the novel published on 1960-07-11?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-07-11\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1960-07-11\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the metropolis established on May 17, 1642?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1642-05-17\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1642-05-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the album published on 1993-07-13?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1993-07-13\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1993-07-13\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the war end on January 1, 1337?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1337-01-01\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"1337-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an author who was born on August 18, 1934?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a republic that was established on January 7, 1822?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-07\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1822-01-07\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a division that was dissolved, abolished, or demolished on September 16, 2015?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2015-09-16\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"2015-09-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a taxon that was born on 1970-01-28 and died on 1999-06-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1970-01-28\"^^xsd:date . ?e <date_of_death> ?pv . ?pv <pred:date> \"1999-06-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a capital city that was established on June 24, 1571?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1571-06-24\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1571-06-24\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the agent's inception date 1946-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1946-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the country's inception date on December 15, 1954?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-12-15\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1954-12-15\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manga that was published on April 1, 1952?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1952-04-01\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1952-04-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the college established on January 1, 1824?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anthology with a publication date of April 11, 1960?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-04-11\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1960-04-11\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the song published on 1995-05-30?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1995-05-30\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1995-05-30\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the miniseries end on December 21, 1986?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1986-12-21\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"1986-12-21\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did marketing have its first flight on April 9, 1967?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <first_flight> ?pv_1 . ?pv_1 <pred:date> \"1967-04-09\"^^xsd:date . ?e <first_flight> ?pv . ?pv <pred:date> \"1967-04-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the front end on 1918-11-11?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"front\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1918-11-11\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"1918-11-11\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the occupation of someone born on 1934-08-18 the same as their date of birth?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the comedy end on May 9, 1992?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1992-05-09\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"1992-05-09\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the neighborhood's inception date on September 28, 1630?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-28\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-28\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a soundtrack that was published on April 19, 2010?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-04-19\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-04-19\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the newspaper's inception date on September 18, 1851?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1851-09-18\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1851-09-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the army dissolved, abolished, or demolished on May 26, 1865?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1865-05-26\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1865-05-26\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the sound have an inception date of 1995-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the trance genre have its inception on January 1, 1995?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the photograph created on August 12, 1958?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"photograph\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1958-08-12\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1958-08-12\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Mormonism start on April 6, 1830?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1830-04-06\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1830-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the cemetery established on January 1, 1825?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1825-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the blues genre start on January 1, 1928?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"blues\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1928-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1928-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the film published on 2001-08-16?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2001-08-16\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the newscast have its first performance on January 14, 1952?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1952-01-14\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Christianity have an inception date of January 1, 1957?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a state that was dissolved, abolished, or demolished on August 24, 1991?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1991-08-24\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1991-08-24\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the opera have its first performance on January 25, 1909?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1909-01-25\"^^xsd:date . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1909-01-25\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a governor whose inception date is 1792-06-04?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1792-06-04\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1792-06-04\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a politician whose inception date is 1789-04-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the print industry established on January 17, 1860?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"print\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1860-01-17\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1860-01-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the painting have an inception date of 1905-01-01 and 1906-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"painting\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1906-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1905-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a genre that was established on January 1, 1876?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1876-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1876-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anarcho-punk instance that has an inception date of 1986-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anarcho-punk\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1986-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1986-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the musical have its first performance on November 16, 1959?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1959-11-16\"^^xsd:date . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1959-11-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a single published on 1998-11-24?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-11-24\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-11-24\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the road end on 1985-06-27?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1985-06-27\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"1985-06-27\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a writer who was born on August 18, 1934?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did rockabilly music genre have an inception date of January 1, 1978?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"rockabilly\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1978-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a monster that was published on 1933-03-02?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"monster\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1933-03-02\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1933-03-02\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the business established on 1887-03-04?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1887-03-04\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1887-03-04\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the school's inception date 1611-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1611-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1611-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the religion's inception on January 1, 1957?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the play have its first performance on November 16, 1959?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1959-11-16\"^^xsd:date . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1959-11-16\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the industry end on 2003-05-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2003-05-01\"^^xsd:date . ?e <end_time> ?pv . ?pv <pred:date> \"2003-05-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the award's inception on January 1, 1983?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1983-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a family that was dissolved, abolished, or demolished on June 12, 1946?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"family\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1946-06-12\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1946-06-12\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the genre \"hardcore\" have an inception date of January 1, 2000?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"hardcore\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2000-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"2000-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the museum officially opened on November 19, 1819?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <date_of_official_opening> ?pv_1 . ?pv_1 <pred:date> \"1819-11-19\"^^xsd:date . ?e <date_of_official_opening> ?pv . ?pv <pred:date> \"1819-11-19\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the post-hardcore genre have an inception date of January 1, 1987?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1987-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1987-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]