[{"question": "How many subscribers does Mattel (whose official website is http://www.mattel.com and Twitter username is Mattel) have?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mattel\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.mattel.com\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Mattel\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in native language of Bangladesh?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bangladesh\" . ?e <name_in_native_language> ?pv_1 . ?pv_1 <pred:value> \"Bangladesh\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Bangladesh\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of the city with the official website http://www.cityofpoughkeepsie.com/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Poughkeepsie\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityofpoughkeepsie.com/\" . ?e <native_label> ?pv . ?pv <pred:value> \"Poughkeepsie\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Burnley (the one with a local dialing code of 01282)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Burnley\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"01282\" . ?e <official_name> ?pv . ?pv <pred:value> \"Burnley\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Twitter account \"Paris\" have, and what is the Dewey Decimal Classification of Paris?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Paris\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--44361\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Paris\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Frankenweenie?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Frankenweenie\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Frankenweenie\" . ?e <title> ?pv . ?pv <pred:value> \"Frankenweenie\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Lantana\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lantana\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Lantana\" . ?e <title> ?pv . ?pv <pred:value> \"Lantana\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the exploitation visa number for the person with the title \"Elizabeth\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Elizabeth\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"95506\" . ?e <title> ?pv . ?pv <pred:value> \"Elizabeth\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Labyrinth?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Labyrinth\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Labyrinth\" . ?e <title> ?pv . ?pv <pred:value> \"Labyrinth\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Mainz and what is its official name?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mainz\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--434351\" . ?e <official_name> ?pv . ?pv <pred:value> \"Mainz\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Darmstadt (the one whose native label is also Darmstadt)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Darmstadt\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--434167\" . ?e <native_label> ?pv . ?pv <pred:value> \"Darmstadt\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Manchester (the one with a local dialing code of 603)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Manchester\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"603\" . ?e <official_name> ?pv . ?pv <pred:value> \"Manchester\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Bird\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bird\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Bird\" . ?e <title> ?pv . ?pv <pred:value> \"Bird\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the exploitation visa number for the movie Moonraker?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Moonraker\" . ?e <exploitation_visa_number> ?pv_1 . ?pv_1 <pred:value> \"49675\" . ?e <title> ?pv . ?pv <pred:value> \"Moonraker\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Shame?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Shame\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Shame\" . ?e <title> ?pv . ?pv <pred:value> \"Shame\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label and official name of Spokane?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Spokane\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Spokane\" . ?e <official_name> ?pv . ?pv <pred:value> \"Spokane\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Dresden and what is its official name?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Dresden\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--432142\" . ?e <official_name> ?pv . ?pv <pred:value> \"Dresden\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit \"Iraq\" related to Iraq (the one whose CIVICUS_Monitor_country_entry is \"iraq\")?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Iraq\" . ?e <CIVICUS_Monitor_country_entry> ?pv_1 . ?pv_1 <pred:value> \"iraq\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Iraq\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Nunavut, which has a Dewey Decimal Classification of 2--7195?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nunavut\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7195\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Nunavut\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did macOS officially start using the name macOS (the one whose official website is https://www.apple.com/tr/macos/)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"macOS\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.apple.com/tr/macos/\" . ?e <official_name> ?pv . ?pv <pred:value> \"macOS\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label for Rhodesia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Rhodesia\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Rhodesia\" . ?e <native_label> ?pv . ?pv <pred:value> \"Rhodesia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Brno (the one with Dewey Decimal Classification 2--43724)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Brno\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43724\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Brno\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Dortmund (the one with the official name Dortmund)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Dortmund\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--435633\" . ?e <official_name> ?pv . ?pv <pred:value> \"Dortmund\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie with the official website http://www.housethemovie.net?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"House\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.housethemovie.net\" . ?e <title> ?pv . ?pv <pred:value> \"House\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Prague, which has a Dewey Decimal Classification of 2--43712?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Prague\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43712\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Prague\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Moonstruck?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Moonstruck\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Moonstruck\" . ?e <title> ?pv . ?pv <pred:value> \"Moonstruck\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Bulworth?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bulworth\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Bulworth\" . ?e <title> ?pv . ?pv <pred:value> \"Bulworth\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Mulan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mulan\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Mulan\" . ?e <title> ?pv . ?pv <pred:value> \"Mulan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for Nicosia's subreddit?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nicosia\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Lefko\u015fa\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Nicosia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Skyfall?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Skyfall\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Skyfall\" . ?e <title> ?pv . ?pv <pred:value> \"Skyfall\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Moscow, which is classified under Dewey Decimal Classification 2--4731?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Moscow\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4731\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Moscow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Mars, which has a Dewey Decimal Classification of 523.44?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mars\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"523.44\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Mars\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label and official name of Montpelier?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Montpelier\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Montpelier\" . ?e <official_name> ?pv . ?pv <pred:value> \"Montpelier\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Ithaca?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ithaca\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Ithaca\" . ?e <title> ?pv . ?pv <pred:value> \"Ithaca\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Melbourne (the one with a local dialing code of 0383)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Melbourne\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"0383\" . ?e <official_name> ?pv . ?pv <pred:value> \"Melbourne\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Helena?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Helena\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Helena\" . ?e <title> ?pv . ?pv <pred:value> \"Helena\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of the city with the official website http://www.cityoflorain.org/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lorain\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityoflorain.org/\" . ?e <native_label> ?pv . ?pv <pred:value> \"Lorain\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language is used in the subreddit for Virginia?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Virginia\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Virginia\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Virginia\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label and short name of Punjab?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Punjab\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"\u0a2a\u0a70\u0a1c\u0a3e\u0a2c\" . ?e <short_name> ?pv . ?pv <pred:value> \"Punjab\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Manitoba (the one with Dewey Decimal Classification 2--7127)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Manitoba\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7127\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Manitoba\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Sunderland whose postal code is SR9?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sunderland\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"SR9\" . ?e <native_label> ?pv . ?pv <pred:value> \"Sunderland\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Chinatown\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Chinatown\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Chinatown\" . ?e <title> ?pv . ?pv <pred:value> \"Chinatown\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Mauritania, which is related to Mauritania (the one with British Museum person-institution ID 185315)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Mauritania\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"185315\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Mauritania\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Forbes (whose official website is http://www.forbes.com/) have on Twitter?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Forbes\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.forbes.com/\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Forbes\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Cremona and what is its native label?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Cremona\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--45271\" . ?e <native_label> ?pv . ?pv <pred:value> \"Cremona\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in native language of the person with ISNI 0000 0003 8487 2342?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Pran\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0003 8487 2342\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Pran\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name and native label of Provo?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Provo\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Provo\" . ?e <native_label> ?pv . ?pv <pred:value> \"Provo\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Earth?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Earth\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Earth\" . ?e <title> ?pv . ?pv <pred:value> \"Earth\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the subreddit for astrology?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"astrology\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"astrology\" . ?e <subreddit> ?pv . ?pv <pred:value> \"astrology\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Quincy?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Quincy\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Quincy\" . ?e <native_label> ?pv . ?pv <pred:value> \"Quincy\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in native language of the person who has the official website http://www.ciaraworld.com?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Ciara\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ciaraworld.com\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Ciara\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Wuppertal and what is its Twitter hashtag?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Wuppertal\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--435532\" . ?e <Twitter_hashtag> ?pv . ?pv <pred:value> \"Wuppertal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_hashtag> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Houston?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Houston\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Houston\" . ?e <title> ?pv . ?pv <pred:value> \"Houston\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Orlando?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Orlando\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Orlando\" . ?e <title> ?pv . ?pv <pred:value> \"Orlando\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie \"Election\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Election\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Election\" . ?e <title> ?pv . ?pv <pred:value> \"Election\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Wimbledon?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Wimbledon\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Wimbledon\" . ?e <title> ?pv . ?pv <pred:value> \"Wimbledon\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Shane\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Shane\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Shane\" . ?e <title> ?pv . ?pv <pred:value> \"Shane\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Milk\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Milk\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Milk\" . ?e <title> ?pv . ?pv <pred:value> \"Milk\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Lancaster (the one with a local dialing code of 01524)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Lancaster\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"01524\" . ?e <official_name> ?pv . ?pv <pred:value> \"Lancaster\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Maidstone?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Maidstone\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Maidstone\" . ?e <title> ?pv . ?pv <pred:value> \"Maidstone\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Suzhou (the one with the official website http://www.suzhou.gov.cn)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Suzhou\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.suzhou.gov.cn\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Suzhou\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]