[
    {
        "question": "Did the award with native label \"The Royal Victorian Chain\" have a quantity of 1 and a value of 84.0?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> award . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"The Royal Victorian Chain\" . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"84.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the stop-motion instance with 56 episodes also the instance with 56 episodes measured in units of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> stop-motion . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which campus was established on January 1st, 1893?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> campus . ?e <inception> ?pv . ?pv <pred:date> \"1893-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What newscast started on November 3rd, 1975?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> newscast . ?e <inception> ?pv . ?pv <pred:date> \"1975-11-03\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which religion was founded on January 1st, 1957?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> religion . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which animal was born on January 28th, 1970?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> animal . ?e <date of birth> ?pv . ?pv <pred:date> \"1970-01-28\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which division was dissolved, abolished or demolished on September 16th, 2015?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> division . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"2015-09-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which miniseries was published on January 1st, 1987?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <publication date> ?pv . ?pv <pred:date> \"1987-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which organization was founded on January 1st, 1851?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <inception> ?pv . ?pv <pred:date> \"1851-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which airline was founded on October 7th, 1919?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> airline . ?e <inception> ?pv . ?pv <pred:date> \"1919-10-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity has an inception date of 1990-01-01 and is an instance of sound?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> sound . ?e <inception> ?pv . ?pv <pred:date> \"1990-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which army was dissolved, abolished or demolished on May 26th, 1865?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> army . ?e <dissolved, abolished or demolished> ?pv . ?pv <pred:date> \"1865-05-26\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the ISNI of Hamas 0000 0001 2172 1841 and was it founded on January 1st, 1987?",
        "sparql": "ASK { ?e <pred:name> Hamas . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1987-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2172 1841\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Hud, which was published on 1963-01-01, have a duration of 112.0?",
        "sparql": "ASK { ?e <pred:name> Hud . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1963-01-01\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"112.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the Rugrats show have a title equal to \"Rugrats\" and a publication date of 2003-01-01?",
        "sparql": "ASK { ?e <pred:name> Rugrats . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2003-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Rugrats\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the song named Angel have an ISWC of T-070.942.427-0 and a publication date of 1998-11-24?",
        "sparql": "ASK { ?e <pred:name> Angel . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1998-11-24\"^^xsd:date . ?e <ISWC> ?pv . ?pv <pred:value> \"T-070.942.427-0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Honduras classified under Dewey Decimal Classification 2--7283 and was it founded on January 1st, 1821?",
        "sparql": "ASK { ?e <pred:name> Honduras . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--7283\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Princeton dissolved, abolished or demolished on January 1st, 2013 and has a Dewey Decimal Classification of 2--74965?",
        "sparql": "ASK { ?e <pred:name> Princeton . ?e <dissolved, abolished or demolished> ?pv_1 . ?pv_1 <pred:date> \"2013-01-01\"^^xsd:date . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--74965\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Yekaterinburg's inception date 1723-01-01 and its area 468.0?",
        "sparql": "ASK { ?e <pred:name> Yekaterinburg . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1723-01-01\"^^xsd:date . ?e <area> ?pv . ?pv <pred:value> \"468.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the official website of Havok http://www.havok.com/ and was it founded on January 1st, 1998?",
        "sparql": "ASK { ?e <pred:name> Havok . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1998-01-01\"^^xsd:date . ?e <official website> ?pv . ?pv <pred:value> \"http://www.havok.com/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Symantec founded on January 1st, 1982 and has an ISIN of US8715031089?",
        "sparql": "ASK { ?e <pred:name> Symantec . ?e <ISIN> ?pv_1 . ?pv_1 <pred:value> \"US8715031089\" . ?e <inception> ?pv . ?pv <pred:date> \"1982-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Botswana, which has a Dewey Decimal Classification of 2--6883, come into existence on January 1st, 1966?",
        "sparql": "ASK { ?e <pred:name> Botswana . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6883\" . ?e <inception> ?pv . ?pv <pred:date> \"1966-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Iceland's Dewey Decimal Classification 2--4912 and was it founded on December 1st, 1918?",
        "sparql": "ASK { ?e <pred:name> Iceland . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4912\" . ?e <inception> ?pv . ?pv <pred:date> \"1918-12-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was BT (the one with ISNI 0000 0001 1848 315X) born on October 4th, 1971?",
        "sparql": "ASK { ?e <pred:name> BT . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1848 315X\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1971-10-04\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Finland have an inception date of 1917-01-01 and a Dewey Decimal Classification of 2--4897?",
        "sparql": "ASK { ?e <pred:name> Finland . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4897\" . ?e <inception> ?pv . ?pv <pred:date> \"1917-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Sneha's ISNI 0000 0001 1919 0877 and date of birth 1981-10-12?",
        "sparql": "ASK { ?e <pred:name> Sneha . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1919 0877\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1981-10-12\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Rihanna's Deutsche Synchronkartei actor-ID 22639 and her date of birth 1988-02-20?",
        "sparql": "ASK { ?e <pred:name> Rihanna . ?e <Deutsche Synchronkartei actor-ID> ?pv_1 . ?pv_1 <pred:value> \"22639\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1988-02-20\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Columbia's area 83.3583 and was it founded on 1967-06-21?",
        "sparql": "ASK { ?e <pred:name> Columbia . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"83.3583\" . ?e <inception> ?pv . ?pv <pred:date> \"1967-06-21\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Rajinikanth's ISNI 0000 0001 1953 0341 and date of birth 1950-12-12?",
        "sparql": "ASK { ?e <pred:name> Rajinikanth . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1953 0341\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1950-12-12\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Kraftwerk, whose ISNI is 0000 0001 1551 0749, start in 1970-01-01?",
        "sparql": "ASK { ?e <pred:name> Kraftwerk . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1551 0749\" . ?e <inception> ?pv . ?pv <pred:date> \"1970-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the duration 1744.0 and the Ramones (the one with Giphy username \"ramones\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"1744.0\" . ?e_1 <duration> ?pv . ?pv <pred:value> \"1744.0\" . ?e_2 <pred:name> Ramones . ?e_2 <Giphy username> ?pv_1 . ?pv_1 <pred:value> \"ramones\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between http://www.sonypictures.com/homevideo/rent/index.html and the movie Rent (which has a duration of 135.0)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"http://www.sonypictures.com/homevideo/rent/index.html\" . ?e_1 <official website> ?pv . ?pv <pred:value> \"http://www.sonypictures.com/homevideo/rent/index.html\" . ?e_2 <pred:name> Rent . ?e_2 <duration> ?pv_1 . ?pv_1 <pred:value> \"135.0\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between CW Dynasty (the one with Twitter username \"cw dynasty\" and a duration of 45.0) and Dynasty?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"cw dynasty\" . ?e_1 <Twitter username> ?pv . ?pv <pred:value> \"cw dynasty\" . ?e_2 <pred:name> Dynasty . ?e_2 <duration> ?pv_1 . ?pv_1 <pred:value> \"45.0\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between 8741.0 (the one with an area of 8741.0) and Corsica (the one with a FIPS 10-4 code of FRA5)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"8741.0\" . ?e_1 <area> ?pv . ?pv <pred:value> \"8741.0\" . ?e_2 <pred:name> Corsica . ?e_2 <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"FRA5\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between E10000008 (the one with GSS code (2011) equal to E10000008) and Devon (the one with FIPS 10-4 (countries and regions) equal to UKD4)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"E10000008\" . ?e_1 <GSS code (2011)> ?pv . ?pv <pred:value> \"E10000008\" . ?e_2 <pred:name> Devon . ?e_2 <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"UKD4\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between GK (the one with FIPS 10-4 value of GK) and Guernsey (the one with an area of 63.4)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"GK\" . ?e_1 <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"GK\" . ?e_2 <pred:name> Guernsey . ?e_2 <area> ?pv_1 . ?pv_1 <pred:value> \"63.4\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the entity with ISNI 0000 0004 0448 1219 and Toledo (the one with Dewey Decimal Classification 2--4643)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"0000 0004 0448 1219\" . ?e_1 <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0448 1219\" . ?e_2 <pred:name> Toledo . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4643\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between NS887801 (the one with an OS grid reference of NS887801) and Falkirk (the one with a FIPS 10-4 code of UKU9)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"NS887801\" . ?e_1 <OS grid reference> ?pv . ?pv <pred:value> \"NS887801\" . ?e_2 <pred:name> Falkirk . ?e_2 <FIPS 10-4 (countries and regions)> ?pv_1 . ?pv_1 <pred:value> \"UKU9\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between 2--6681 (which has a Dewey Decimal Classification of 2--6681) and Togo (which has a Human Development Index of 0.484)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"2--6681\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6681\" . ?e_2 <pred:name> Togo . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.484\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Quito have a population of 2.73599e+06?",
        "sparql": "ASK { ?e <pred:name> Quito . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.73599e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Visalia 124442.0?",
        "sparql": "ASK { ?e <pred:name> Visalia . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"124442.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Alkmaar have 49,778 households?",
        "sparql": "ASK { ?e <pred:name> Alkmaar . ?e <number of households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"49778.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Reading 89893?",
        "sparql": "ASK { ?e <pred:name> Reading . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"89893.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Chandler 236,123?",
        "sparql": "ASK { ?e <pred:name> Chandler . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"236123.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Dover 36,047?",
        "sparql": "ASK { ?e <pred:name> Dover . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"36047.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Thiruvananthapuram have a population of 743691.0?",
        "sparql": "ASK { ?e <pred:name> Thiruvananthapuram . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"743691.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Denmark have a Human Development Index of 0.9?",
        "sparql": "ASK { ?e <pred:name> Denmark . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.9\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Urbana 42014?",
        "sparql": "ASK { ?e <pred:name> Urbana . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"42014.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does KwaZulu-Natal have a population of 1.02673e+07?",
        "sparql": "ASK { ?e <pred:name> KwaZulu-Natal . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.02673e+07\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many filmmaking instances have 56 episodes?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> filmmaking . ?e <number of episodes> ?pv . ?pv <pred:value> \"56.0\" . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"56.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many mathematics-related entities have a Classification of Instructional Programs code of 27.0104 and a Dewey Decimal Classification of 516?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> mathematics . ?e <Classification of Instructional Programs code> ?pv . ?pv <pred:value> \"27.0104\" . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"516\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many superheroes have the name \"Iron Man\" and birth name \"Anthony \"Tony\" Edward Carbonell Stark\"?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> superhero . ?e <name> ?pv . ?pv <pred:value> \"Iron Man\" . ?e <birth name> ?pv_1 . ?pv_1 <pred:value> \"Anthony \"Tony\" Edward Carbonell Stark\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]