[{"question": "What is the title of the play \"The Life of Henry the Fifth\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Life of Henry the Fifth\" . ?e <title> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the PhilPapers topic of the philosophy related to philosophy-of-mind?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <PhilPapers_topic> ?pv_1 . ?pv_1 <pred:value> \"philosophy-of-mind\" . ?e <PhilPapers_topic> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for democracy?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6773\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode for the bobsleigh?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"bobsleigh\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20001055\" . ?e <IPTC_Newscode> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Library of Congress Classification for the law with the HV4708 classification?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"law\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"HV4708\" . ?e <Library_of_Congress_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What subreddit is associated with the disco genre and the italodisco subreddit?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . ?e <subreddit> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OSM tag or key for the medicine with the healthcare speciality of internal?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medicine\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:healthcare:speciality=internal\" . ?e <OSM_tag_or_key> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the DiseasesDB value for the instance of psychosis with DiseasesDB value 11890?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"psychosis\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"11890\" . ?e <DiseasesDB> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISWC of the single with the value T-800.684.109-5?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-800.684.109-5\" . ?e <ISWC> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the postal code of the neighborhood with a postal code of 02119?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"02119\" . ?e <postal_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code of the volleyball that has an IAB code of 548?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"volleyball\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"548\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the country with a Dewey Decimal Classification of 2--9623?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--9623\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code of the sport with an IAB code of 498?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"498\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What subreddit is associated with the genre funk and also associated with the genre electro?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"funk\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"electro\" . ?e <subreddit> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OSM tag or key for the group that has the value \"Tag:generator:source=wind\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:generator:source=wind\" . ?e <OSM_tag_or_key> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of a guitar (the one with a classification of 321.322)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322\" . ?e <Hornbostel-Sachs_classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the college with ISNI 0000 0004 0499 5877?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0499 5877\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the KulturNav-id of the war with the value \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" . ?e <KulturNav-id> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code of a scientist with an ISCO occupation code of 2212?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2212\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of the metropolis with a WOEID of 2211096?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2211096\" . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code of a musician?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musician\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2453\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the sRGB color hex triplet for the orange color (the one with the value FFD700)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"orange\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"FFD700\" . ?e <sRGB_color_hex_triplet> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of a tragedy with a Dewey Decimal Classification of 809.2523?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"tragedy\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the catalog code for the dog with a catalog code of 111?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <catalog_code> ?pv_1 . ?pv_1 <pred:value> \"111\" . ?e <catalog_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the NOC Occupation Code of actors?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"actor\" . ?e <NOC_Occupation_Code> ?pv_1 . ?pv_1 <pred:value> \"5232\" . ?e <NOC_Occupation_Code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the doctrine with a value of 211.7?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"doctrine\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"211.7\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the award that has the website http://www.grammy.com/?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.grammy.com/\" . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the government with ISNI 0000 0001 2230 8442?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"government\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2230 8442\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code of a mathematician?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mathematician\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2122\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the birth name of the superhero with the birth name Armondo Munoz?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Armondo Munoz\" . ?e <birth_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for death that is also associated with the notation 31E21?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"death\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"31E21\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the occupation that has the notation 13H2?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"13H2\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the writer with ISNI 0000 0001 0873 3741?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Library of Congress Classification for Protestantism (the one whose classification is BR1644-1644.7)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the MeSH code for the medication with the code D27.505.954.427.040?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <MeSH_Code> ?pv_1 . ?pv_1 <pred:value> \"D27.505.954.427.040\" . ?e <MeSH_Code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISO 15924 alpha-4 code for the abjad with the value \"Arab\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"abjad\" . ?e <ISO_15924_alpha-4_code> ?pv_1 . ?pv_1 <pred:value> \"Arab\" . ?e <ISO_15924_alpha-4_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Swedish Anbytarforum value for the dynasty with a Swedish Anbytarforum value of 6918.0?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <Swedish_Anbytarforum> ?pv_1 . ?pv_1 <pred:value> \"6918.0\" . ?e <Swedish_Anbytarforum> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode of the concept that belongs to the world region with code r001?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"concept\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"worldregion/r001\" . ?e <IPTC_Newscode> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Hornbostel-Sachs classification of the school with a value of 211.212.1?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"211.212.1\" . ?e <Hornbostel-Sachs_classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the National Heritage List for England number of the crematory with a value of 1001575?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crematory\" . ?e <National_Heritage_List_for_England_number> ?pv_1 . ?pv_1 <pred:value> \"1001575\" . ?e <National_Heritage_List_for_England_number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for a designer with the ISCO occupation code 2141?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"designer\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2141\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the association with ISNI 0000 0004 1936 7478?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1936 7478\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the manga with the website http://tezukaosamu.net?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of the village with a value of 2369745?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2369745\" . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for the property with Iconclass notation 31E21?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"property\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"31E21\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ARCHON code for the facility with an ARCHON code of 2919?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"2919\" . ?e <ARCHON_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IIIF manifest for the print with the value \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"print\" . ?e <IIIF_manifest> ?pv_1 . ?pv_1 <pred:value> \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" . ?e <IIIF_manifest> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ICD-10 code for pain?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pain\" . ?e <ICD-10> ?pv_1 . ?pv_1 <pred:value> \"R10\" . ?e <ICD-10> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the art that has a value of 820?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"820\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISCO occupation code for a screenwriter with the value of 2451?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"screenwriter\" . ?e <ISCO_occupation_code> ?pv_1 . ?pv_1 <pred:value> \"2451\" . ?e <ISCO_occupation_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the musical Sweeney Todd?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Sweeney Todd\" . ?e <title> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for the clarinet?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"clarinet\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"788.65\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the short name for a physician with the value \"M.D.\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"physician\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"M.D.\" . ?e <short_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which drug is associated with the subreddit \"Marijuana\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Marijuana\" . ?e <subreddit> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the conservatory with ISNI 0000 0001 2325 014X?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2325 014X\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the RIA Novosti reference for suicide with the reference number 55428295?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"suicide\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"55428295\" . ?e <RIA_Novosti_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username of the business with the Twitter username \"WilliamsRacing\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"WilliamsRacing\" . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Islam?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"297.82\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IATA airline designator for the airline with the name \"U2\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <IATA_airline_designator> ?pv_1 . ?pv_1 <pred:value> \"U2\" . ?e <IATA_airline_designator> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ROME Occupation Code (v3) of the impresario with the ROME Occupation Code (v3) L1303?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"impresario\" . ?e <ROME_Occupation_Code_(v3)> ?pv_1 . ?pv_1 <pred:value> \"L1303\" . ?e <ROME_Occupation_Code_(v3)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ARCHON code of the museum with an ARCHON code of 2919?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"2919\" . ?e <ARCHON_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the palace with ISNI 0000 0001 2149 5119?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"palace\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2149 5119\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name in kana of the army with the name \"\u3060\u3044\u306b\u3063\u307d\u3093\u3066\u3044\u3053\u304f\u308a\u304f\u3050\u3093\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <name_in_kana> ?pv_1 . ?pv_1 <pred:value> \"\u3060\u3044\u306b\u3063\u307d\u3093\u3066\u3044\u3053\u304f\u308a\u304f\u3050\u3093\" . ?e <name_in_kana> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for the music category?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"344\" . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Library of Congress Classification for the religion with the code BR1644-1644.7?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for a spirit that has the Iconclass notation 13A1?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"spirit\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"13A1\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Iconclass notation for mythology that has a value of 95?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"95\" . ?e <Iconclass_notation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Glottolog code for the Chinese language (the one with the code yuec1235)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Chinese\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"yuec1235\" . ?e <Glottolog_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the drama category?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drama\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"809.2523\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode of the agent with the mediatopic/20000536 IPTC Newscode?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000536\" . ?e <IPTC_Newscode> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of a pome with a value of 634.11?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pome\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"634.11\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What subreddit is associated with the post-hardcore genre and also associated with Emo?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" . ?e <subreddit> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of the division with the name \"\u60c5\u5831\u958b\u767a\u672c\u90e8\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" . ?e <official_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]