[{"question": "Is the FIPS 10-4 code for Gujarat IN09 and the female population 2.89484e+07?", "sparql": "ASK { ?e <pred:name> \"Gujarat\" . ?e <female_population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.89484e+07\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"IN09\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Frederick 66382 and the area 60.091?", "sparql": "ASK { ?e <pred:name> \"Frederick\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"66382.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"60.091\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Neuilly-sur-Seine 60910?", "sparql": "ASK { ?e <pred:name> \"Neuilly-sur-Seine\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"60910.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"60910.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Calvados have an annual number of weddings equal to 2686.0 and a SIREN number of 221401185?", "sparql": "ASK { ?e <pred:name> \"Calvados\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2686.0\"^^xsd:double . ?e <SIREN_number> ?pv . ?pv <pred:value> \"221401185\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Mashhad's population 1.55916e+06 and its Dewey Decimal Classification 2--5592?", "sparql": "ASK { ?e <pred:name> \"Mashhad\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.55916e+06\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5592\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Miami 346,681 and does it have a Dewey Decimal Classification of 2--759381?", "sparql": "ASK { ?e <pred:name> \"Miami\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"346681.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--759381\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Telugu have a number of speakers equal to 5e+07 and an Ethnologue.com language code of tel?", "sparql": "ASK { ?e <pred:name> \"Telugu\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5e+07\"^^xsd:double . ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"tel\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Uxbridge 13457 and the area 30.4?", "sparql": "ASK { ?e <pred:name> \"Uxbridge\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13457.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"30.4\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Jersey 87186.0 and its FIPS 10-4 code JE?", "sparql": "ASK { ?e <pred:name> \"Jersey\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"87186.0\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"JE\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the atomic number of selenium 34.0 and its CAS Registry Number 7782-49-2?", "sparql": "ASK { ?e <pred:name> \"selenium\" . ?e <atomic_number> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"34.0\"^^xsd:double . ?e <CAS_Registry_Number> ?pv . ?pv <pred:value> \"7782-49-2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ames have a population of 58965.0 and a local dialing code of 515?", "sparql": "ASK { ?e <pred:name> \"Ames\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"58965.0\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"515\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Guadalajara 83039.0 and does it have a Dewey Decimal Classification of 2--4649?", "sparql": "ASK { ?e <pred:name> \"Guadalajara\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"83039.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4649\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Botswana have a Human Development Index of 0.518 and a Dewey Decimal Classification of 2--6883?", "sparql": "ASK { ?e <pred:name> \"Botswana\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.518\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6883\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Champagne-Ardenne equal to 1.33901e+06 and does it have an ISO 3166-2 code of FR-G?", "sparql": "ASK { ?e <pred:name> \"Champagne-Ardenne\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.33901e+06\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"FR-G\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does IBM have 377,757 employees and a British Museum person-institution value of 53,920?", "sparql": "ASK { ?e <pred:name> \"IBM\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"377757.0\"^^xsd:double . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"53920\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Djibouti 562,000 and does it have a Dewey Decimal Classification of 2--6771?", "sparql": "ASK { ?e <pred:name> \"Djibouti\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"562000.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6771\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Barnsley 96082.0 and does it have a TOID of 4000000074572881?", "sparql": "ASK { ?e <pred:name> \"Barnsley\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"96082.0\"^^xsd:double . ?e <TOID> ?pv . ?pv <pred:value> \"4000000074572881\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Richmond 198,309 and the area 129,270,000?", "sparql": "ASK { ?e <pred:name> \"Richmond\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"198309.0\"^^xsd:double . ?e <area> ?pv . ?pv <pred:value> \"1.2927e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Gatineau 265349.0 and its Statistics Canada Geographic code 2481017?", "sparql": "ASK { ?e <pred:name> \"Gatineau\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"265349.0\"^^xsd:double . ?e <Statistics_Canada_Geographic_code> ?pv . ?pv <pred:value> \"2481017\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Afghanistan have a Human Development Index of 0.295 and a Dewey Decimal Classification of 2--581?", "sparql": "ASK { ?e <pred:name> \"Afghanistan\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.295\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--581\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the anime My-HiME have 26 episodes and each episode has a duration of 25 minutes?", "sparql": "ASK { ?e <pred:name> \"My-HiME\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"26.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"25.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Stockport 288,700 and its FIPS 10-4 code UKN2?", "sparql": "ASK { ?e <pred:name> \"Stockport\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"288700.0\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"UKN2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Stratford-upon-Avon 27445.0 and does it have a TOID of 7000000000009986?", "sparql": "ASK { ?e <pred:name> \"Stratford-upon-Avon\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"27445.0\"^^xsd:double . ?e <TOID> ?pv . ?pv <pred:value> \"7000000000009986\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Pashto have an ISO 639-3 code of \"pus\" and a number of speakers equal to 5e+07?", "sparql": "ASK { ?e <pred:name> \"Pashto\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5e+07\"^^xsd:double . ?e <ISO_639-3_code> ?pv . ?pv <pred:value> \"pus\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Barbados have a Human Development Index of 0.785 and a Dewey Decimal Classification of 2--72981?", "sparql": "ASK { ?e <pred:name> \"Barbados\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.785\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--72981\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Czech the language with ISO 639-2 code \"ces\" and has a number of speakers equal to 1.15e+07?", "sparql": "ASK { ?e <pred:name> \"Czech\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.15e+07\"^^xsd:double . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"ces\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many businesses have the OSM tag or key \"Tag:shop=deli\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:shop=deli\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many methods have an Iconclass notation of 48C2?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"method\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"48C2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many taxons have a USDA NDB number of 11095?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <USDA_NDB_number> ?pv . ?pv <pred:value> \"11095\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances of Islam have a Dewey Decimal Classification of 297.82?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Islam\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"297.82\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many rivers have a watershed area of 7.05e+06?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"river\" . ?e <watershed_area> ?pv . ?pv <pred:value> \"7.05e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many associations have an ISNI of 0000 0001 2248 8383?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2248 8383\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many horses have a native label of \"Northern Dancer\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many sounds have the subreddit \"tech house\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <subreddit> ?pv . ?pv <pred:value> \"tech house\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many scientists have a Portuguese Job Code CPP-2010 of 2111.2?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"scientist\" . ?e <Portuguese_Job_Code_CPP-2010> ?pv . ?pv <pred:value> \"2111.2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many mythologies have an Iconclass notation of 95?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"mythology\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many software have a bug tracking system with the value \"https://github.com/brave/browser-ios\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <bug_tracking_system> ?pv . ?pv <pred:value> \"https://github.com/brave/browser-ios\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many diseases have an ICD-10-CM code of C62?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <ICD-10-CM> ?pv . ?pv <pred:value> \"C62\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances of Mormonism are grouped under the Church of Jesus Christ of Latter-day Saints in OpenCorporates?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <OpenCorporates_corporate_grouping> ?pv . ?pv <pred:value> \"Church+of+Jesus+Christ+of+Latter-day+Saints\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many organizations have the OSM tag or key \"Tag:shop=deli\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:shop=deli\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many agents have the OSM tag or key \"Tag:shop=deli\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:shop=deli\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many entities have the official name \"Premier ministre\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <official_name> ?pv . ?pv <pred:value> \"Premier ministre\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many awards have the official website http://www.grammy.com?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.grammy.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many clarinets have a Hornbostel-Sachs classification of 422.211.2-71?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"clarinet\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"422.211.2-71\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many writers have the ROME Occupation Code (v3) of E1102?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"E1102\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many phenomena have an IPTC Newscode of mediatopic/20000441?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000441\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many roads have a length of 2451.0?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <length> ?pv . ?pv <pred:value> \"2451.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances have the Glottolog code \"fili1244\" and the name \"Tagalog\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"fili1244\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many seminaries have an ISNI of 0000 0001 2166 0831?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"seminary\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2166 0831\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many post-hardcore instances have a subreddit value of \"Emo\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Emo\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many speakers does Serbo-Croatian have?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <number_of_speakers> ?pv . ?pv <pred:value> \"7e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many speakers have the official website http://www.speaker.gov/?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.speaker.gov/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many plays have an official website of http://aladdinthemusical.com?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://aladdinthemusical.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many screenwriters have the ROME Occupation Code (v3) of E1102?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"screenwriter\" . ?e <ROME_Occupation_Code_(v3)> ?pv . ?pv <pred:value> \"E1102\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many properties have an Iconclass notation of 31E21?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"property\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"31E21\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many religions have a Universal Decimal Classification of 141.45?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <Universal_Decimal_Classification> ?pv . ?pv <pred:value> \"141.45\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many entities have the Glottolog code indo1316 and are classified as Malay?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"indo1316\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many languages have an IETF language tag of \"si\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <IETF_language_tag> ?pv . ?pv <pred:value> \"si\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many dynasties have a native label of Plantagen\u00eat?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <native_label> ?pv . ?pv <pred:value> \"Plantagen\u00eat\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many researchers have a Portuguese Job Code CPP-2010 of 2111.2?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"researcher\" . ?e <Portuguese_Job_Code_CPP-2010> ?pv . ?pv <pred:value> \"2111.2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many colors have an Iconclass notation of 22C4(BLUE)?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"color\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"22C4(BLUE)\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances of Calvinism have the OSM tag or key \"Tag:denomination=presbyterian\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Calvinism\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:denomination=presbyterian\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many abjads have an ISO 15924 alpha-4 code of Arab?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"abjad\" . ?e <ISO_15924_alpha-4_code> ?pv . ?pv <pred:value> \"Arab\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many anthologies have 218.0 pages?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <number_of_pages> ?pv . ?pv <pred:value> \"218.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many tragedies have a Dewey Decimal Classification of 809.2523?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"tragedy\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"809.2523\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances of Christianity have an ISNI of 0000 0004 0508 6616?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0508 6616\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many empires have the demonym otom\u00e0?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <demonym> ?pv . ?pv <pred:value> \"otom\u00e0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many entities have the sRGB color hex triplet C41E3A and are classified as \"red\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"red\" . ?e <sRGB_color_hex_triplet> ?pv . ?pv <pred:value> \"C41E3A\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many pianos have a width of 102.0?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"piano\" . ?e <width> ?pv . ?pv <pred:value> \"102.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many countries have an inflation rate of -0.1?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <inflation_rate> ?pv . ?pv <pred:value> \"-0.1\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many research instances have an IPTC_Newscode of mediatopic/20000737?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"research\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000737\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many finals have the official name \"Basketball Association of America World Championship Series\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"final\" . ?e <official_name> ?pv . ?pv <pred:value> \"Basketball Association of America World Championship Series\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many philosophies have a subreddit value of \"Conservative\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Conservative\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many democracies have the demonym \u0633\u0644\u0648\u0641\u0627\u0643\u064a\u0648\u0646?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <demonym> ?pv . ?pv <pred:value> \"\u0633\u0644\u0648\u0641\u0627\u0643\u064a\u0648\u0646\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]