[{"question": "Who is a cast member of Merlin (the one with 2.0 episodes)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Merlin\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Nassau (the one with a population of 248,948)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nassau\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"248948.0\"^^xsd:double . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Wheeling (the one with a population of 27375.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wheeling\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"27375.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Split (the one with a population of 178102.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Split\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"178102.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Zambia (the one with a Human Development Index of 0.403)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Zambia\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.403\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What country is Wakefield located in and has a population of 333,800?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wakefield\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"333800.0\"^^xsd:double . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username of the TV show Dynasty (which has 22.0 episodes)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dynasty\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"22.0\"^^xsd:double . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What genre does Pasadena (the one with 13.0 episodes) belong to?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Pasadena\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13.0\"^^xsd:double . ?e <genre> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "In which administrative territorial entity is Akron located with a population of 199110.0?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Akron\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"199110.0\"^^xsd:double . ?e <located_in_the_administrative_territorial_entity> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Binghamton (the one with a population of 47376.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Binghamton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"47376.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the employer of Shakira and how many children does she have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Shakira\" . ?e <number_of_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double . ?e <employer> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Mysore and its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mysore\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"887446.0\"^^xsd:double . ?e <official_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Midland (the one with a population of 41863.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Midland\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"41863.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CAS Registry Number of manganese (the one with an atomic number of 25.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"manganese\" . ?e <atomic_number> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"25.0\"^^xsd:double . ?e <CAS_Registry_Number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Cambodia (the one with a Human Development Index of 0.55)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cambodia\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.55\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Dublin (the one with a population of 553165.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dublin\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"553165.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Wikimedia language code for Afrikaans (the one with 7.2e+06 speakers)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Afrikaans\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"7.2e+06\"^^xsd:double . ?e <Wikimedia_language_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Aruba (the one with a population of 62204.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aruba\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"62204.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the INSEE municipality code for Neuilly-sur-Seine (the one with a population of 60910.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Neuilly-sur-Seine\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"60910.0\"^^xsd:double . ?e <INSEE_municipality_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Alice receive and how many episodes does it have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Alice\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"202.0\"^^xsd:double . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Dortmund (the one with a population of 580444.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dortmund\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"580444.0\"^^xsd:double . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Queensland (the one with a population of 4.7085e+06)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Queensland\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.7085e+06\"^^xsd:double . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the detail map for Friesland (the one with a population of 646317.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Friesland\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"646317.0\"^^xsd:double . ?e <detail_map> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the GSS code (2011) for Manchester (the one with a population of 530300.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Manchester\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"530300.0\"^^xsd:double . ?e <GSS_code_(2011)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who founded Fredericton and has a population of 56224.0?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fredericton\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56224.0\"^^xsd:double . ?e <founded_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the China administrative division code for Hangzhou (the one with a population of 9.468e+06)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hangzhou\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9.468e+06\"^^xsd:double . ?e <China_administrative_division_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the TV show Collateral (the one with 4.0 episodes)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Collateral\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.0\"^^xsd:double . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Brunei (the one with a Human Development Index of 0.819)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brunei\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.819\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Bilbao (the one with a population of 345821.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bilbao\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"345821.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for Versailles (the one with 30.0 episodes)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Versailles\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"30.0\"^^xsd:double . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What industry does THQ belong to and how many employees does it have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"THQ\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1300.0\"^^xsd:double . ?e <industry> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Augusta (the one with a population of 19136.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Augusta\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"19136.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Venice (the one with a population of 40885.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Venice\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"40885.0\"^^xsd:double . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of Natchez and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Natchez\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"15792.0\"^^xsd:double . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Tehran (the one with a population of 7.71123e+06)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tehran\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"7.71123e+06\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CBS municipality code for Arnhem (the one with 75413.0 households)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Arnhem\" . ?e <number_of_households> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"75413.0\"^^xsd:double . ?e <CBS_municipality_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the PermID of Newark (the one with a population of 405220.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Newark\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"405220.0\"^^xsd:double . ?e <PermID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Stamford founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Stamford\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"128278.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What country is Moscow located in and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Moscow\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"23800.0\"^^xsd:double . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Harare founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Harare\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.606e+06\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Stavanger (the one with a population of 130426.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Stavanger\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"130426.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Earth (the one with a flattening of 0.0033528)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Earth\" . ?e <flattening> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.0033528\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Canberra (the one with a population of 357222.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Canberra\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"357222.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Huntington (the one with a population of 48113.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Huntington\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"48113.0\"^^xsd:double . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Irving?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Irving\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"216290.0\"^^xsd:double . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Trier (the one with a population of 114914.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Trier\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"114914.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Waterbury founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Waterbury\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"110366.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Gulfport founded and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gulfport\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"67793.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which country has a language with 1.3e+08 Japanese speakers?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Japanese\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.3e+08\"^^xsd:double . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Aude (the one with an annual number of weddings of 1292.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aude\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1292.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the NIS/INS code for Bruges (the one with an annual number of weddings of 455.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bruges\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"455.0\"^^xsd:double . ?e <NIS/INS_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the Kuomintang party and how many members does it have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kuomintang\" . ?e <member_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.09e+06\"^^xsd:double . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for the TV show Girls (which has 62.0 episodes)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Girls\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"62.0\"^^xsd:double . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Pueblo?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Pueblo\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"106595.0\"^^xsd:double . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Ulm (the one with a population of 99936.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ulm\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"99936.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Montgomery (the one with a population of 205,764)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Montgomery\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"205764.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Montana (the one with a population of 376053.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Montana\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"376053.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What country is Hove located in and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hove\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"91900.0\"^^xsd:double . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Marrakesh?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Marrakesh\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"928850.0\"^^xsd:double . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Naples (the one with a population of 19539.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Naples\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"19539.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the NIS/INS code for Limburg (the one with an annual number of weddings of 3568.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Limburg\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3568.0\"^^xsd:double . ?e <NIS/INS_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPv6 routing prefix for Vodafone (the one with 107667.0 employees)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vodafone\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107667.0\"^^xsd:double . ?e <IPv6_routing_prefix> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Martinique (the one with an annual number of weddings equal to 1017.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Martinique\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1017.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of Dorchester?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dorchester\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"91982.0\"^^xsd:double . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Paraguay (the one with a Human Development Index of 0.551)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Paraguay\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.551\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Instagram username of the TV show Glee, which has 121 episodes?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Glee\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"121.0\"^^xsd:double . ?e <Instagram_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "In which administrative territorial entity is Monterey located and what is its population?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Monterey\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"27810.0\"^^xsd:double . ?e <located_in_the_administrative_territorial_entity> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the local dialing code for Greenock (the one with a population of 45467.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Greenock\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"45467.0\"^^xsd:double . ?e <local_dialing_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was Gameloft founded and how many employees does it have?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Gameloft\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6200.0\"^^xsd:double . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Turkmenistan (the one with a Human Development Index of 0.666)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Turkmenistan\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.666\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Caen (the one with a population of 30923.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Caen\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"30923.0\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Statistics Canada Geographic code for Halifax (the one with a population of 390096.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Halifax\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"390096.0\"^^xsd:double . ?e <Statistics_Canada_Geographic_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]