[{"question": "Is there a town with a population of 160,000 and an OS grid reference of TQ315065?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"160000.0\"^^xsd:double . ?e <OS_grid_reference> ?pv . ?pv <pred:value> \"TQ315065\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OS_grid_reference> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"TQ315065\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the number of deaths in the crime category equal to 6 million?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6e+06\"^^xsd:double . ?e <number_of_deaths> ?pv . ?pv <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_deaths> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the anime have 13 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"13.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"13.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"13.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an island with a population of 1.1158e+06 and a demonym of South Islander?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1158e+06\"^^xsd:double . ?e <demonym> ?pv . ?pv <pred:value> \"South Islander\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"South Islander\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a nationality with a population of 6 million?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"nationality\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a metropolis with a population of 1.64952e+06 and a Dewey Decimal Classification of 2--71428?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.64952e+06\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--71428\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2--71428\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Bronxville (the one whose name in native language is Bronxville) 6323.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Bronxville\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Bronxville\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city/town with a population of 758,400 and a local dialing code of 322?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"758400.0\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"322\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local_dialing_code> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"322\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the war with a number of deaths equal to 1.7e+07 have a number of deaths equal to 1.7e+07?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.7e+07\"^^xsd:double . ?e <number_of_deaths> ?pv . ?pv <pred:value> \"1.7e+07\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_deaths> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.7e+07\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the language with Ethnologue.com language code \"sin\" have 1.6e+07 speakers?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.6e+07\"^^xsd:double . ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"sin\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Ethnologue.com_language_code> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"sin\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the capital city with 4787 employees and a Twitter username of PrahaEU have 7776 subscribers?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4787.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"PrahaEU\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv . ?qpv <pred:value> \"7776.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the agent with ISNI 0000 0001 2172 7549 have 80.0 seats?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <number_of_seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2172 7549\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2172 7549\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a country in Scotland with a population of 5.3136e+06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.3136e+06\"^^xsd:double . ?e <TOID> ?pv . ?pv <pred:value> \"country/scotland\" . [ <pred:fact_h> ?e ; <pred:fact_r> <TOID> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"country/scotland\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a stop-motion show with 56 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"stop-motion\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"56.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"56.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a college located at 1900 Pico Blvd, Santa Monica, CA, 90405-1628 with 2023 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2023.0\"^^xsd:double . ?e <located_at_street_address_(DEPRECATED)> ?pv . ?pv <pred:value> \"1900 Pico Blvd, Santa Monica, CA, 90405-1628\" . [ <pred:fact_h> ?e ; <pred:fact_r> <located_at_street_address_(DEPRECATED)> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1900 Pico Blvd, Santa Monica, CA, 90405-1628\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anthology with a number of pages equal to 218.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <number_of_pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <number_of_pages> ?pv . ?pv <pred:value> \"218.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_pages> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"218.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a song named \"BEAUTY AND THE BEAST\" with an ISWC of T-070.017.986-7 and a beats per minute of 90.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <beats_per_minute> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"90.0\"^^xsd:double . ?e <ISWC> ?pv . ?pv <pred:value> \"T-070.017.986-7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv ] <named_as> ?qpv . ?qpv <pred:value> \"BEAUTY AND THE BEAST\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a miniseries with 6 episodes, each lasting 6.0 units?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"6.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"6.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the comedy have 25.0 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"25.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"25.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"25.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a neighborhood with a population of 68469 and an elevation above sea level of 242?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"68469.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"242.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation_above_sea_level> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"242.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a newspaper with an Alexa rank of 112.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . ?e <Alexa_rank> ?pv . ?pv <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"112.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the number of employees in the army equal to 960000.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1299e+06\"^^xsd:double . ?e <employees> ?pv . ?pv <pred:value> \"960000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"960000.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the number of graves in Cimeti\u00e8re de Montmartre equal to 20000?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <number_of_graves> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20000.0\"^^xsd:double . ?e <native_label> ?pv . ?pv <pred:value> \"Cimeti\u00e8re de Montmartre\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Cimeti\u00e8re de Montmartre\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the cost of the film equal to 1.5e+08 and the box office equal to 8.96911e+08?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <box_office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e <cost> ?pv . ?pv <pred:value> \"1.5e+08\" . [ <pred:fact_h> ?e ; <pred:fact_r> <cost> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1.5e+08\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the newscast with the Twitter username TODAYshow, which has 66.0 seasons, still ongoing?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"66.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"TODAYshow\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a state with a Human Development Index of 0.649 and a Dewey Decimal Classification of 2--476?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.649\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--476\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2--476\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a genre with a number of pages equal to 218.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <number_of_pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <number_of_pages> ?pv . ?pv <pred:value> \"218.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_pages> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"218.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a single with a beats per minute of 72.0 and a duration of 279.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <beats_per_minute> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"72.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"279.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"279.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the business with 500 employees have a total of 500 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"500.0\"^^xsd:double . ?e <employees> ?pv . ?pv <pred:value> \"500.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"500.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a religion with a population of 3.35271e+06 and an IPTC Newscode of mediatopic/20000678?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.35271e+06\"^^xsd:double . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000678\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC_Newscode> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"mediatopic/20000678\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an industry with 1447 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1447.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"1447.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1447.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the award with an Alexa rank of 126668.0 and an official website of http://www.emmys.com/ the same as the one with a fact_t value of http://www.emmys.com/?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"126668.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.emmys.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.emmys.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a disease with a number of deaths equal to 143,000 and a DiseasesDB ID of 29089?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"143000.0\"^^xsd:double . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"29089\" . [ <pred:fact_h> ?e ; <pred:fact_r> <DiseasesDB> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"29089\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a medication with an atomic number of 26.0 and a CAS Registry Number of 7439-89-6?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <atomic_number> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"26.0\"^^xsd:double . ?e <CAS_Registry_Number> ?pv . ?pv <pred:value> \"7439-89-6\" . [ <pred:fact_h> ?e ; <pred:fact_r> <CAS_Registry_Number> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"7439-89-6\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Eastman School of Music a conservatory with 900 students?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"900.0\"^^xsd:double . ?e <native_label> ?pv . ?pv <pred:value> \"Eastman School of Music\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Eastman School of Music\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Serbo-Croatian spoken by 1.2e+07 people and has an IAB code of 1180?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.2e+07\"^^xsd:double . ?e <IAB_code> ?pv . ?pv <pred:value> \"1180\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1180\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the news show with the Twitter username TODAYshow, which has 66.0 seasons, also called TODAYshow?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"66.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"TODAYshow\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city with a population of 163,000 and an elevation above sea level of 50.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"163000.0\"^^xsd:double . ?e <elevation_above_sea_level> ?pv . ?pv <pred:value> \"50.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation_above_sea_level> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"50.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Google a software with an Alexa rank of 1.0 and a Twitter hashtag of Google?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . ?e <Twitter_hashtag> ?pv . ?pv <pred:value> \"Google\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_hashtag> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Google\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a university located at 1111 Eighth Street, San Francisco, CA, 94107-2247 with 500 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"500.0\"^^xsd:double . ?e <located_at_street_address> ?pv . ?pv <pred:value> \"1111 Eighth Street, San Francisco, CA, 94107-2247\" . [ <pred:fact_h> ?e ; <pred:fact_r> <located_at_street_address> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1111 Eighth Street, San Francisco, CA, 94107-2247\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a landform with a population of 1.1158e+06 and a demonym of South Islander?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1158e+06\"^^xsd:double . ?e <demonym> ?pv . ?pv <pred:value> \"South Islander\" . [ <pred:fact_h> ?e ; <pred:fact_r> <demonym> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"South Islander\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Malay the language with Ethnologue.com language code \"ind\" and has 4.3e+07 speakers?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.3e+07\"^^xsd:double . ?e <Ethnologue.com_language_code> ?pv . ?pv <pred:value> \"ind\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Ethnologue.com_language_code> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"ind\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a foundation with an Alexa rank of 29145.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29145.0\"^^xsd:double . ?e <Alexa_rank> ?pv . ?pv <pred:value> \"29145.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"29145.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the facility with an ARCHON code of 1321 have 5.24e+06 visitors per year?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <visitors_per_year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.24e+06\"^^xsd:double . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"1321\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON_code> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"1321\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manifestation with 107.0 number of constituencies, 107.0 number of seats, and 107.0 as a fact?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <number_of_constituencies> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107.0\"^^xsd:double . ?e <number_of_seats> ?pv . ?pv <pred:value> \"107.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_seats> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"107.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Frankfort have a population of 255,270?", "sparql": "ASK { ?e <pred:name> \"Frankfort\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"255270.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the number of speakers of the Russian language equal to 1.10441e+08?", "sparql": "ASK { ?e <pred:name> \"Russian\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.10441e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Serpico have 15.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Serpico\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"15.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Minnesota have a population of 2.98248e+06?", "sparql": "ASK { ?e <pred:name> \"Minnesota\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.98248e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Windsor have a population of 32184?", "sparql": "ASK { ?e <pred:name> \"Windsor\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"32184.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Changsha have a population of 7.04412e+06?", "sparql": "ASK { ?e <pred:name> \"Changsha\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.04412e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Malaysia have a Gini coefficient of 46.2?", "sparql": "ASK { ?e <pred:name> \"Malaysia\" . ?e <Gini_coefficient> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"46.2\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Hebei have a population of 7.18542e+07?", "sparql": "ASK { ?e <pred:name> \"Hebei\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.18542e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Sabah have a population of 3.1174e+06?", "sparql": "ASK { ?e <pred:name> \"Sabah\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.1174e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Kingston have a population of 123,798?", "sparql": "ASK { ?e <pred:name> \"Kingston\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"123798.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Portland have a population of 66937?", "sparql": "ASK { ?e <pred:name> \"Portland\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66937.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Assam have a female population of 15,266,100?", "sparql": "ASK { ?e <pred:name> \"Assam\" . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.52661e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]