[{"question": "Was Aladdin published on 2019-05-24 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Aladdin\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2019-05-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Shame\" published on 2012-03-01 in Germany?", "sparql": "ASK { ?e <pred:name> \"Shame\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2012-03-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Salvador published in Germany on September 13, 2007?", "sparql": "ASK { ?e <pred:name> \"Salvador\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-09-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Tangled published on 2010-11-24 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Tangled\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-11-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Tabu\" published on December 20, 2012 in Germany?", "sparql": "ASK { ?e <pred:name> \"Tabu\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2012-12-20\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Vietnam's inception date on September 2, 1945 related to the declaration of independence?", "sparql": "ASK { ?e <pred:name> \"Vietnam\" . ?e <inception> ?pv . ?pv <pred:date> \"1945-09-02\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <applies_to_part> ?qpv . ?qpv <pred:value> \"declaration of independence\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book published in the United States of America in 2009-11-13 named 2012?", "sparql": "ASK { ?e <pred:name> \"2012\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-11-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was U-571 published on 2000-09-14 in Germany?", "sparql": "ASK { ?e <pred:name> \"U-571\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2000-09-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the Netherlands established on 1954-12-15 due to the Charter for the Kingdom of the Netherlands?", "sparql": "ASK { ?e <pred:name> \"Netherlands\" . ?e <inception> ?pv . ?pv <pred:date> \"1954-12-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <has_cause> ?qpv . ?qpv <pred:value> \"Charter for the Kingdom of the Netherlands\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Hellboy published on 2019-01-17 in the Netherlands?", "sparql": "ASK { ?e <pred:name> \"Hellboy\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2019-01-17\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Netherlands\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Beetlejuice published on 1988-11-10 in Germany?", "sparql": "ASK { ?e <pred:name> \"Beetlejuice\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1988-11-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Hampstead published on 2017-07-06 in Greece?", "sparql": "ASK { ?e <pred:name> \"Hampstead\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2017-07-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Greece\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Panama's independence recognized by the country from which it separated?", "sparql": "ASK { ?e <pred:name> \"Panama\" . ?e <inception> ?pv . ?pv <pred:date> \"1903-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <criterion_used> ?qpv . ?qpv <pred:value> \"independence recognized by country from which it separated\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was JFK published in Germany on January 23, 1992?", "sparql": "ASK { ?e <pred:name> \"JFK\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1992-01-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Watchmen published on 2009-03-05 in Hungary?", "sparql": "ASK { ?e <pred:name> \"Watchmen\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2009-03-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Hungary\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Shine\" published on 1997-03-13 in Germany?", "sparql": "ASK { ?e <pred:name> \"Shine\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1997-03-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Godzilla published in Germany on August 10, 1956?", "sparql": "ASK { ?e <pred:name> \"Godzilla\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1956-08-10\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Bulworth published on 1999-07-15 in Germany?", "sparql": "ASK { ?e <pred:name> \"Bulworth\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1999-07-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Orlando published in Germany on January 28, 1993?", "sparql": "ASK { ?e <pred:name> \"Orlando\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1993-01-28\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Downfall\" published on 2004-09-16 in Germany?", "sparql": "ASK { ?e <pred:name> \"Downfall\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2004-09-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Rushmore published on 2001-03-08 in Germany?", "sparql": "ASK { ?e <pred:name> \"Rushmore\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-03-08\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Enchanted\" published in Germany on December 20, 2007?", "sparql": "ASK { ?e <pred:name> \"Enchanted\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2007-12-20\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the declaration of Israeli independence the subject of a statement regarding the inception of Israel on May 14, 1948?", "sparql": "ASK { ?e <pred:name> \"Israel\" . ?e <inception> ?pv . ?pv <pred:date> \"1948-05-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <statement_is_subject_of> ?qpv . ?qpv <pred:value> \"declaration of Israeli independence\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Babel published on 2006-12-21 in Germany?", "sparql": "ASK { ?e <pred:name> \"Babel\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2006-12-21\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Labyrinth\" published on January 14, 2013 in Germany?", "sparql": "ASK { ?e <pred:name> \"Labyrinth\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2013-01-14\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Alien published on 1979-05-25 in the United States of America?", "sparql": "ASK { ?e <pred:name> \"Alien\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1979-05-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Salt\" published on 2010-08-19 in Germany?", "sparql": "ASK { ?e <pred:name> \"Salt\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-08-19\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Trainspotting published in Germany on August 15, 1996?", "sparql": "ASK { ?e <pred:name> \"Trainspotting\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1996-08-15\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie Saw published on 2005-03-04 in Denmark?", "sparql": "ASK { ?e <pred:name> \"Saw\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-03-04\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Denmark\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the musical Evita published in Germany on January 9, 1997?", "sparql": "ASK { ?e <pred:name> \"Evita\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1997-01-09\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Meridian published in Germany on February 23, 1996?", "sparql": "ASK { ?e <pred:name> \"Meridian\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1996-02-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Moneyball published on 2012-02-02 in Germany?", "sparql": "ASK { ?e <pred:name> \"Moneyball\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2012-02-02\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Witness published on 1985-05-24 in Germany?", "sparql": "ASK { ?e <pred:name> \"Witness\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1985-05-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Radio\" published on 2004-05-06 in Germany?", "sparql": "ASK { ?e <pred:name> \"Radio\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2004-05-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Mozambique a sovereign state that was established on 1975-06-25?", "sparql": "ASK { ?e <pred:name> \"Mozambique\" . ?e <inception> ?pv . ?pv <pred:date> \"1975-06-25\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <subject_has_role> ?qpv . ?qpv <pred:value> \"sovereign state\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the band Styx published in Germany on September 13, 2018?", "sparql": "ASK { ?e <pred:name> \"Styx\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2018-09-13\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie WarGames published in Germany on October 7, 1983?", "sparql": "ASK { ?e <pred:name> \"WarGames\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1983-10-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Wimbledon published in Germany on 2005-03-24?", "sparql": "ASK { ?e <pred:name> \"Wimbledon\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2005-03-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the book \"Legend\" published on 2016-01-07 in Germany?", "sparql": "ASK { ?e <pred:name> \"Legend\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2016-01-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Hereafter\" published on 2011-01-27 in Germany?", "sparql": "ASK { ?e <pred:name> \"Hereafter\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-01-27\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Traffic\" published in Ireland on March 23, 2001?", "sparql": "ASK { ?e <pred:name> \"Traffic\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2001-03-23\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Ireland\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the Thonburi Kingdom have a role in the inception of Thailand (which occurred on 1768-12-28)?", "sparql": "ASK { ?e <pred:name> \"Thailand\" . ?e <inception> ?pv . ?pv <pred:date> \"1768-12-28\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <subject_has_role> ?qpv . ?qpv <pred:value> \"Thonburi Kingdom\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Calgary a town that was established on November 7, 1884?", "sparql": "ASK { ?e <pred:name> \"Calgary\" . ?e <inception> ?pv . ?pv <pred:date> \"1884-11-07\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <subject_has_role> ?qpv . ?qpv <pred:value> \"town\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Carnage\" published on 2011-11-24 in Germany?", "sparql": "ASK { ?e <pred:name> \"Carnage\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2011-11-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Caravaggio published in Germany on January 22, 1987?", "sparql": "ASK { ?e <pred:name> \"Caravaggio\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1987-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the movie \"Poltergeist\" published in Hungary on May 28, 2015?", "sparql": "ASK { ?e <pred:name> \"Poltergeist\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2015-05-28\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication_date> ; <pred:fact_t> ?pv ] <place_of_publication> ?qpv . ?qpv <pred:value> \"Hungary\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Lost end on May 23, 2010 and have 121 episodes?", "sparql": "ASK { ?e <pred:name> \"Lost\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2010-05-23\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"121.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the show named Shackleton, which was published on 2002-01-01 and has 2.0 episodes, exist?", "sparql": "ASK { ?e <pred:name> \"Shackleton\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2002-01-01\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Yekaterinburg founded on January 1, 1723 and has a population of 1,401,730?", "sparql": "ASK { ?e <pred:name> \"Yekaterinburg\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1723-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.40173e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Ottawa founded on January 1, 1850 and has a population of 934,243?", "sparql": "ASK { ?e <pred:name> \"Ottawa\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1850-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"934243.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Punjab 1.01391e+08 and its inception date 1970-07-01?", "sparql": "ASK { ?e <pred:name> \"Punjab\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1970-07-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.01391e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Rhineland-Palatinate established on 1946-08-30 and has a population of 4.01158e+06?", "sparql": "ASK { ?e <pred:name> \"Rhineland-Palatinate\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-08-30\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.01158e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Bangkok founded on April 21, 1782 and has a population of 890,453?", "sparql": "ASK { ?e <pred:name> \"Bangkok\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1782-04-21\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"890453.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Calvados have an annual number of weddings equal to 2686.0 on its inception date of 1790-03-04?", "sparql": "ASK { ?e <pred:name> \"Calvados\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-03-04\"^^xsd:date . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2686.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Vanuatu established on January 1, 1980 and has a Human Development Index of 0.592?", "sparql": "ASK { ?e <pred:name> \"Vanuatu\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1980-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.592\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show \"Bones\" end on 2017-03-28 and have 246 episodes?", "sparql": "ASK { ?e <pred:name> \"Bones\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2017-03-28\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"246.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Fremont, which was founded on 1956-01-23, equal to 214089?", "sparql": "ASK { ?e <pred:name> \"Fremont\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-01-23\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"214089.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Ohio's population 11,536,500 and its inception date March 1, 1803?", "sparql": "ASK { ?e <pred:name> \"Ohio\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1803-03-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.15365e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Ukraine's Human Development Index 0.705 and its inception date 1991-08-24?", "sparql": "ASK { ?e <pred:name> \"Ukraine\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-24\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.705\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Lima, which was founded on 1535-01-18, 8.57497e+06?", "sparql": "ASK { ?e <pred:name> \"Lima\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1535-01-18\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.57497e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Arkansas 1,574,450 and was it established on June 15, 1836?", "sparql": "ASK { ?e <pred:name> \"Arkansas\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1836-06-15\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.57445e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Ciara (born on 1985-10-25) have 1 child?", "sparql": "ASK { ?e <pred:name> \"Ciara\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1985-10-25\"^^xsd:date . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Pleasantville founded on January 10, 1889 and has a population of 20249?", "sparql": "ASK { ?e <pred:name> \"Pleasantville\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1889-01-10\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20249.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Salinas, which was founded on March 4, 1874, equal to 150,441?", "sparql": "ASK { ?e <pred:name> \"Salinas\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1874-03-04\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"150441.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show \"Weeds\" first premiere on August 8, 2005 and have 102 episodes?", "sparql": "ASK { ?e <pred:name> \"Weeds\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"2005-08-08\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"102.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Queensland established on January 1, 1859 and has a population of 4.7085e+06?", "sparql": "ASK { ?e <pred:name> \"Queensland\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1859-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.7085e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Vicksburg established on January 1, 1826 and has a population of 26,407?", "sparql": "ASK { ?e <pred:name> \"Vicksburg\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1826-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"26407.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]