[
    {
        "question": "Which subreddit is related to trance and was created on 1995-01-01?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> trance . ?e <subreddit> ?pv . ?pv <pred:value> \"psytrance\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film has a duration of 98.0 and was published on 2001-08-16?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <duration> ?pv . ?pv <pred:value> \"98.0\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2001-08-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the instance that has an IIIF manifest of \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" and an inception date of 1860-01-17?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> print . ?e <IIIF manifest> ?pv . ?pv <pred:value> \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1860-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What agent has an ISNI of 0000 0000 9987 0743 and an inception date of 1946-01-01?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9987 0743\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the name of the Christian organization with ISNI 0000 0004 0508 6616 and was founded on 1957-01-01?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Christianity . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0508 6616\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What landform has a FIPS 10-4 code of GQ and an inception date of 1898-01-01?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> landform . ?e <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"GQ\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What taxon does Northern Dancer belong to and when was it born?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> taxon . ?e <native label> ?pv . ?pv <pred:value> \"Northern Dancer\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1961-05-27\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official name and inception date of the position referred to as \"Prime Minister\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> official . ?e <official name> ?pv . ?pv <pred:value> \"Prime Minister\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which opera had its first performance on 1909-01-25 and has only one part?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> opera . ?e <number of parts of this work of art> ?pv . ?pv <pred:value> \"1.0\" . ?e <date of first performance> ?pv_1 . ?pv_1 <pred:date> \"1909-01-25\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What entertainment received a review score of 4/10 on 2005-03-23?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> entertainment . ?e <review score> ?pv . ?pv <pred:value> \"4/10\" . ?e <review score> ?pv_1 . ?pv_1 <pred:value> \"4/10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <review score> ; <pred:fact_t> ?pv_1 ] <publication date> ?qpv . ?qpv <pred:date> \"2005-03-23\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What neighborhood had a population of 91982 on January 1st, 2010?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> neighborhood . ?e <population> ?pv . ?pv <pred:value> \"91982.0\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"91982.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which state has a Dewey Decimal Classification of 2--489 and a NUTS code of DK00, with an end time of 2007-12-31?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--489\" . ?e <NUTS code> ?pv_1 . ?pv_1 <pred:value> \"DK00\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS code> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2007-12-31\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which newspaper had an Alexa rank of 112.0 on November 20, 2017?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> newspaper . ?e <Alexa rank> ?pv . ?pv <pred:value> \"112.0\" . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"112.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was ranked first with a CANTIC-ID of a11246789 on 2008-08-18?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11246789\" . ?e <ranking> ?pv_1 . ?pv_1 <pred:value> \"1.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2008-08-18\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What was the price of the currency with ISO 4217 code INR on 2016-11-22?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> currency . ?e <ISO 4217 code> ?pv . ?pv <pred:value> \"INR\" . ?e <price> ?pv_1 . ?pv_1 <pred:value> \"0.014638\" . [ <pred:fact_h> ?e ; <pred:fact_r> <price> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2016-11-22\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which organization had an Alexa rank of 380.0 on 2017-11-20 and an Alexa rank of 360.0 at some point in time?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> organization . ?e <Alexa rank> ?pv . ?pv <pred:value> \"380.0\" . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:value> \"360.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa rank> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which university has an IPv4 routing prefix of 134.139.0.0/16 and a start time of 1989-06-08?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> university . ?e <IPv4 routing prefix> ?pv . ?pv <pred:value> \"134.139.0.0/16\" . ?e <IPv4 routing prefix> ?pv_1 . ?pv_1 <pred:value> \"134.139.0.0/16\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4 routing prefix> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1989-06-08\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which island had an ISO 3166-2 code of NZ-S until 2015-11-27?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> island . ?e <ISO 3166-2 code> ?pv . ?pv <pred:value> \"NZ-S\" . ?e <ISO 3166-2 code> ?pv_1 . ?pv_1 <pred:value> \"NZ-S\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO 3166-2 code> ; <pred:fact_t> ?pv_1 ] <end time> ?qpv . ?qpv <pred:date> \"2015-11-27\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the foundation with an Alexa rank of 29145.0 and an IPv4 routing prefix of 91.198.174.0/24 started?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> foundation . ?e <Alexa rank> ?pv . ?pv <pred:value> \"29145.0\" . ?e <IPv4 routing prefix> ?pv_1 . ?pv_1 <pred:value> \"91.198.174.0/24\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4 routing prefix> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"2007-10-02\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the catalog code for bulldog?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> bulldog . ?e <catalog code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification of Tabriz?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Tabriz . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Dewey Decimal Classification for Kingston?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Kingston . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the TOID of Gloucester?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Gloucester . ?e <TOID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Arch Linux package for Mesa?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Mesa . ?e <ArchLinux package> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is Scarlett based on?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Scarlett . ?e <based on> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who are the cast members of the movie Dogville?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Dogville . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the instance of the entity named \"center\"?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> center . ?e <pred:instance of> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What award did Cranford receive?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Cranford . ?e <award received> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Giphy username for MSNBC?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> MSNBC . ?e <Giphy username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Bellingham 80885 and does it have an official website of http://www.cob.org/?",
        "sparql": "ASK { ?e <pred:name> Bellingham . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80885.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"http://www.cob.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"http://www.cob.org/\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Rhodesia have a population of 6.93e+06 and an IOC country code of RHO?",
        "sparql": "ASK { ?e <pred:name> Rhodesia . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.93e+06\"^^xsd:double . ?e <IOC country code> ?pv . ?pv <pred:value> \"RHO\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IOC country code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"RHO\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does glycine have a pKa of 2.35 and an ATC code of B05CX03?",
        "sparql": "ASK { ?e <pred:name> glycine . ?e <pKa> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.35\"^^xsd:double . ?e <ATC code> ?pv . ?pv <pred:value> \"B05CX03\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ATC code> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"B05CX03\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Eritrea have a Human Development Index of 0.39 and a Dewey Decimal Classification of 2--635?",
        "sparql": "ASK { ?e <pred:name> Eritrea . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.39\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--635\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2--635\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the Human Development Index of Eswatini equal to 0.473?",
        "sparql": "ASK { ?e <pred:name> Eswatini . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.473\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.473\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"0.473\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Scrubs have 182 episodes, each with a duration of 22 minutes?",
        "sparql": "ASK { ?e <pred:name> Scrubs . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"182.0\"^^xsd:double . ?e <duration> ?pv . ?pv <pred:value> \"22.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <duration> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"22.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Trinidad 1.26714e+06 and its length 140.0?",
        "sparql": "ASK { ?e <pred:name> Trinidad . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.26714e+06\"^^xsd:double . ?e <length> ?pv . ?pv <pred:value> \"140.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <length> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"140.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Bergamo 119806 and does it have a Dewey Decimal Classification of 2--45241?",
        "sparql": "ASK { ?e <pred:name> Bergamo . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"119806.0\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--45241\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2--45241\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Bayreuth 61835 and does it have a Dewey Decimal Classification of 2--43315?",
        "sparql": "ASK { ?e <pred:name> Bayreuth . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"61835.0\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--43315\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey Decimal Classification> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"2--43315\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ISIN of PepsiCo and how many employees does it have with a value of 264000.0?",
        "sparql": "ASK { ?e <pred:name> PepsiCo . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"264000.0\"^^xsd:double . ?e <ISIN> ?pv . ?pv <pred:value> \"US7134481081\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISIN> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"US7134481081\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about the town with a population of 160000 and an OS grid reference of TQ315065?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> town . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"160000.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"160000.0\"^^xsd:double . ?e <OS grid reference> ?pv . ?pv <pred:value> \"TQ315065\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OS grid reference> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the pronunciation audio for the subreddit about vegetarianism with the subreddit name \"vegan\" and 189580 subscribers (the unit is 1)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> vegetarianism . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"vegan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"189580.0\"^^xsd:double . ?e <pronunciation audio> ?pv . ?pv <pred:value> \"LL-Q5146 (por)-NMaia-veganismo.wav\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation audio> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the activity with a Twitter username of sonic20th?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> activity . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"31585.0\"^^xsd:double . ?e <Twitter username> ?pv . ?pv <pred:value> \"sonic20th\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv ] <number of subscribers> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time when a state's Human Development Index was 0.683, given that its Human Development Index was 0.649 at a previous point in time?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.649\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"0.649\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:value> \"0.683\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Human Development Index> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of subscribers for the museum with Twitter username \"metmuseum\" and official website \"https://www.metmuseum.org/\" (the language of this statement is not specified)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> museum . ?e <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"metmuseum\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter username> ; <pred:fact_t> ?pv_1 ] <number of subscribers> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"4.47312e+06\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"https://www.metmuseum.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the temperature that applies to the part of the star whose absolute magnitude is 4.83?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> star . ?e <absolute magnitude> ?pv_1 . ?pv_1 <pred:value> \"4.83\" . [ <pred:fact_h> ?e ; <pred:fact_r> <absolute magnitude> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:unit> \"1\" . ?qpv_1 <pred:value> \"4.83\"^^xsd:double . ?e <temperature> ?pv . ?pv <pred:value> \"5e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <temperature> ; <pred:fact_t> ?pv ] <applies to part> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]