[{"question": "When did the republic, which was established on 1960-01-01, come into existence?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the division dissolved, abolished, or demolished on 2015-09-16?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2015-09-16\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the date of birth of the taxon born on 1970-01-28?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1970-01-28\"^^xsd:date . ?e <date_of_birth> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the capital city established (the one established on 1899-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1899-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the agent with an inception date of 1851-01-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1851-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the country that was established on 1965-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1965-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the manga that was published on 1952-04-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1952-04-01\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the college that was established on 1876-01-01 founded?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1876-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the anthology published on 1960-04-11?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-04-11\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the song released on 1968-01-30?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1968-01-30\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the techno genre start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the miniseries end that has an end time of 1979-02-24?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1979-02-24\"^^xsd:date . ?e <end_time> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the first flight of the marketing?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <first_flight> ?pv_1 . ?pv_1 <pred:date> \"1967-04-09\"^^xsd:date . ?e <first_flight> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the front end that ended on 1918-11-11 end?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"front\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1918-11-11\"^^xsd:date . ?e <end_time> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the date of birth of the person whose occupation is \"occupation\" and was born on 1934-08-18?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <date_of_birth> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the comedy end?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1992-05-09\"^^xsd:date . ?e <end_time> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the neighborhood that was established on 1630-09-28?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-28\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the soundtrack released on 2010-04-19?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-04-19\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the newspaper that has an inception date of 1851-09-18 established?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1851-09-18\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the army dissolved, abolished, or demolished?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1865-05-26\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the sound with an inception date of 1990-01-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the trance genre start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the photograph created that has an inception date of 1958-08-12?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"photograph\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1958-08-12\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Mormonism begin?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1830-04-06\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the cemetery established that has an inception date of 1825-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the blues genre start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"blues\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1928-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the film released on 2008-05-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-05-01\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the newscast start that has an inception date of 1975-11-03?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-11-03\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did Christianity begin?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the state dissolved, abolished, or demolished on June 1, 1979?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1979-06-01\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the opera first performed on 1909-01-25?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"opera\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1909-01-25\"^^xsd:date . ?e <date_of_first_performance> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the governor whose inception date is 1792-06-04 start their term?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1792-06-04\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the politician whose inception date is 1789-04-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did print start (inception date) according to the instance with the name \"print\" and inception date of 1860-01-17?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"print\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1860-01-17\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the painting that has an inception date of 1906-01-01 created?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"painting\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1906-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the genre that was established on 1876-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1876-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did anarcho-punk start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anarcho-punk\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1986-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the musical first performed on 1959-11-16?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1959-11-16\"^^xsd:date . ?e <date_of_first_performance> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the single released on 2013-10-28?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2013-10-28\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the road end?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1985-06-27\"^^xsd:date . ?e <end_time> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the writer born whose date of birth is 1934-08-18?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <date_of_birth> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did rockabilly music genre start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"rockabilly\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the monster that was published on 1933-03-02?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"monster\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1933-03-02\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the business that has an inception date of 1851-01-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1851-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the school that was established on 1835-01-01 founded?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1835-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the religion that was established on 1957-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the play first performed on November 16, 1959?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"play\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1959-11-16\"^^xsd:date . ?e <date_of_first_performance> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the end time of the industry that ended on 1943-02-04?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1943-02-04\"^^xsd:date . ?e <end_time> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the award that has an inception date of 1959-01-01 established?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1959-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the family dissolved, abolished, or demolished on June 12, 1946?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"family\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1946-06-12\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the hardcore genre start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"hardcore\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2000-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the museum established that has an inception date of 1824-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did post-hardcore start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1987-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the currency start that has a start time of 1694-07-27?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1694-07-27\"^^xsd:date . ?e <start_time> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the date of birth of the person born on 1981-03-24?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1981-03-24\"^^xsd:date . ?e <date_of_birth> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the conservatory established (the one established on 1920-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1920-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the association with an inception date of 1768-01-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1768-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the date of birth of the animal born on 1970-01-28?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animal\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1970-01-28\"^^xsd:date . ?e <date_of_birth> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the news with an inception date of 1975-11-03 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-11-03\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the city that was established in 1850 founded?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1850-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the position that was established on 1789-04-21?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-21\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did music start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the software that has an inception date of 2000-12-01 created?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2000-12-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the minister with an inception date of 1867-07-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the university that was established on 1946-01-01 founded?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the entertainment with a publication date of 1998-11-18?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-11-18\"^^xsd:date . ?e <publication_date> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the landform with an inception date of 1898-01-01 come into existence?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the profession that was established on 1867-07-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the foundation that was established on 1999-06-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-06-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the empire dissolved, abolished, or demolished?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1857-01-01\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the campus that was established in 1893 founded?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1893-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the facility that has an inception date of 1824-01-01 established?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the manifestation that has an inception date of 1867-07-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the band dissolve, abolish, or demolish?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2010-01-01\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the airline with an inception date of 1919-10-07 start operating?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1919-10-07\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the speaker whose inception date is 1789-04-01 start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]