[{"question": "Is there a university that was established on July 4, 1956 and has a student count of 29956?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-07-04\"^^xsd:date . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29956.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a landform that was formed on January 1, 1898 and has a population of 133,553?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"133553.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a foundation with an inception date of 2003-06-20 and an Alexa rank of 29145.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2003-06-20\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29145.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there an empire that was dissolved on 1453-01-01 and had a population of 3.4e+07?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1453-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.4e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manifestation with an inception date of 1867-07-01 and 107 seats?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <number_of_seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"107.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an airline that was established on 1919-10-07 and has 35488 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1919-10-07\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"35488.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which organization has 33.0 seats?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <number_of_seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_seats> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"33.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is a democracy with a Human Development Index of 0.752?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.752\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Human_Development_Index> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"0.752\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many medals have a quantity of 3493.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3493.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <quantity> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"3493.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which filmmaking has a number of episodes equal to 56.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"filmmaking\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"56.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many activities have 145 participants?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <number_of_participants> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"145.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_participants> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"145.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which town has a population of 49404.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"49404.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"49404.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many crimes have a number of deaths equal to 6e+06?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <number_of_deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_deaths> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which anime has 13 episodes?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"13.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which island has a population of 4170.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4170.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"4170.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which nationality has a population of 6,000,000?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"nationality\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which village has a population of 6323?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6323.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"6323.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which city/town has a population of 758,400?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"758400.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"758400.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which star has an absolute magnitude of 4.83?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"star\" . ?e <absolute_magnitude> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.83\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <absolute_magnitude> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"4.83\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which republic has a Human Development Index of 0.752?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.752\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Human_Development_Index> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"0.752\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many languages have 1.6e+07 number of speakers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.6e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.6e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which capital has a population of 8.1878e+06?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.1878e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"8.1878e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which agent has a number of seats equal to 33.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <number_of_seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_seats> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"33.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many countries have 462.0 out-of-school children?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <number_of_out-of-school_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"462.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_out-of-school_children> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"462.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which stop-motion show has 56 episodes?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"stop-motion\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"56.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which college has a student count of 18000?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"18000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"18000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which anthology has 218.0 pages?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <number_of_pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_pages> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which song has a beats per minute of 90.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <beats_per_minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"90.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <beats_per_minute> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"90.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which miniseries has 11.0 episodes?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"11.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"11.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which animation has 56.0 episodes?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animation\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"56.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which comedy has exactly 25.0 episodes?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"25.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which neighborhood has a population of 68469.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"68469.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"68469.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which newspaper has an Alexa rank of 112.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"112.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"112.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many armies have 1,129,900 employees?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1299e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.1299e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which cemetery has 20,000 graves?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <number_of_graves> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_graves> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"20000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which state has an annual number of weddings equal to 86.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"86.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual_number_of_weddings> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"86.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many people speak Tagalog?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"9e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which genre has a number of pages equal to 218.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <number_of_pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_pages> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which single has a beats per minute of 72.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <beats_per_minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"72.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <beats_per_minute> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"72.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which business has 17280 employees?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"17280.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"17280.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which school has 139 employees?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"139.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"139.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which industry has 56.0 episodes?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_episodes> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"56.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which award has an Alexa rank of 126668.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"126668.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"126668.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many diseases have a number of cases equal to 2e+07?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <number_of_cases> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_cases> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which medication has an atomic number of 26.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medication\" . ?e <atomic_number> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"26.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <atomic_number> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"26.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many humans have exactly 5 children?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_children> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"5.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which conservatory has 900 students?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"900.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"900.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which association has 80 employees?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"80.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which city has a population of 163,000?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"163000.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"163000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which software has an Alexa rank of 1.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which university has 3211 employees?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3211.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"3211.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which landform has a population of 4170.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4170.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"4170.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many people speak Malay?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Malay\" . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.3e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"4.3e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which foundation has an Alexa rank of 29145.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"29145.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"29145.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which empire has a population of 3.4e+07?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.4e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"3.4e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which manifestation has a number of constituencies equal to 107.0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <number_of_constituencies> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"107.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_constituencies> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"107.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which airline has 35488 employees?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"35488.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv ] <pred:fact_t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"35488.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the organization's inception date 1946-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1946-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]