[{"question": "Is the population of Denton 113,383 and was it founded on January 1, 1866?", "sparql": "ASK { ?e <pred:name> \"Denton\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1866-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"113383.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the show named Madison start on 1993-09-21 and have 65.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Madison\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1993-09-21\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"65.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Thor, published on 2011-04-27, have an attendance of 1,184,550?", "sparql": "ASK { ?e <pred:name> \"Thor\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-04-27\"^^xsd:date . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.18455e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Starbucks a company that was founded on March 30, 1971 and has 238,000 employees?", "sparql": "ASK { ?e <pred:name> \"Starbucks\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-03-30\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"238000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Lombardy established on January 1, 1948 and has a population of 10,006,700?", "sparql": "ASK { ?e <pred:name> \"Lombardy\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1948-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.00067e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Albania established on January 1, 1912 and has a Human Development Index of 0.674?", "sparql": "ASK { ?e <pred:name> \"Albania\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.674\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Hayward, which was founded on March 11, 1876, equal to 144,186?", "sparql": "ASK { ?e <pred:name> \"Hayward\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1876-03-11\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"144186.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Alabama's population 2.64625e+06 and its inception date 1819-12-14?", "sparql": "ASK { ?e <pred:name> \"Alabama\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1819-12-14\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.64625e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Human Development Index of Comoros, which was established on 1975-07-06, equal to 0.499?", "sparql": "ASK { ?e <pred:name> \"Comoros\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-07-06\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.499\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Netherlands with an inception date of 1954-12-15 and a Human Development Index of 0.909?", "sparql": "ASK { ?e <pred:name> \"Netherlands\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-12-15\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.909\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Bedford founded on January 1, 1680 and has a population of 17,335?", "sparql": "ASK { ?e <pred:name> \"Bedford\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1680-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"17335.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Montreal founded on May 17, 1642 and has a population of 1,649,520?", "sparql": "ASK { ?e <pred:name> \"Montreal\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1642-05-17\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.64952e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Decatur founded on January 1, 1823 and has a population of 19853?", "sparql": "ASK { ?e <pred:name> \"Decatur\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1823-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"19853.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Community end on June 2, 2015 and have 110 episodes?", "sparql": "ASK { ?e <pred:name> \"Community\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2015-06-02\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"110.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Boeing founded on July 15, 1916 and has 165,500 employees?", "sparql": "ASK { ?e <pred:name> \"Boeing\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1916-07-15\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"165500.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Auburn (incepted on 1888-05-02) 13330.0?", "sparql": "ASK { ?e <pred:name> \"Auburn\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1888-05-02\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13330.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is HBO's inception date November 8, 1972 and does it have 130,000,000 subscribers?", "sparql": "ASK { ?e <pred:name> \"HBO\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1972-11-08\"^^xsd:date . ?e <number_of_subscribers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.3e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Boston 617,594 and was it founded on September 7, 1630?", "sparql": "ASK { ?e <pred:name> \"Boston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"617594.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Guinea-Bissau's Human Development Index 0.418 and was it established on January 1, 1974?", "sparql": "ASK { ?e <pred:name> \"Guinea-Bissau\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.418\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Chad's Human Development Index 0.338?", "sparql": "ASK { ?e <pred:name> \"Chad\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-08-11\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.338\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the female population of Gujarat, which was established on 1960-05-01, equal to 2.89484e+07?", "sparql": "ASK { ?e <pred:name> \"Gujarat\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-05-01\"^^xsd:date . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.89484e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Thailand established on December 28, 1768 and has a Human Development Index of 0.539?", "sparql": "ASK { ?e <pred:name> \"Thailand\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1768-12-28\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.539\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Paramaribo founded on January 1, 1603 and has a population of 240,000?", "sparql": "ASK { ?e <pred:name> \"Paramaribo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1603-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"240000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Savannah start on January 21, 1996 and have 34 episodes?", "sparql": "ASK { ?e <pred:name> \"Savannah\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1996-01-21\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"34.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the female population of Haryana, which was established on 1966-11-01, equal to 1.18567e+07?", "sparql": "ASK { ?e <pred:name> \"Haryana\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-11-01\"^^xsd:date . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.18567e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Saskatchewan 1,098,350 and was it established on January 1, 1905?", "sparql": "ASK { ?e <pred:name> \"Saskatchewan\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1905-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.09835e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Manitoba, which was established on January 1, 1870, equal to 1,289,790?", "sparql": "ASK { ?e <pred:name> \"Manitoba\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1870-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.28979e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Ghana's Human Development Index 0.427 and its inception date 1957-01-01?", "sparql": "ASK { ?e <pred:name> \"Ghana\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.427\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Nord have 9763 weddings in a year (the one whose inception date is 1790-03-04)?", "sparql": "ASK { ?e <pred:name> \"Nord\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-03-04\"^^xsd:date . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9763.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Torrance established on May 12, 1921 and has a population of 145,438?", "sparql": "ASK { ?e <pred:name> \"Torrance\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1921-05-12\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"145438.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show ER end on April 2, 2009 and have 331 episodes?", "sparql": "ASK { ?e <pred:name> \"ER\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2009-04-02\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"331.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Mississippi 2,520,640 and was it established on December 10, 1817?", "sparql": "ASK { ?e <pred:name> \"Mississippi\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1817-12-10\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.52064e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Tasmania established on December 3, 1825 and has a population of 509,965?", "sparql": "ASK { ?e <pred:name> \"Tasmania\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-12-03\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"509965.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Liechtenstein's Human Development Index 0.907 and its inception date 1806-01-01?", "sparql": "ASK { ?e <pred:name> \"Liechtenstein\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1806-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.907\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Jamaica established on January 1, 1962 and has a Human Development Index of 0.648?", "sparql": "ASK { ?e <pred:name> \"Jamaica\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.648\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Hercules have a first performance date of 1999-03-26 and a number of episodes of 65.0?", "sparql": "ASK { ?e <pred:name> \"Hercules\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1999-03-26\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"65.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Columbia, which was established on June 21, 1967, equal to 103,683?", "sparql": "ASK { ?e <pred:name> \"Columbia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1967-06-21\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"103683.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Lorraine have a population of 2.3452e+06 on 2016-01-01?", "sparql": "ASK { ?e <pred:name> \"Lorraine\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2016-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.3452e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Brantford founded on May 31, 1877 and has a population of 97,496?", "sparql": "ASK { ?e <pred:name> \"Brantford\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1877-05-31\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"97496.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Taiwan established on January 1, 1912 and has a population of 23,508,400?", "sparql": "ASK { ?e <pred:name> \"Taiwan\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.35084e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Taxi end on June 15, 1983 and have 114 episodes?", "sparql": "ASK { ?e <pred:name> \"Taxi\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1983-06-15\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"114.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Vietnam established on September 2, 1945 and has a Human Development Index of 0.666?", "sparql": "ASK { ?e <pred:name> \"Vietnam\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1945-09-02\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.666\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Muskogee, which was founded on March 16, 1898, equal to 39223.0?", "sparql": "ASK { ?e <pred:name> \"Muskogee\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-03-16\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"39223.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Bahrain's Human Development Index 0.821 and its inception date 1971-08-14?", "sparql": "ASK { ?e <pred:name> \"Bahrain\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-08-14\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.821\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Guyana established on January 1, 1966 and has a population of 740,041?", "sparql": "ASK { ?e <pred:name> \"Guyana\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"740041.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Englewood, which was founded on 1899-03-17, 6253.0?", "sparql": "ASK { ?e <pred:name> \"Englewood\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1899-03-17\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6253.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Greensburg, which was founded on 1799-02-09, 14892?", "sparql": "ASK { ?e <pred:name> \"Greensburg\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1799-02-09\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"14892.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Sherlock start on July 25, 2010 and have 13 episodes?", "sparql": "ASK { ?e <pred:name> \"Sherlock\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2010-07-25\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Somerville, which was founded on 1863-03-25, 12098?", "sparql": "ASK { ?e <pred:name> \"Somerville\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1863-03-25\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"12098.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the show named Emma end on 2009-10-25 and have 1 season with a value of 1.0?", "sparql": "ASK { ?e <pred:name> \"Emma\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2009-10-25\"^^xsd:date . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Spider-Man, published on 1994-01-01, have 65.0 episodes?", "sparql": "ASK { ?e <pred:name> \"Spider-Man\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1994-01-01\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"65.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the TV show Merlin, which was published on 1998-01-01 and has 2.0 episodes, exist?", "sparql": "ASK { ?e <pred:name> \"Merlin\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-01-01\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Aruba established on January 1, 1986 and has a population of 62204.0?", "sparql": "ASK { ?e <pred:name> \"Aruba\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1986-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"62204.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Rome have its first performance on 2005-05-28 and have 22 episodes?", "sparql": "ASK { ?e <pred:name> \"Rome\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"2005-05-28\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"22.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the female population of Bihar, which was established on 1912-03-22, equal to 4.98213e+07?", "sparql": "ASK { ?e <pred:name> \"Bihar\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1912-03-22\"^^xsd:date . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4.98213e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Makati established on November 4, 1670 and does it have an electorate of 399726?", "sparql": "ASK { ?e <pred:name> \"Makati\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1670-11-04\"^^xsd:date . ?e <electorate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"399726.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Bermuda established on January 1, 1612 and has a population of 59746?", "sparql": "ASK { ?e <pred:name> \"Bermuda\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1612-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"59746.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Neighbours first premiere on March 18, 1985 and have 7750 episodes?", "sparql": "ASK { ?e <pred:name> \"Neighbours\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1985-03-18\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7750.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Caracas founded on July 25, 1567 and does it have a population of 1,943,900?", "sparql": "ASK { ?e <pred:name> \"Caracas\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1567-07-25\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.9439e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the organization have a number of seats equal to 80.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <number_of_seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <number_of_seats> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a democracy with a Human Development Index of 0.424?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.424\"^^xsd:double . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.424\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a medal with a quantity of 3493.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <quantity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3493.0\"^^xsd:double . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3493.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does filmmaking have a number of episodes equal to 56.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"filmmaking\" . ?e <number_of_episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56.0\"^^xsd:double . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"56.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the activity have 20 participants?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <number_of_participants> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"20.0\"^^xsd:double . ?e <number_of_participants> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the town have a population of 160,000?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"160000.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"160000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Are there 6.22216e+07 Chinese speakers?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"Chinese\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.22216e+07\"^^xsd:double . ?e <number_of_speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.22216e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the crime have a number of deaths equal to 6 million?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"crime\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6e+06\"^^xsd:double . ?e <number_of_deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the island have a population of 1,115,800?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1158e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1158e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a metropolis with a population of 1.64952e+06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.64952e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.64952e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]