[{"question": "Was the book titled \"Venus\" published on January 1, 2006?", "sparql": "ASK { ?e <pred:name> \"Venus\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Venus\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show \"Entourage\" end on September 11, 2011?", "sparql": "ASK { ?e <pred:name> \"Entourage\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2011-09-11\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> \"Entourage\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the activity with a review score of 6/10 (published on 2004-12-08) and an official website of https://web.archive.org/web/20090202050724/http://alexander-thegame.com/us/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <review_score> ?pv_1 . ?pv_1 <pred:value> \"6/10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <review_score> ; <pred:fact_t> ?pv_1 ] <publication_date> ?qpv_1 . ?qpv_1 <pred:date> \"2004-12-08\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://web.archive.org/web/20090202050724/http://alexander-thegame.com/us/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the taxon with the name \"Poaceae\" and ITIS TSN of 40351 first published?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <taxon_name> ?pv_1 . ?pv_1 <pred:value> \"Poaceae\" . [ <pred:fact_h> ?e ; <pred:fact_r> <taxon_name> ; <pred:fact_t> ?pv_1 ] <year_of_taxon_name_publication> ?qpv_1 . ?qpv_1 <pred:date> \"1895-01-01\"^^xsd:date . ?e <ITIS_TSN> ?pv . ?pv <pred:value> \"40351\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ITIS_TSN> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the capital with ISO 3166-2 code CZ-PR cease to exist?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <ISO_3166-2_code> ?pv_1 . ?pv_1 <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv_1 ] <end_time> ?qpv_1 . ?qpv_1 <pred:date> \"2016-11-15\"^^xsd:date . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the country with NUTS code UKM start and end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <NUTS_code> ?pv_1 . ?pv_1 <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS_code> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:date> \"1999-01-01\"^^xsd:date . ?e <NUTS_code> ?pv . ?pv <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS_code> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the archive date for the industry with the official website http://windows.microsoft.com/ru-ru/windows/products/windows-xp (the language of this statement is English)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://windows.microsoft.com/ru-ru/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <archive_date> ?qpv_1 . ?qpv_1 <pred:date> \"2012-10-24\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://windows.microsoft.com/en-us/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the conservatory with the short name \"\u0421\u0430\u043d\u043a\u0442-\u041f\u0435\u0442\u0435\u0440\u0431\u0443\u0440\u0433\u0441\u043a\u0430\u044f \u043a\u043e\u043d\u0441\u0435\u0440\u0432\u0430\u0442\u043e\u0440\u0438\u044f\" (which started on 1991-09-24) end and have the short name \"\u0421\u041f\u0431\u041a\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"\u0421\u0430\u043d\u043a\u0442-\u041f\u0435\u0442\u0435\u0440\u0431\u0443\u0440\u0433\u0441\u043a\u0430\u044f \u043a\u043e\u043d\u0441\u0435\u0440\u0432\u0430\u0442\u043e\u0440\u0438\u044f\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:date> \"1991-09-24\"^^xsd:date . ?e <short_name> ?pv . ?pv <pred:value> \"\u0421\u041f\u0431\u041a\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the official website \"https://www.whitehouse.gov/people/mike-pence/\" of the position retrieved?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.whitehouse.gov/people/mike-pence/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <retrieved> ?qpv_1 . ?qpv_1 <pred:date> \"2018-07-25\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.whitehouse.gov/people/mike-pence/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the archive date for the software with the official website http://windows.microsoft.com/ru-ru/windows/products/windows-xp and the language of work or name is English?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://windows.microsoft.com/ru-ru/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <archive_date> ?qpv_1 . ?qpv_1 <pred:date> \"2012-10-24\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://windows.microsoft.com/en-us/windows/products/windows-xp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the university with the IPv4 routing prefix 134.139.0.0/16 (which started on 1989-06-08) establish its official website as http://www.csulb.edu?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <IPv4_routing_prefix> ?pv_1 . ?pv_1 <pred:value> \"134.139.0.0/16\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4_routing_prefix> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:date> \"1989-06-08\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.csulb.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the foundation with the IPv4 routing prefix 91.198.174.0/24 (starting on 2007-10-02) establish its official website, which is https://wikimediafoundation.org/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <IPv4_routing_prefix> ?pv_1 . ?pv_1 <pred:value> \"91.198.174.0/24\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPv4_routing_prefix> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:date> \"2007-10-02\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"https://wikimediafoundation.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the band with the Twitter username \"depechemode\" start using that username and what language pertains to their work or name?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"depechemode\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <start_time> ?qpv_1 . ?qpv_1 <pred:date> \"2009-03-01\"^^xsd:date . ?e <Twitter_username> ?pv . ?pv <pred:value> \"depechemode\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ukraine (the one with a CIVICUS_Monitor_country_entry of ukraine) and Ukraine (the one with a Human_Development_Index of 0.747)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ukraine\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"ukraine\" . ?e_2 <pred:name> \"Ukraine\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.747\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Stockport (with an OS grid reference of SJ895900) and Stockport (with a population of 288700.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stockport\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"SJ895900\" . ?e_2 <pred:name> \"Stockport\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"288700.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Taunton (with an OS grid reference of ST228250) and Taunton (with a population of 55874.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Taunton\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"ST228250\" . ?e_2 <pred:name> \"Taunton\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"55874.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Chihuahua (the one with a British Museum person-institution value of 107484) and Chihuahua (the one with a population of 878062.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chihuahua\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"107484\" . ?e_2 <pred:name> \"Chihuahua\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"878062.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Stockton-on-Tees (the one with an OS grid reference of NZ440200) and Stockton-on-Tees (the one with a population of 194800.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Stockton-on-Tees\" . ?e_1 <OS_grid_reference> ?pv . ?pv <pred:value> \"NZ440200\" . ?e_2 <pred:name> \"Stockton-on-Tees\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"194800.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Norwalk (the one with Dewey Decimal Classification 2--79493) and Norwalk (the one with a population of 88145.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Norwalk\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79493\" . ?e_2 <pred:name> \"Norwalk\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"88145.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Burundi (the one with Dewey Decimal Classification 2--67572) and Burundi (the one with Human Development Index 0.328)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Burundi\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--67572\" . ?e_2 <pred:name> \"Burundi\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.328\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Carlisle (the one with GSS code (2011) E07000028) and Carlisle (the one with a population of 75399.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Carlisle\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E07000028\" . ?e_2 <pred:name> \"Carlisle\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"75399.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mauritius (the one with Dewey Decimal Classification 2--6982) and Mauritius (the one with Human Development Index 0.674)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mauritius\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6982\" . ?e_2 <pred:name> \"Mauritius\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.674\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bahamas (the one whose FIPS 10-4 is BF) and Bahamas (the one with a population of 256338.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bahamas\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"BF\" . ?e_2 <pred:name> \"Bahamas\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"256338.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ireland (the one with Dewey Decimal Classification 2--415 and a population of 2.83605e+06) to Ireland?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ireland\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--415\" . ?e_2 <pred:name> \"Ireland\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.83605e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Cameroon (the one with Dewey Decimal Classification 2--6711) and Cameroon (the one with Human Development Index 0.507)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6711\" . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.507\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Armenia (the one with British Museum person-institution ID 165802) and Armenia (the one with a population of 2.00217e+06)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Armenia\" . ?e_1 <British_Museum_person-institution> ?pv . ?pv <pred:value> \"165802\" . ?e_2 <pred:name> \"Armenia\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.00217e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Hawaii (the one with a production code of 1ARG23) and Hawaii (the one with a population of 632772.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Hawaii\" . ?e_1 <production_code> ?pv . ?pv <pred:value> \"1ARG23\" . ?e_2 <pred:name> \"Hawaii\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"632772.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Malawi (the one with Dewey Decimal Classification 2--6897) and Malawi (the one with Human Development Index 0.42)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Malawi\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6897\" . ?e_2 <pred:name> \"Malawi\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.42\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Barbados (the one with Dewey Decimal Classification 2--72981) and Barbados (the one with a population of 258443.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Barbados\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--72981\" . ?e_2 <pred:name> \"Barbados\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"258443.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How is Rotterdam (the one with CBS municipality code 0599 and a population of 619879.0) related to Rotterdam?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rotterdam\" . ?e_1 <CBS_municipality_code> ?pv . ?pv <pred:value> \"0599\" . ?e_2 <pred:name> \"Rotterdam\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"619879.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Luxembourg (the one with Dewey Decimal Classification 2--4935) and Luxembourg (the one with Human Development Index 0.752)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Luxembourg\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4935\" . ?e_2 <pred:name> \"Luxembourg\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.752\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Lithuania (the one with Dewey Decimal Classification 2--4793) and Lithuania (the one with 4808.0 out-of-school children)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Lithuania\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4793\" . ?e_2 <pred:name> \"Lithuania\" . ?e_2 <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4808.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Belize (the one with Dewey Decimal Classification 2--7282) and Belize (the one with Human Development Index 0.715)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Belize\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--7282\" . ?e_2 <pred:name> \"Belize\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.715\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Cambridgeshire (with GSS code (2011) E10000003) and Cambridgeshire (with a population of 806700.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cambridgeshire\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E10000003\" . ?e_2 <pred:name> \"Cambridgeshire\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"806700.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Derbyshire (with GSS code (2011) E10000007 and a population of 1.0366e+06) to Derbyshire?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Derbyshire\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E10000007\" . ?e_2 <pred:name> \"Derbyshire\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0366e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Fairfield (the one with Dewey Decimal Classification 2--79452) and Fairfield (the one with a population of 59404.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fairfield\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--79452\" . ?e_2 <pred:name> \"Fairfield\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"59404.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Sheffield (with GSS code (2011) E08000019) and Sheffield (with a population of 518090.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sheffield\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E08000019\" . ?e_2 <pred:name> \"Sheffield\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"518090.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bhutan (the one with Dewey Decimal Classification of 2--5498) and Bhutan (the one with Human Development Index of 0.582)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bhutan\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--5498\" . ?e_2 <pred:name> \"Bhutan\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.582\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Gotha (the one with Dewey Decimal Classification 2--432249) and Gotha (the one with a population of 135376.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Gotha\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--432249\" . ?e_2 <pred:name> \"Gotha\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"135376.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Monaco (the one with Dewey Decimal Classification 2--44949) and Monaco (the one with a population of 30423.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Monaco\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--44949\" . ?e_2 <pred:name> \"Monaco\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"30423.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How is Groningen (the one with Amsterdam code 10426 and population of 200952.0) related to Groningen?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Groningen\" . ?e_1 <Amsterdam_code> ?pv . ?pv <pred:value> \"10426\" . ?e_2 <pred:name> \"Groningen\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"200952.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Kent (the one with GSS code (2011) E10000016) and Kent (the one with a population of 1.7314e+06)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Kent\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E10000016\" . ?e_2 <pred:name> \"Kent\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.7314e+06\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Woking (with GSS code (2011) E07000217 and a population of 62796.0) to Woking?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Woking\" . ?e_1 <GSS_code_(2011)> ?pv . ?pv <pred:value> \"E07000217\" . ?e_2 <pred:name> \"Woking\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"62796.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Salzburg (the one with Dewey Decimal Classification 2--4363) and Salzburg (the one with a population of 152367.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Salzburg\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--4363\" . ?e_2 <pred:name> \"Salzburg\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"152367.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Pittsburgh (the one with a title of Pittsburgh) and Pittsburgh (the one with a population of 305704.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Pittsburgh\" . ?e_1 <title> ?pv . ?pv <pred:value> \"Pittsburgh\" . ?e_2 <pred:name> \"Pittsburgh\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"305704.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Zimbabwe (the one with Dewey Decimal Classification 2--6891) and Zimbabwe (the one with Human Development Index 0.499)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Zimbabwe\" . ?e_1 <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--6891\" . ?e_2 <pred:name> \"Zimbabwe\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.499\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Nokia (the one with ACM Classification Code (2012) of 10011561) and Nokia (the one with a population of 28604.0)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nokia\" . ?e_1 <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10011561\" . ?e_2 <pred:name> \"Nokia\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"28604.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the city named Canberra (with an IMO ship number of 5059953) and a population of 381,488?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Canberra\" . ?e_1 <IMO_ship_number> ?pv . ?pv <pred:value> \"5059953\" . ?e_2 <pred:name> \"Canberra\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"381488.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Canada (the one with CIVICUS_Monitor_country_entry equal to canada) and Canada (the one with a population of 2.9354e+07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Canada\" . ?e_1 <CIVICUS_Monitor_country_entry> ?pv . ?pv <pred:value> \"canada\" . ?e_2 <pred:name> \"Canada\" . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.9354e+07\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Samoa (the one with FIPS 10-4 code WS) and Samoa (the one with a Human Development Index of 0.679)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Samoa\" . ?e_1 <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"WS\" . ?e_2 <pred:name> \"Samoa\" . ?e_2 <Human_Development_Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.679\"^^xsd:double . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]