[{"question": "Which business has an inception date of 1887-03-04 and an ISNI of 0000 0000 8338 5874?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <inception> ?pv . ?pv <pred:date> \"1887-03-04\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8338 5874\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which school was established on January 1, 1611 and has an ARCHON code of 1143?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <inception> ?pv . ?pv <pred:date> \"1611-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"1143\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which religion was founded on 1957-01-01 and has an ISNI of 0000 0004 0508 6616?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which industry was established on January 30, 2007 and has the nickname \"Longhorn\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <inception> ?pv . ?pv <pred:date> \"2007-01-30\"^^xsd:date . ?e <nickname> ?pv_1 . ?pv_1 <pred:value> \"Longhorn\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which award has an inception date of 1983-01-01 and an ISNI of 0000 0004 0644 5609?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <inception> ?pv . ?pv <pred:date> \"1983-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0644 5609\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which museum was established on January 1, 1824 and has an ARCHON code of 345?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which post-hardcore band was formed on January 1, 1987 and has a subreddit called \"Emo\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <inception> ?pv . ?pv <pred:date> \"1987-01-01\"^^xsd:date . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which currency has an ISO 4217 code of GBP and started on 1694-07-27?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <start_time> ?pv . ?pv <pred:date> \"1694-07-27\"^^xsd:date . ?e <ISO_4217_code> ?pv_1 . ?pv_1 <pred:value> \"GBP\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person with ISNI 0000 0000 5930 3891 and was born on September 21, 1931?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1931-09-21\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 5930 3891\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which conservatory was established on January 1, 1921 and has an ISNI of 0000 0001 2189 390X?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <inception> ?pv . ?pv <pred:date> \"1921-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2189 390X\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which association was established on January 1, 1768 and has an ARCHON code of 397?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <inception> ?pv . ?pv <pred:date> \"1768-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"397\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which animal was born on 1961-05-27 and has a native label of \"Northern Dancer\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"animal\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1961-05-27\"^^xsd:date . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which news organization had their first performance on 1952-01-14 and has an Instagram username of \"todayshow\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1952-01-14\"^^xsd:date . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which position was created on 1789-04-21 and has an Instagram username of \"vp\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-21\"^^xsd:date . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"vp\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which music genre was created on January 1, 1991 and has a subreddit called \"minimal\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <inception> ?pv . ?pv <pred:date> \"1991-01-01\"^^xsd:date . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which software was created on July 22, 2009 and has a Stack Exchange tag of \"https://stackoverflow.com/tags/windows-7\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <inception> ?pv . ?pv <pred:date> \"2009-07-22\"^^xsd:date . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://stackoverflow.com/tags/windows-7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which minister has an inception date of 1867-07-01 and an official name of \"Prime Minister\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Prime Minister\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which university was established on September 29, 1963 and has an ARCHON code of 1187?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <inception> ?pv . ?pv <pred:date> \"1963-09-29\"^^xsd:date . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"1187\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entertainment has a publication date of 1996-07-31 and an official website of http://www.bitmap-brothers.co.uk/our-games/past/z.htm?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1996-07-31\"^^xsd:date . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.bitmap-brothers.co.uk/our-games/past/z.htm\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which landform was formed on January 1, 1898 and has a FIPS 10-4 code of GQ?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"GQ\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which profession has an inception date of 1789-04-06 and a native label of \"United States Secretary of State\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-06\"^^xsd:date . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"United States Secretary of State\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which foundation was established on June 1, 1999 and has an ACM Classification Code of 10011263?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <inception> ?pv . ?pv <pred:date> \"1999-06-01\"^^xsd:date . ?e <ACM_Classification_Code_(2012)> ?pv_1 . ?pv_1 <pred:value> \"10011263\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which empire was dissolved on January 1, 1453 and has an OSM tag or key value of \"Tag:historic:civilization=byzantine\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1453-01-01\"^^xsd:date . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:historic:civilization=byzantine\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which campus was established on January 1, 1893 and has an official website of https://www.hopkinsmedicine.org/som/index.html?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <inception> ?pv . ?pv <pred:date> \"1893-01-01\"^^xsd:date . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.hopkinsmedicine.org/som/index.html\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which facility has an inception date of 1824-01-01 and an ARCHON code of 345?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which band was formed on January 1, 1969 and has an ISNI of 0000 0001 1089 9660?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <inception> ?pv . ?pv <pred:date> \"1969-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1089 9660\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which airline started its work on 1926-04-06 and has a Corporate Number (Japan) of 3700150005378?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <work_period_(start)> ?pv . ?pv <pred:date> \"1926-04-06\"^^xsd:date . ?e <Corporate_Number_(Japan)> ?pv_1 . ?pv_1 <pred:value> \"3700150005378\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which speaker has an inception date of April 1, 1789 and a native label of \"Speaker of the United States House of Representatives\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which disco genre was created on January 1, 1978 and has a subreddit called \"italodisco\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <inception> ?pv . ?pv <pred:date> \"1978-01-01\"^^xsd:date . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the organization with 80.0 seats and an official website of http://www.assembly.ca.gov/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <number_of_seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.assembly.ca.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the town with a population of 344218.0 and an official name of \u0411\u0440\u044e\u043d\u043d end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"344218.0\"^^xsd:double . ?e <official_name> ?pv . ?pv <pred:value> \"\u0411\u0440\u044e\u043d\u043d\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the number of speakers for the Chinese language (with Glottolog code mand1415) and how many of them are there?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Chinese\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.074e+09\"^^xsd:double . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"mand1415\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the island with a population of 3.5198e+06 and an ISO 3166-2 code of NZ-N cease to exist?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.5198e+06\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"NZ-N\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the village with a population of 6323.0 and a name in native language of Underhill's Crossing cease to exist?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Underhill's Crossing\" . [ <pred:fact_h> ?e ; <pred:fact_r> <name_in_native_language> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the population of the city/town with a local dialing code of 322 and a population of 757594.0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"757594.0\"^^xsd:double . ?e <local_dialing_code> ?pv . ?pv <pred:value> \"322\" . [ <pred:fact_h> ?e ; <pred:fact_r> <local_dialing_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the mapping relation type for the war with a number of deaths equal to 7.3e+07 and Regensburg Classification of NQ 2545 - NQ 2795?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"7.3e+07\"^^xsd:double . ?e <Regensburg_Classification> ?pv . ?pv <pred:value> \"NQ 2545 - NQ 2795\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Regensburg_Classification> ; <pred:fact_t> ?pv ] <mapping_relation_type> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language that has 4.37e+08 speakers and has an IETF language tag of \"es\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.37e+08\"^^xsd:double . ?e <IETF_language_tag> ?pv . ?pv <pred:value> \"es\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IETF_language_tag> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the capital with 4787.0 employees and ISO 3166-2 code CZ-PR end?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4787.0\"^^xsd:double . ?e <ISO_3166-2_code> ?pv . ?pv <pred:value> \"CZ-PR\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_3166-2_code> ; <pred:fact_t> ?pv ] <end_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.assembly.ca.gov/ website regarding the agent with 80.0 number of seats?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <number_of_seats> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.assembly.ca.gov/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the country with a population of 5.4047e+06 and a NUTS code of UKM start?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.4047e+06\"^^xsd:double . ?e <NUTS_code> ?pv . ?pv <pred:value> \"UKM\" . [ <pred:fact_h> ?e ; <pred:fact_r> <NUTS_code> ; <pred:fact_t> ?pv ] <start_time> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the http://www.smc.edu website regarding the college with 2023.0 employees?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2023.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.smc.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the anthology with 218.0 pages and an OCLC control number of 357792?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <number_of_pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name of the song with an ISWC of T-070.017.986-7 and a beats per minute of 96.0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <beats_per_minute> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"96.0\"^^xsd:double . ?e <ISWC> ?pv . ?pv <pred:value> \"T-070.017.986-7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv ] <named_as> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which newspaper has an Alexa rank of 112.0 and an official website of https://www.nytimes.com/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.nytimes.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <applies_to_jurisdiction> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the cemetery with 400,000 graves and an official website of http://www.arlingtoncemetery.mil/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <number_of_graves> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"400000.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.arlingtoncemetery.mil/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the newscast with the Twitter username TODAYshow have, if it has 66.0 seasons?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <number_of_seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"66.0\"^^xsd:double . ?e <Twitter_username> ?pv . ?pv <pred:value> \"TODAYshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the number of speakers for Tagalog (the one whose ISO 639-2 code is fil)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Tagalog\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"9e+07\"^^xsd:double . ?e <ISO_639-2_code> ?pv . ?pv <pred:value> \"fil\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISO_639-2_code> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the genre of the book with 357792 OCLC control number and 218.0 number of pages?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <number_of_pages> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"218.0\"^^xsd:double . ?e <OCLC_control_number> ?pv . ?pv <pred:value> \"357792\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OCLC_control_number> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the https://www.target.com website regarding the business with an Alexa rank of 380.0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"380.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.target.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the school with an official website of http://www.wharton.upenn.edu/ and a student count of 4962.0?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4962.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.wharton.upenn.edu/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the award with an Alexa rank of 126668.0 and an official website of http://www.emmys.com/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"126668.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.emmys.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the museum with an official website of https://www.metmuseum.org/ and 5.24e+06 visitors per year?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <visitors_per_year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.24e+06\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.metmuseum.org/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the mapping relation type for the disease with a number of deaths equal to 143000.0 and UMLS CUI equal to C0008354?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <number_of_deaths> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"143000.0\"^^xsd:double . ?e <UMLS_CUI> ?pv . ?pv <pred:value> \"C0008354\" . [ <pred:fact_h> ?e ; <pred:fact_r> <UMLS_CUI> ; <pred:fact_t> ?pv ] <mapping_relation_type> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many humans have 2 children and are associated with the British Museum (person-institution) with a value of 17780?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <number_of_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"17780\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British_Museum_person-institution> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the conservatory with 800.0 students and an official website of http://www.msmnyc.edu?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"800.0\"^^xsd:double . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.msmnyc.edu\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Serbo-Croatian (the one with 7e+06 speakers)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Serbo-Croatian\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"7e+06\"^^xsd:double . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"491.83\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]