[
    {
        "question": "What is the Dewey Decimal Classification of Bandung, which has a population of 2.39487e+06?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Bandung . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.39487e+06\"^^xsd:double . ?e <Dewey Decimal Classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many speakers does Hungarian have and in which country is it spoken?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Hungarian . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.5e+07\"^^xsd:double . ?e <country> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the area of Eugene, which has a population of 137893?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Eugene . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"137893.0\"^^xsd:double . ?e <area> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What award did Bewitched receive and how many episodes did it have (254.0)?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> Bewitched . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"254.0\"^^xsd:double . ?e <award received> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was \"The Crucible\" first performed on January 22, 1953 as a play?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> play . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"The Crucible\" . ?e <date of first performance> ?pv . ?pv <pred:date> \"1953-01-22\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the miniseries with 6 episodes that ended on 1986-12-21 exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> miniseries . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"6.0\" . ?e <end time> ?pv . ?pv <pred:date> \"1986-12-21\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Christianity (the one with ISNI 0000 0004 0508 6616) begin on January 1st, 1957?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> Christianity . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the genre whose official website is http://harvardlampoon.com/ established on January 1st, 1876?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> genre . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://harvardlampoon.com/\" . ?e <inception> ?pv . ?pv <pred:date> \"1876-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a business with an ISNI of 0000 0000 8338 5874 and an inception date of 1887-03-04?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> business . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8338 5874\" . ?e <inception> ?pv . ?pv <pred:date> \"1887-03-04\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the capital, whose Dewey Decimal Classification is 2--43712, known to have the earliest written record on 0965-01-17?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> capital . ?e <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43712\" . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a conservatory with an ISNI of 0000 0001 2189 390X that was founded on January 1st, 1921?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> conservatory . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2189 390X\" . ?e <inception> ?pv . ?pv <pred:date> \"1921-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a film with a duration of 98.0 and a publication date of 2001-08-16?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> film . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"98.0\" . ?e <publication date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Ghost published in Germany on October 11, 1990?",
        "sparql": "ASK { ?e <pred:name> Ghost . ?e <publication date> ?pv . ?pv <pred:date> \"1990-10-11\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Moldavia's inception date a statement with Gregorian date earlier than 1584?",
        "sparql": "ASK { ?e <pred:name> Moldavia . ?e <inception> ?pv . ?pv <pred:date> \"1346-01-01\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv ] <instance of> ?qpv . ?qpv <pred:value> \"statement with Gregorian date earlier than 1584\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the book named \"Big\" published in Germany on 1988-09-29?",
        "sparql": "ASK { ?e <pred:name> Big . ?e <publication date> ?pv . ?pv <pred:date> \"1988-09-29\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Jarhead published in Germany on 2006-01-05?",
        "sparql": "ASK { ?e <pred:name> Jarhead . ?e <publication date> ?pv . ?pv <pred:date> \"2006-01-05\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Sideways published in Germany on 2005-02-03?",
        "sparql": "ASK { ?e <pred:name> Sideways . ?e <publication date> ?pv . ?pv <pred:date> \"2005-02-03\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Halloween published in the United States of America on 2018-10-19?",
        "sparql": "ASK { ?e <pred:name> Halloween . ?e <publication date> ?pv . ?pv <pred:date> \"2018-10-19\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"United States of America\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Assassins published in Germany on October 26, 1995?",
        "sparql": "ASK { ?e <pred:name> Assassins . ?e <publication date> ?pv . ?pv <pred:date> \"1995-10-26\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Pina published in Germany on 2011-02-24?",
        "sparql": "ASK { ?e <pred:name> Pina . ?e <publication date> ?pv . ?pv <pred:date> \"2011-02-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the publication named Radio published in Germany on May 6th, 2004?",
        "sparql": "ASK { ?e <pred:name> Radio . ?e <publication date> ?pv . ?pv <pred:date> \"2004-05-06\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Lincoln published in Germany on 2013-01-24?",
        "sparql": "ASK { ?e <pred:name> Lincoln . ?e <publication date> ?pv . ?pv <pred:date> \"2013-01-24\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Modesto a city with an inception date of 1870-11-08 and a population of 201165.0?",
        "sparql": "ASK { ?e <pred:name> Modesto . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1870-11-08\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"201165.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Rwanda have a Human Development Index of 0.479 and an inception date of 1962-01-01?",
        "sparql": "ASK { ?e <pred:name> Rwanda . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.479\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Tanzania's Human Development Index 0.5 and was it founded on January 1st, 1964?",
        "sparql": "ASK { ?e <pred:name> Tanzania . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.5\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Valletta a city with an inception date of 1566-01-01 and a population of 6444.0?",
        "sparql": "ASK { ?e <pred:name> Valletta . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1566-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6444.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Montclair a city with an inception date of 1868-04-15 and a population of 37669.0?",
        "sparql": "ASK { ?e <pred:name> Montclair . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1868-04-15\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"37669.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Sony's inception date May 7th, 1946 and do they have an employee with a salary of 128400.0?",
        "sparql": "ASK { ?e <pred:name> Sony . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-05-07\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"128400.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Brittany have 10718 weddings annually starting from 1972-07-09?",
        "sparql": "ASK { ?e <pred:name> Brittany . ?e <start time> ?pv_1 . ?pv_1 <pred:date> \"1972-07-09\"^^xsd:date . ?e <annual number of weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10718.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the TV show Taken end on December 13, 2002 and have 10 episodes with a duration of 10.0?",
        "sparql": "ASK { ?e <pred:name> Taken . ?e <end time> ?pv_1 . ?pv_1 <pred:date> \"2002-12-13\"^^xsd:date . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Mexico's Human Development Index 0.634 and was it founded on August 24th, 1821?",
        "sparql": "ASK { ?e <pred:name> Mexico . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-08-24\"^^xsd:date . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.634\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Wichita 382,368 and was it founded on November 30th, 1868?",
        "sparql": "ASK { ?e <pred:name> Wichita . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1868-11-30\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"382368.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a religion with a population of 3.35271e+06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> religion . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"3.35271e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.35271e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a college with 2023 employees, each with a value of 1?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> college . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2023.0\"^^xsd:double . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2023.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an association with 80 employees, where each employee works 80 hours?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> association . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"80.0\"^^xsd:double . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a state with a Human Development Index of 0.649?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> state . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.649\"^^xsd:double . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.649\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the comedy with 1 season and 25 episodes?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> comedy . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"25.0\"^^xsd:double . ?e <number of seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a landform with a population of 1.1158e+06?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> landform . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.1158e+06\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1158e+06\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a city/town with a population of 758,400?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> city/town . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"758400.0\"^^xsd:double . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"758400.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the college that has an inception date of 1876 founded?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> college . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1876-01-01\"^^xsd:date . ?e <inception> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did the governor position start and end (if applicable) with an inception date of 1792-06-04?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> governor . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1792-06-04\"^^xsd:date . ?e <inception> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the date of birth for the human born on 1981-03-24?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> human . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1981-03-24\"^^xsd:date . ?e <date of birth> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the inception date of the agent that was established on 1851-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> agent . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1851-01-01\"^^xsd:date . ?e <inception> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the inception date of the sound instance that was created on 1990-01-01?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> sound . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-01-01\"^^xsd:date . ?e <inception> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When was the horse born whose date of birth is 1970-01-28?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> horse . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1970-01-28\"^^xsd:date . ?e <date of birth> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the movie Rambo and the character Rambo?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rambo\" . ?e_2 <pred:name> Rambo . ?e_2 <title> ?pv . ?pv <pred:value> Rambo . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Jean-Michel Jarre and Lyon (the one with an official name of Lyon)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Jean-Michel Jarre\" . ?e_2 <pred:name> Lyon . ?e_2 <official name> ?pv . ?pv <pred:value> Lyon . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Dutchess County and Poughkeepsie (the one whose native label is Poughkeepsie)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dutchess County\" . ?e_2 <pred:name> Poughkeepsie . ?e_2 <native label> ?pv . ?pv <pred:value> Poughkeepsie . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Detroit and Nassau (the one whose native label is Nassau)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Detroit\" . ?e_2 <pred:name> Nassau . ?e_2 <native label> ?pv . ?pv <pred:value> Nassau . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between NBCUniversal and CNBC (the one with Twitter username CNBC)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"NBCUniversal\" . ?e_2 <pred:name> CNBC . ?e_2 <Twitter username> ?pv . ?pv <pred:value> CNBC . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Fritz Lang and the film Metropolis?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fritz Lang\" . ?e_2 <pred:name> Metropolis . ?e_2 <title> ?pv . ?pv <pred:value> Metropolis . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]