[{"question": "When did jazz music start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"jazz\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did disco start?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Perth?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Perth\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"NO115235\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the DiseasesDB ID for anemia?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"anemia\" . ?e <DiseasesDB> ?pv_1 . ?pv_1 <pred:value> \"663\" . ?e <DiseasesDB> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the short name for the captain (the one whose short name is \"kpt.\")?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"captain\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"kpt.\" . ?e <short_name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of a physicist with a value of 530.092?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"physicist\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"530.092\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the Renaissance (the one with ISNI 0000 0001 1089 9660)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Renaissance\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1089 9660\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Vicenza (the one with Dewey Decimal Classification 2--45351)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vicenza\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--45351\" . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Pas-de-Calais?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Pas-de-Calais\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--44272\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CAS Registry Number of cryptoxanthin (the one with CAS Registry Number 472-70-8)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"cryptoxanthin\" . ?e <CAS_Registry_Number> ?pv_1 . ?pv_1 <pred:value> \"472-70-8\" . ?e <CAS_Registry_Number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Vanuatu?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vanuatu\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"NH\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Islington?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Islington\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ315844\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for the entity named \"Seal\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Seal\" . ?e <Giphy_username> ?pv_1 . ?pv_1 <pred:value> \"seal\" . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the China administrative division code for Shandong?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Shandong\" . ?e <China_administrative_division_code> ?pv_1 . ?pv_1 <pred:value> \"37\" . ?e <China_administrative_division_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Classification of Instructional Programs code for statistics?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"statistics\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"27.05\" . ?e <Classification_of_Instructional_Programs_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Ayr?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ayr\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"NS338214\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Where is Cubism located in the administrative territorial entity?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cubism\" . ?e <Artsy_gene> ?pv_1 . ?pv_1 <pred:value> \"cubism\" . ?e <located_in_the_administrative_territorial_entity> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution value for McDonald's (the one with a value of 183995)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"McDonald's\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"183995\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Swedish urban area code for Helsingborg?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Helsingborg\" . ?e <Swedish_urban_area_code> ?pv_1 . ?pv_1 <pred:value> \"T3452\" . ?e <Swedish_urban_area_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Where was Pigface formed (the one with ISNI 0000 0001 1526 7873)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Pigface\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1526 7873\" . ?e <location_of_formation> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Copenhagen (the one with Danish urban area code 01100)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Copenhagen\" . ?e <Danish_urban_area_code> ?pv_1 . ?pv_1 <pred:value> \"01100\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Uruguay?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Uruguay\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--895\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Madrid?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Madrid\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4641\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of the movie Platoon?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Platoon\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a1200943x\" . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Tours?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tours\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--44545\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the movie Cinderella?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cinderella\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Cinderella\" . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Ethnologue.com language code for Cherokee?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cherokee\" . ?e <Ethnologue.com_language_code> ?pv_1 . ?pv_1 <pred:value> \"chr\" . ?e <Ethnologue.com_language_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Petersburg (the one with a value of 2--755581)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Petersburg\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--755581\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Busan (the one with FIPS 10-4 code KS10)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Busan\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"KS10\" . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Irvine?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Irvine\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"NS325395\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of citizenship for Sukumari (the one with the official website http://sukumari.com)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sukumari\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://sukumari.com\" . ?e <country_of_citizenship> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Vallejo?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vallejo\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79452\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Brazil?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brazil\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--81\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Wigan?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wigan\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"SD583055\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IAB code for cycling?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"cycling\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"492\" . ?e <pred:instance_of> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPI name number of Prince (the one with IPI name number 00045620792)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Prince\" . ?e <IPI_name_number> ?pv_1 . ?pv_1 <pred:value> \"00045620792\" . ?e <IPI_name_number> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Salzburg?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Salzburg\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4363\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Maine?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Maine\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--741\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Riga?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Riga\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4796\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Isfahan?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Isfahan\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--5595\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Mecca?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mecca\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--538\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution value for Uganda (the one whose British Museum person-institution value is 187834)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Uganda\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"187834\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Austria?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Austria\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--436\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Uzbekistan?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Uzbekistan\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--587\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Caverphone code for Charlotte (the one with a Caverphone code of KLT111)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Charlotte\" . ?e <Caverphone> ?pv_1 . ?pv_1 <pred:value> \"KLT111\" . ?e <Caverphone> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Illinois?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Illinois\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--773\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode for poverty?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"poverty\" . ?e <IPTC_Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000801\" . ?e <pred:name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the part that has the sRGB color hex triplet of FFFFFF and is called white?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"white\" . ?e <sRGB_color_hex_triplet> ?pv_1 . ?pv_1 <pred:value> \"FFFFFF\" . ?e <has_part> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the LAU code for Waterford?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Waterford\" . ?e <LAU> ?pv_1 . ?pv_1 <pred:value> \"IE02404\" . ?e <LAU> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username for the TV show Seinfeld?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Seinfeld\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"SeinfeldTV\" . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of Bangalore?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bangalore\" . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"2295420\" . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Boulogne-Billancourt?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Boulogne-Billancourt\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--44364\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Waukegan?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Waukegan\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--77321\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution value for Armenia (the one whose British Museum person-institution value is 165802)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Armenia\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"165802\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Rosario?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rosario\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--8224\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Aargau?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aargau\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--49456\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Geneva?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Geneva\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--494516\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Lyon?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lyon\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--445823\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Newburgh?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Newburgh\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--74731\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the name of the choir with Iconclass notation 48C7552?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"choir\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"48C7552\" . ?e <pred:name> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of LucasArts (the one with ISNI 0000 0004 1476 5266)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"LucasArts\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 1476 5266\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Neymar's position played on team/speciality (the one whose CANTIC-ID is a11843871)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Neymar\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11843871\" . ?e <position_played_on_team_/_speciality> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Augsburg (the one with Dewey Decimal Classification 2--43375)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Augsburg\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--43375\" . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution value for Chihuahua (the one whose British Museum person-institution value is 107484)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chihuahua\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"107484\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OS grid reference for Hove?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hove\" . ?e <OS_grid_reference> ?pv_1 . ?pv_1 <pred:value> \"TQ285055\" . ?e <OS_grid_reference> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Paraguay?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Paraguay\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--892\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Bradford?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bradford\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--42817\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Sonora?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sonora\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--7217\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Stack Exchange tag for neuroscience?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"neuroscience\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://psychology.stackexchange.com/tags/neuroscience\" . ?e <Stack_Exchange_tag> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Fremont?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fremont\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--79465\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Rajinikanth (the one with ISNI 0000 0001 1953 0341)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rajinikanth\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1953 0341\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Lille?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lille\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--44284\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Utrecht?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Utrecht\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--49232\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Aude (the one with ISNI 0000 0000 7408 0673)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aude\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 7408 0673\" . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution value for Yemen?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Yemen\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"162332\" . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username of Cleopatra (the one with the Twitter username CleopatraRecord)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cleopatra\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"CleopatraRecord\" . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the GSS code (2011) for Aylesbury?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aylesbury\" . ?e <GSS_code_(2011)> ?pv_1 . ?pv_1 <pred:value> \"E04001559\" . ?e <GSS_code_(2011)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Barbados?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Barbados\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--72981\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label for philanthropy?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"philanthropy\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"philanthr\u00f4p\u00eda\" . ?e <pred:instance_of> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]