[{"question": "What is the area of Pleasantville (the one whose inception date is 1889-01-10)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Pleasantville\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1889-01-10\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Mississippi (which was established on 1817-12-10)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Mississippi\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1817-12-10\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Kajol (the one born on 1975-08-05)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kajol\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1975-08-05\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Karnataka (which was established on 1956-11-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Karnataka\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-11-01\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the person named Houston (the one born on 1983-10-26)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Houston\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1983-10-26\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Bernie receive on 2011-06-16?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bernie\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-06-16\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of the Bahamas (the one born on 1981-04-28)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bahamas\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1981-04-28\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the show Girls (published on 2007-02-02)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Girls\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-02-02\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of citizenship for Nancy (the one born on 2000-04-13)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nancy\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"2000-04-13\"^^xsd:date . ?e <country_of_citizenship> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What work did Goldfinger come after (the one published on 1964-09-17)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Goldfinger\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1964-09-17\"^^xsd:date . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Indonesia (which was established on 1945-08-17)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Indonesia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1945-08-17\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What work does Frost/Nixon come after (the one published on 2009-01-29)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Frost/Nixon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-01-29\"^^xsd:date . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the color of Cleopatra (the one published in 1917-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cleopatra\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1917-01-01\"^^xsd:date . ?e <color> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Tupelo (the one whose inception date is 1870-07-20)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tupelo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1870-07-20\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What conflict is associated with Axis (the one dissolved, abolished, or demolished on 1945-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Axis\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1945-01-01\"^^xsd:date . ?e <conflict> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the distribution of the book Eragon (published on 2006-11-14)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Eragon\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-11-14\"^^xsd:date . ?e <distribution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Zambia (the one whose inception date is 1964-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Zambia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Fringe (the one that ended on 2013-01-18)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fringe\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2013-01-18\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Ghostbusters (published on 1985-01-25)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ghostbusters\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1985-01-25\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Cranford receive on 2007-12-16?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cranford\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2007-12-16\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Austria-Hungary (the one dissolved, abolished or demolished on 1918-10-29)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Austria-Hungary\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1918-10-29\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Transylvania (published on 2006-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Transylvania\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Cliffhanger\" released on July 2, 1993?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cliffhanger\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1993-07-02\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username of T-Pain (the one born on 1985-09-30)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"T-Pain\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1985-09-30\"^^xsd:date . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member of Cuba (the one published on 1979-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cuba\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1979-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Click\" released on June 22, 2006?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Click\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2006-06-22\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the movie \"Rhinestone\" receive (published on 1984-06-22)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rhinestone\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1984-06-22\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the person associated with the British Museum institution in Massachusetts (which was established on 1788-02-06)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Massachusetts\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-02-06\"^^xsd:date . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Somalia (the one whose inception date is 1960-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Somalia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Election\" released on April 23, 1999?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Election\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1999-04-23\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Nebraska (which was established on 1867-03-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Nebraska\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-03-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the publication date of the collection that includes Sarajevo (the one published in 1940-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sarajevo\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1940-01-01\"^^xsd:date . ?e <collection> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What country is UPN from (the one that was established on 1995-01-16)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"UPN\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-16\"^^xsd:date . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Kaunas (the one whose inception date is 1361-11-30)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kaunas\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1361-11-30\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"1941\" (published on 1979-12-13)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"1941\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1979-12-13\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is Neymar's position played on team/speciality?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Neymar\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1992-02-05\"^^xsd:date . ?e <position_played_on_team_/_speciality> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Rugrats (published on 2003-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rugrats\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2003-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Showgirls (released on 1996-01-25)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Showgirls\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1996-01-25\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the band Styx (the one with a date of first performance of 2018-02-16)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Styx\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"2018-02-16\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What country is the book \"Killers\" published in (published on 2014-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Killers\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2014-01-01\"^^xsd:date . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Prague (the one with the time of earliest written record on 0965-01-17)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Prague\" . ?e <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"0965-01-17\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did Agora receive on 2010-03-11?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Agora\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-03-11\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Potsdam (the one with the time of earliest written record on 0993-07-03)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Potsdam\" . ?e <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"0993-07-03\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Nintendo GameID for the game G-Force, which was published on 2009-07-21?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"G-Force\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2009-07-21\"^^xsd:date . ?e <Nintendo_GameID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the music genre Cowpunk (which was created on 1982-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Cowpunk\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1982-01-01\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Austria (the one whose inception date is 1918-11-12)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Austria\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-11-12\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of the movie Vertigo (published on 1958-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vertigo\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1958-01-01\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Poland (the one whose inception date is 1918-11-11)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Poland\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-11-11\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What country was Jaleco dissolved, abolished, or demolished in (on 2014-05-21)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Jaleco\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2014-05-21\"^^xsd:date . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Maine (the one whose inception date is 1820-03-15)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Maine\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1820-03-15\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member of Emma (the one whose end time is 2009-10-25)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Emma\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2009-10-25\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Sneha (the one born on 1981-10-12)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sneha\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1981-10-12\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Paramaribo (which was established on 1603-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Paramaribo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1603-01-01\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of citizenship of Brahmanandam (the one born on 1956-02-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Brahmanandam\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1956-02-01\"^^xsd:date . ?e <country_of_citizenship> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who was a cast member of Somerset until December 31, 1976?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Somerset\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1976-12-31\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Vaucluse (which was established on 1793-06-25)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Vaucluse\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1793-06-25\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for Quadrophenia (published on 1973-10-19)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Quadrophenia\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1973-10-19\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of Adele (the one born on 1988-05-05)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Adele\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1988-05-05\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie Tombstone (published on 1993-12-24)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tombstone\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1993-12-24\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Somme (the one whose inception date is 1790-03-04)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Somme\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-03-04\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the GSS code (2011) for Barrow-in-Furness (which was established on 1974-04-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Barrow-in-Furness\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e <GSS_code_(2011)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Howl\" released on January 1, 2010?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Howl\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of Olympia (the one that officially opened on 1898-07-31)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Olympia\" . ?e <date_of_official_opening> ?pv_1 . ?pv_1 <pred:date> \"1898-07-31\"^^xsd:date . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of origin for the Western published on 2017-08-24?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Western\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2017-08-24\"^^xsd:date . ?e <country_of_origin> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the British Museum person-institution for Washington (the one whose inception date is 1889-11-11)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Washington\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1889-11-11\"^^xsd:date . ?e <British_Museum_person-institution> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Bayonne (the one whose inception date is 1861-04-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bayonne\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1861-04-01\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of Tennessee (the one whose inception date is 1796-06-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tennessee\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1796-06-01\"^^xsd:date . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What award did the book \"Bird\" receive (published on 1988-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bird\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1988-01-01\"^^xsd:date . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What work does Thunderball come after (the one published on 1965-12-09)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Thunderball\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1965-12-09\"^^xsd:date . ?e <after_a_work_by> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ACM Classification Code (2012) for Hewlett-Packard (the one dissolved, abolished or demolished on 2015-11-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hewlett-Packard\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2015-11-01\"^^xsd:date . ?e <ACM_Classification_Code_(2012)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the ISNI of Ne-Yo (the one born on 1979-10-18)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ne-Yo\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1979-10-18\"^^xsd:date . ?e <ISNI> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Giphy username for Ubisoft (the one founded on 1986-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Ubisoft\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1986-01-01\"^^xsd:date . ?e <Giphy_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Wellington (the one with an inception date of 1839-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Wellington\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1839-01-01\"^^xsd:date . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of Spartacus (published on 2004-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Spartacus\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2004-01-01\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Rostock (the one whose inception date is 1201-01-01)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rostock\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1201-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"Antichrist\" that was published on 2010-11-18?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Antichrist\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2010-11-18\"^^xsd:date . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Montevideo (which was founded on 1726-12-24)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Montevideo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1726-12-24\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]