[
    {
        "question": "Did the aircraft functional class with the first flight on 1969-02-09 have another first flight on the same date?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <first flight> ?pv_1 . ?pv_1 <pred:date> \"1969-02-09\"^^xsd:date . ?e <first flight> ?pv . ?pv <pred:date> \"1969-02-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States was founded on 1630-09-07 and has an elevation above sea level of 43.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"43.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is the human born on 1931-09-21 and has a Munzinger IBA value of 00000016518?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of birth> ?pv . ?pv <pred:date> \"1931-09-21\"^^xsd:date . ?e <Munzinger IBA> ?pv_1 . ?pv_1 <pred:value> \"00000016518\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film was published on 2008-01-01 and has a duration of 160.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv . ?pv <pred:date> \"2008-01-01\"^^xsd:date . ?e <duration> ?pv_1 . ?pv_1 <pred:value> \"160.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What theatrical genre ended on 1968-03-25 and had 58 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <end time> ?pv . ?pv <pred:date> \"1968-03-25\"^^xsd:date . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:value> \"58.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which Academy Awards ceremony had an edition number of 40 and took place on April 10th, 1968?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <point in time> ?pv . ?pv <pred:date> \"1968-04-10\"^^xsd:date . ?e <edition number> ?pv_1 . ?pv_1 <pred:value> \"40\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which video game console model was discontinued on 2013-01-04 and had a price of 299.99?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game console model\" . ?e <discontinued date> ?pv . ?pv <pred:date> \"2013-01-04\"^^xsd:date . ?e <price> ?pv_1 . ?pv_1 <pred:value> \"299.99\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital city with a time of earliest written record of 0965-01-17 and a LAU code of CZ554782?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <time of earliest written record> ?pv . ?pv <pred:date> \"0965-01-17\"^^xsd:date . ?e <LAU> ?pv_1 . ?pv_1 <pred:value> \"CZ554782\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the U.S. city with a population of 31302.0 and a subreddit of PortHuron?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"31302.0\"^^xsd:double . ?e <subreddit> ?pv . ?pv <pred:value> \"PortHuron\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is the human who died on 1849-06-15 and had less than 4 children?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of death> ?pv . ?pv <pred:date> \"1849-06-15\"^^xsd:date . ?e <number of children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the capital city whose inception date is 1911-01-01 and has a rural population less than arg4?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <inception> ?pv . ?pv <pred:date> \"1911-01-01\"^^xsd:date . ?e <rural population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What miniseries ended on 2002-12-13 and had less than 4 seasons?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <end time> ?pv . ?pv <pred:date> \"2002-12-13\"^^xsd:date . ?e <number of seasons> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which suspension bridge has an official opening date of 1937-05-27 and less than one span?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"suspension bridge\" . ?e <date of official opening> ?pv . ?pv <pred:date> \"1937-05-27\"^^xsd:date . ?e <number of spans> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v < \"arg4\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one whose inception is 1960-01-01) and Ivory Coast (the one whose Human Development Index is 0.458)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:value> \"0.458\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What metropolitan area had a population greater than arg1 on January 1st, 2014?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film had an attendance greater than arg1 and ended on 2018-05-30?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv ] <end time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of the metropolitan area equal to 6.155e+06 and is this also the value of the population?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6.155e+06\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.155e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6.155e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a city in the United States with an elevation above sea level of 184.0 and a population greater than arg6?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <elevation above sea level> ?pv_1 . ?pv_1 <pred:value> \"184.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <elevation above sea level> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"184.0\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg6\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the British Museum person-institution fact for the Orkney Islands (with FIPS 10-4 code UKV9) in relation to the United Kingdom?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Orkney Islands\" . ?e_1 <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"UKV9\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_2 <British Museum person-institution> ?pv_1 . ?pv_1 <pred:value> \"104611\" . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Boston (the one whose inception is 1630-09-07) twin with Barcelona (the one whose Dewey Decimal Classification is 2--4672)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Boston\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1630-09-07\"^^xsd:date . ?e_2 <pred:name> \"Barcelona\" . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--4672\" . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Utah (the one with Dewey Decimal Classification of 2--792) and the subreddit snowboarding?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Utah\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--792\" . ?e_2 <pred:name> \"snowboarding\" . ?e_2 <subreddit> ?pv_1 . ?pv_1 <pred:value> \"snowboarding\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Ultimate Fighter (which has 27 seasons) and Spike TV (whose official name is Spike TV)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Ultimate Fighter\" . ?e_1 <number of seasons> ?pv . ?pv <pred:value> \"27.0\" . ?e_2 <pred:name> \"Spike TV\" . ?e_2 <official name> ?pv_1 . ?pv_1 <pred:value> \"Spike TV\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Theofanis Gekas (whose height is 179.0) and FC Sion (the one with a native label of \"FC Sion\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Theofanis Gekas\" . ?e_1 <height> ?pv . ?pv <pred:value> \"179.0\" . ?e_2 <pred:name> \"FC Sion\" . ?e_2 <native label> ?pv_1 . ?pv_1 <pred:value> \"FC Sion\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between The Little Mermaid (the one with a cost of 4e+07) and The Little Mermaid (the one with a title of \"The Little Mermaid\")?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"The Little Mermaid\" . ?e_1 <cost> ?pv . ?pv <pred:value> \"4e+07\" . ?e_2 <pred:name> \"The Little Mermaid\" . ?e_2 <title> ?pv_1 . ?pv_1 <pred:value> \"The Little Mermaid\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between NBCUniversal (with an Alexa rank of 134355.0) and Telemundo (with a Twitter username of Telemundo)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"NBCUniversal\" . ?e_1 <Alexa rank> ?pv . ?pv <pred:value> \"134355.0\" . ?e_2 <pred:name> \"Telemundo\" . ?e_2 <Twitter username> ?pv_1 . ?pv_1 <pred:value> \"Telemundo\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which sovereign state has a Human Development Index less than arg1 and a value of 0.39?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.39\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a human with less than arg1 children and also has 2 children?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <number of children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which theatrical genre has less than arg1 seasons and 58.0 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"theatrical genre\" . ?e <number of seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"58.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which inner planet has a flattening less than arg1 and an orbital eccentricity of 0.0933941?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"inner planet\" . ?e <flattening> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <orbital eccentricity> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.0933941\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which disease has less than arg1 number of cases and 5e+08 cases?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <number of cases> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <number of cases> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which higher education institution has an admission rate less than arg1 and an admission rate of 0.42?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"higher education institution\" . ?e <admission rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg1\"^^xsd:double ) . ?e <admission rate> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.42\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What character did Larry Hagman play in Dallas (the one that ended on 1991-05-03)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dallas\" . ?e_1 <end time> ?pv . ?pv <pred:date> \"1991-05-03\"^^xsd:date . ?e_2 <pred:name> \"Larry Hagman\" . ?e_1 <cast member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast member> ; <pred:fact_t> ?e_2 ] <character role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What political party was John McCain a member of during the United States presidential election in 2008 (which took place on November 4th)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"United States presidential election, 2008\" . ?e_1 <point in time> ?pv . ?pv <pred:date> \"2008-11-04\"^^xsd:date . ?e_2 <pred:name> \"John McCain\" . ?e_1 <candidate> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <candidate> ; <pred:fact_t> ?e_2 ] <member of political party> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the source material for the movie V for Vendetta?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"V for Vendetta\" . ?e_2 <pred:name> \"V for Vendetta\" . ?e_1 <based on> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <based on> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Fred Astaire have a name in native language equal to Fred Astaire and two children?",
        "sparql": "ASK { ?e <pred:name> \"Fred Astaire\" . ?e <name in native language> ?pv_1 . ?pv_1 <pred:value> \"Fred Astaire\" . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Stuttgart have a Twitter hashtag of \"Stuttgart\" and a population of 592569.0?",
        "sparql": "ASK { ?e <pred:name> \"Stuttgart\" . ?e <Twitter hashtag> ?pv_1 . ?pv_1 <pred:value> \"Stuttgart\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"592569.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cameroon have a subreddit named Cameroon and a Human Development Index of 0.436?",
        "sparql": "ASK { ?e <pred:name> \"Cameroon\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Cameroon\" . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.436\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Harry Potter and the Goblet of Fire earn 896,911,000 dollars at the box office?",
        "sparql": "ASK { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Harry Potter and the Goblet of Fire\" . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"Fred Astaire\" the name in native language of Fred Astaire?",
        "sparql": "ASK { ?e <pred:name> \"Fred Astaire\" . ?e <name in native language> ?pv . ?pv <pred:value> \"Fred Astaire\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Stuttgart have a Twitter hashtag of #Stuttgart?",
        "sparql": "ASK { ?e <pred:name> \"Stuttgart\" . ?e <Twitter hashtag> ?pv . ?pv <pred:value> \"Stuttgart\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cameroon have a subreddit with the same name?",
        "sparql": "ASK { ?e <pred:name> \"Cameroon\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Cameroon\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is John Quincy Adams's birth name also John Quincy Adams?",
        "sparql": "ASK { ?e <pred:name> \"John Quincy Adams\" . ?e <birth name> ?pv . ?pv <pred:value> \"John Quincy Adams\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the name \"Norman\" have an entry in the Dictionary of Medieval Names from European Sources?",
        "sparql": "ASK { ?e <pred:name> \"Norman\" . ?e <Dictionary of Medieval Names from European Sources entry> ?pv . ?pv <pred:value> \"Norman\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Grey DeLisle have a married name that is the same as her original name?",
        "sparql": "ASK { ?e <pred:name> \"Grey DeLisle\" . ?e <married name> ?pv . ?pv <pred:value> \"Grey DeLisle\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is \"espionage\" a Wikitribune category for espionage?",
        "sparql": "ASK { ?e <pred:name> \"espionage\" . ?e <Wikitribune category> ?pv . ?pv <pred:value> \"espionage\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does KLM have an ICAO airline designator of KLM?",
        "sparql": "ASK { ?e <pred:name> \"KLM\" . ?e <ICAO airline designator> ?pv . ?pv <pred:value> \"KLM\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a Debian stable package named anarchism related to anarchism?",
        "sparql": "ASK { ?e <pred:name> \"anarchism\" . ?e <Debian stable package> ?pv . ?pv <pred:value> \"anarchism\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]