[
    {
        "question": "How many agents have more than one employee?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many organizations have more than arg1 subscribers?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <number of subscribers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many universities have more than arg1 students?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <students count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "How many political parties have a member count greater than a certain value (arg1)?",
        "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"political party\" . ?e <member count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon (the one with Dewey Decimal Classification of 2--6711) and Cameroon (the one with a Human Development Index of 0.436)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6711\" . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.436\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the book and the movie titled Harry Potter and the Goblet of Fire (the book has an ISBN-10 of 0-7475-4624-X and the movie's box office revenue is 8.96911e+08)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_1 <ISBN-10> ?pv . ?pv <pred:value> \"0-7475-4624-X\" . ?e_2 <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e_2 <box office> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8.96911e+08\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has a population of 25514 and an area of 37.5618?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv . ?pv <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25514.0\"^^xsd:double . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"37.5618\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the point in time when the metropolitan area with a population of 6.155e+06 had that population?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan area\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.155e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv_1 . ?qpv_1 <pred:value> \"6.155e+06\" . ?e <population> ?pv . ?pv <pred:value> \"6.155e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city of the United States has a population greater than arg1 and a population of 25514.0, and what is the fact t value for this population?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg1\"^^xsd:double ) . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"25514.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"25514.0\"^^xsd:double .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did Ayn Rand have less than three children and use the pseudonym Ayn Rand?",
        "sparql": "ASK { ?e <pred:name> \"Ayn Rand\" . ?e <pseudonym> ?pv_1 . ?pv_1 <pred:value> \"Ayn Rand\" . ?e <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of Erlangen, whose official name is also Erlangen and is less than arg3?",
        "sparql": "ASK { ?e <pred:name> \"Erlangen\" . ?e <official name> ?pv_1 . ?pv_1 <pred:value> \"Erlangen\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Latin have a short name of Latin and less than arg3 speakers?",
        "sparql": "ASK { ?e <pred:name> \"Latin\" . ?e <short name> ?pv_1 . ?pv_1 <pred:value> \"Latin\" . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Cameroon have a subreddit named Cameroon and a Human Development Index value less than arg3?",
        "sparql": "ASK { ?e <pred:name> \"Cameroon\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Cameroon\" . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does McGill University have a native label equal to \"McGill University\" and an admission rate less than arg3?",
        "sparql": "ASK { ?e <pred:name> \"McGill University\" . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"McGill University\" . ?e <admission rate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Did the film, published on 2005-11-16 in Germany and with a box office greater than arg6, exist?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" . ?e <box office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg6\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an administrative territorial entity whose inception date is 1917-03-31, whose criterion used is the Treaty of the Danish West Indies, and whose population is greater than arg6?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"administrative territorial entity\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1917-03-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <inception> ; <pred:fact_t> ?pv_1 ] <criterion used> ?qpv . ?qpv <pred:value> \"Treaty of the Danish West Indies\" . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg6\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was Pan Am the operator of the aircraft functional class that entered service on 1970-01-22 and had a total production number greater than arg6?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <service entry> ?pv_1 . ?pv_1 <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv_1 ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" . ?e <total produced> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v > \"arg6\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film was published on 2001-08-16 in Germany?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication date> ?pv . ?pv <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv ] <place of publication> ?qpv . ?qpv <pred:value> \"Germany\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who died on January 31, 2000 at the age of 73.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date of death> ?pv . ?pv <pred:date> \"2000-01-31\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <date of death> ; <pred:fact_t> ?pv ] <stated age at event> ?qpv . ?qpv <pred:value> \"73.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which aircraft functional class was operated by Pan Am and entered service on 1970-01-22?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"aircraft functional class\" . ?e <service entry> ?pv . ?pv <pred:date> \"1970-01-22\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <service entry> ; <pred:fact_t> ?pv ] <operator> ?qpv . ?qpv <pred:value> \"Pan Am\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What character did Larry Hagman play in the Dallas series with 357.0 episodes?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Dallas\" . ?e_1 <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"357.0\"^^xsd:double . ?e_2 <pred:name> \"Larry Hagman\" . ?e_1 <cast member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast member> ; <pred:fact_t> ?e_2 ] <character role> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the pred:fact h of Monrovia, the capital of Liberia, whose population is 1.02176e+06?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Monrovia\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.02176e+06\"^^xsd:double . ?e_2 <pred:name> \"Liberia\" . ?e_1 <capital of> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital of> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Brad Pitt receive an Academy Award for Best Picture (he has 6 children)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Brad Pitt\" . ?e_1 <number of children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.0\"^^xsd:double . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <award received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award received> ; <pred:fact_t> ?e_2 ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which political party was John McCain a member of during the United States presidential election in 2008, where the eligible voters were 2.13314e+08?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"United States presidential election, 2008\" . ?e_1 <eligible voters> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.13314e+08\"^^xsd:double . ?e_2 <pred:name> \"John McCain\" . ?e_1 <candidate> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <candidate> ; <pred:fact_t> ?e_2 ] <member of political party> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Where was the visual artwork titled \"Get Carter\" published on August 16, 2001?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"visual artwork\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2001-08-16\"^^xsd:date . [ <pred:fact_h> ?e ; <pred:fact_r> <publication date> ; <pred:fact_t> ?pv_1 ] <place of publication> ?qpv_1 . ?qpv_1 <pred:value> \"Germany\" . ?e <title> ?pv . ?pv <pred:value> \"Get Carter\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Cameroon (the one whose inception is 1960-01-01) and Cameroon (the one whose Human Development Index is 0.486)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cameroon\" . ?e_1 <inception> ?pv . ?pv <pred:date> \"1960-01-01\"^^xsd:date . ?e_2 <pred:name> \"Cameroon\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.486\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Vinod Khanna (the one born on 1946-10-06) and Bharatiya Janata Party (the one with 117.0 representatives in an organization/legislature)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Vinod Khanna\" . ?e_1 <date of birth> ?pv . ?pv <pred:date> \"1946-10-06\"^^xsd:date . ?e_2 <pred:name> \"Bharatiya Janata Party\" . ?e_2 <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"117.0\"^^xsd:double . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the FIPS 10-4 code for Orkney Islands and what is the Human Development Index of the United Kingdom (whose country is Orkney Islands)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Orkney Islands\" . ?e_1 <FIPS 10-4 (countries and regions)> ?pv . ?pv <pred:value> \"UKV9\" . ?e_2 <pred:name> \"United Kingdom\" . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.901\"^^xsd:double . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ivory Coast (the one with Dewey Decimal Classification of 2--6668) and Ivory Coast (also with Dewey Decimal Classification of 2--6668)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ivory Coast\" . ?e_1 <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6668\" . ?e_2 <pred:name> \"Ivory Coast\" . ?e_2 <Dewey Decimal Classification> ?pv_1 . ?pv_1 <pred:value> \"2--6668\" . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which first-level administrative country subdivision has one representative in an organization/legislature with a value of 135.0 and another representative with a value greater than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"first-level administrative country subdivision\" . ?e <number of representatives in an organization/legislature> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"135.0\"^^xsd:double . ?e <number of representatives in an organization/legislature> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which Primetime Emmy Award has an Alexa rank greater than arg3 and a rank of 126668.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Primetime Emmy Award\" . ?e <Alexa rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"126668.0\"^^xsd:double . ?e <Alexa rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which film has an attendance of 2.39375e+06 and a higher attendance than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.39375e+06\"^^xsd:double . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which facility has a collection or exhibition size of 460000.0 and another collection or exhibition size greater than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <collection or exhibition size> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"460000.0\"^^xsd:double . ?e <collection or exhibition size> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which video game publisher has 848 employees and more employees than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"video game publisher\" . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"848.0\"^^xsd:double . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What recurring event has eligible voters of 2.13314e+08 and another eligible voters value greater than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"recurring event\" . ?e <eligible voters> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.13314e+08\"^^xsd:double . ?e <eligible voters> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which city in the United States has a female population of 31869 and a female population greater than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <female population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"31869.0\"^^xsd:double . ?e <female population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which real property has 102.0 floors above ground and more than arg3 floors above ground?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"real property\" . ?e <floors above ground> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"102.0\"^^xsd:double . ?e <floors above ground> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which disease has more than 2e+07 cases and has a number of cases greater than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <number of cases> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2e+07\"^^xsd:double . ?e <number of cases> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which metropolitan borough has 88250 households and a number of households greater than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolitan borough\" . ?e <number of households> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"88250.0\"^^xsd:double . ?e <number of households> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which anthology has 156 episodes and more than arg3 episodes?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"156.0\"^^xsd:double . ?e <number of episodes> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which Summer Olympic Games had more than arg3 participants (where arg3 is a variable that needs to be replaced with a specific number)?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Summer Olympic Games\" . ?e <number of participants> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10768.0\"^^xsd:double . ?e <number of participants> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]