[{"question": "What award did the movie Sayonara receive?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Sayonara\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Sayonara\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Berkeley?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Berkeley\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Berkeley\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What awards has the TV show ER received?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"ER\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"ER\" . ?e <award_received> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of Waltham?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Waltham\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Waltham\" . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Kent (the one with an official name of Kent)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Kent\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Kent\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the UN/LOCODE of Rockville?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Rockville\" . ?e <name> ?pv_1 . ?pv_1 <pred:value> \"Rockville\" . ?e <UN/LOCODE> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of Dhaka (the one with a subreddit named Dhaka)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Dhaka\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Dhaka\" . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is a cast member in the movie \"Hoffa\" and also has the title \"Hoffa\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hoffa\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hoffa\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the IPTC Newscode for the topic of racism in PhilPapers?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"racism\" . ?e <PhilPapers_topic> ?pv_1 . ?pv_1 <pred:value> \"racism\" . ?e <IPTC_Newscode> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who are the cast members of the movie \"EDtv\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"EDtv\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"EDtv\" . ?e <cast_member> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the FIPS 10-4 code for Aberdeen (the one with a native label of Aberdeen)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aberdeen\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Aberdeen\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Caverphone code for Aurora (the one with a native label of Aurora)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Aurora\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Aurora\" . ?e <Caverphone> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who composed the title \"Earth\" for Earth?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Earth\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Earth\" . ?e <composer> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username for the movie Avatar?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Avatar\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Avatar\" . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Louisville (the one with a native label of Louisville)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Louisville\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Louisville\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Suriname (the one with subreddit Suriname)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Suriname\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Suriname\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of \u0130zmir (the one with a native label of \u0130zmir)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"\u0130zmir\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"\u0130zmir\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the CANTIC-ID of Tennessee (the one with a subreddit value of \"Tennessee\")?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Tennessee\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Tennessee\" . ?e <CANTIC-ID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the box office revenue of the movie \"Apocalypto\"?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Apocalypto\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Apocalypto\" . ?e <box_office> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification for Boston?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Boston\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Boston\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of Toulouse (the one with a Twitter username of Toulouse)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Toulouse\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"Toulouse\" . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the industry of the organization with an Alexa rank of 360.0 on 2017-11-20?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"360.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <industry> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity contained in the democracy that had an annual number of weddings equal to 265404.0 on January 1, 2008?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"265404.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual_number_of_weddings> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2008-01-01\"^^xsd:date . ?e <contains_administrative_territorial_entity> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the LAU code for the town with a population of 344218.0 on January 1, 1970?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"344218.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"1970-01-01\"^^xsd:date . ?e <LAU> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of the island with a population of 469,691 on July 1, 2010?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"469691.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-07-01\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the WOEID of the village with a population of 6323.0 on 2010-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6323.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date . ?e <WOEID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Dewey Decimal Classification of the city/town with a population of 758400.0 on January 1, 2014?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city/town\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"758400.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the administrative territorial entity contained in the republic that had an annual number of weddings of 265404.0 on 2008-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <annual_number_of_weddings> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"265404.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <annual_number_of_weddings> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2008-01-01\"^^xsd:date . ?e <contains_administrative_territorial_entity> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many speakers does the language with an IAB code have on January 1, 2007?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"language\" . ?e <number_of_speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"4.02e+07\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_speakers> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2007-01-01\"^^xsd:date . ?e <IAB_code> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the industry of the agent with an Alexa rank of 360.0 on 2017-11-20?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"360.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <industry> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of the country with a population of 56295.0 on 2014-07-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"56295.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2014-07-01\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What was the population of the neighborhood on January 1, 2010, if the population was 91982.0?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"91982.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-01-01\"^^xsd:date . ?e <population> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the point in time for the newspaper with an Alexa rank of 112.0 on 2017-11-20?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newspaper\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <pred:instance_of> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who composed the film that had an attendance of 8446.0 and ended on 2018-05-30?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <attendance> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"8446.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <attendance> ; <pred:fact_t> ?pv_1 ] <end_time> ?qpv . ?qpv <pred:date> \"2018-05-30\"^^xsd:date . ?e <composer> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many out-of-school children did the state have on January 1, 2001?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <number_of_out-of-school_children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"101331.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_out-of-school_children> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2001-01-01\"^^xsd:date . ?e <continent> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the industry of the business with an Alexa rank of 360.0 on 2017-11-20?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"360.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <industry> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter hashtag for the industry with an Alexa rank of 1.0 on 2017-11-20?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <Twitter_hashtag> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of the award with an Alexa rank of 126668.0 on 2018-01-09?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"126668.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2018-01-09\"^^xsd:date . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the collection or exhibition size of the museum that had 2.9e+06 visitors in 2011-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <visitors_per_year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.9e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors_per_year> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <collection_or_exhibition_size> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Twitter username of the human who had a ranking of 1.0 on 2008-08-18?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ranking> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <ranking> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2008-08-18\"^^xsd:date . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the city with a population of 928850.0 (as of 2014-01-01) established?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"928850.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2014-01-01\"^^xsd:date . ?e <inception> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the country of the software with an Alexa rank of 1.0 on 2017-11-20?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"1.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <country> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many students did the university have on January 12, 2016 (the one with a student count of 17319.0)?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <students_count> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"17319.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <students_count> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2016-01-12\"^^xsd:date . ?e <Twitter_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the area of the landform with a population of 469691.0 on July 1, 2010?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"469691.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2010-07-01\"^^xsd:date . ?e <area> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the Wikimedia username of the foundation with an Alexa rank of 29145.0 on 2017-11-28?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"29145.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-28\"^^xsd:date . ?e <Wikimedia_username> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the collection or exhibition size of the facility that had 2.9e+06 visitors in 2011-01-01?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <visitors_per_year> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"2.9e+06\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <visitors_per_year> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2011-01-01\"^^xsd:date . ?e <collection_or_exhibition_size> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official website of the manifestation with an Alexa rank of 112.0 on 2017-11-20?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <Alexa_rank> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"112.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <Alexa_rank> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-11-20\"^^xsd:date . ?e <official_website> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the PermID of the airline that had 129,424 employees on December 31, 2017?", "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"129424.0\"^^xsd:double . [ <pred:fact_h> ?e ; <pred:fact_r> <employees> ; <pred:fact_t> ?pv_1 ] <point_in_time> ?qpv . ?qpv <pred:date> \"2017-12-31\"^^xsd:date . ?e <PermID> ?pv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which merchant has an Iconclass notation of 48A831?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"merchant\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"48A831\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a CANTIC-ID of a11336638 and is related to Mormonism?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11336638\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which superhero's birth name is Armondo Munoz?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <birth_name> ?pv . ?pv <pred:value> \"Armondo Munoz\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which food has an OKPD2 code of 01.23.13?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"food\" . ?e <OKPD2_code_of_the_good_or_service> ?pv . ?pv <pred:value> \"01.23.13\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an ACM Classification Code (2012) of 10011263 and is a foundation?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10011263\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the Iconclass notation 13A361 and is categorized as \"paranormal\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"paranormal\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"13A361\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which musical has the title \"Sweeney Todd\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <title> ?pv . ?pv <pred:value> \"Sweeney Todd\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the IPTC_Newscode \"mediatopic/20001055\" and is an instance of \"bobsleigh\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"bobsleigh\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20001055\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which symptom has a DiseasesDB ID of 25363?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" . ?e <DiseasesDB> ?pv . ?pv <pred:value> \"25363\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which cemetery has an NRHP reference number of 97000830?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <NRHP_reference_number> ?pv . ?pv <pred:value> \"97000830\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which topic in philosophy is related to the topic \"philosophy-of-mind\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <PhilPapers_topic> ?pv . ?pv <pred:value> \"philosophy-of-mind\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which object has a Hornbostel-Sachs classification of 321.322 and is a guitar?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which organization has an IPTC Newscode of \"mediatopic/20000536\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000536\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which campus has an ISNI of 0000 0001 2150 6738?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2150 6738\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which artist has an ISCO occupation code of 2453?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"artist\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2453\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which disease has an ICD-9-CM code of 729.99?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disease\" . ?e <ICD-9-CM> ?pv . ?pv <pred:value> \"729.99\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which monarch has an IPTC Newscode of mediatopic/20000704?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"monarch\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000704\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which genre has an OLAC video game genre vocabulary of 1069?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <OLAC_video_game_genre_vocabulary> ?pv . ?pv <pred:value> \"1069\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]