[
    {
        "question": "Which modern language has more than 1.10441e+08 speakers and has a number of speakers greater than arg3?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"modern language\" . ?e <number of speakers> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.10441e+08\"^^xsd:double . ?e <number of speakers> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> ?v . FILTER ( ?v > \"arg3\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Twitter username of Trabzonspor and what is the maximum number of players for the association football sport (whose maximum number of players is 22.0) that Trabzonspor is involved in?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Trabzonspor\" . ?e_1 <Twitter username> ?pv . ?pv <pred:value> \"Trabzonspor\" . ?e_2 <pred:name> \"association football\" . ?e_2 <maximum number of players> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"22.0\"^^xsd:double . ?e_1 <sport> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <sport> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What form of government had a nominal GDP of 2.77008e+09 on January 1st, 2004, and a Human Development Index value less than arg6?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"form of government\" . ?e <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"2.77008e+09\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal GDP> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"2004-01-01\"^^xsd:date . ?e <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> ?v . FILTER ( ?v < \"arg6\"^^xsd:double ) .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the city of the United States that has a Twitter username of CityOfBoston and was founded on 1630-09-07?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <Twitter username> ?pv . ?pv <pred:value> \"CityOfBoston\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1630-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is the human born on 1931-09-21 and has an ISNI of 0000 0000 5930 3891?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 5930 3891\" . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1931-09-21\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What film has a duration of 160.0 and was published on 2008-09-07?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv . ?pv <pred:value> \"160.0\" . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2008-09-07\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which Academy Awards ceremony had an edition number of 51 and took place on April 9th, 1979?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Academy Awards ceremony\" . ?e <edition number> ?pv . ?pv <pred:value> \"51\" . ?e <point in time> ?pv_1 . ?pv_1 <pred:date> \"1979-04-09\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which sovereign state has a Dewey Decimal Classification of 2--6711, a nominal GDP of 1.13963e+10, and a point in time of 1992-01-01?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sovereign state\" . ?e <Dewey Decimal Classification> ?pv . ?pv <pred:value> \"2--6711\" . ?e <nominal GDP> ?pv_1 . ?pv_1 <pred:value> \"1.13963e+10\" . [ <pred:fact_h> ?e ; <pred:fact_r> <nominal GDP> ; <pred:fact_t> ?pv_1 ] <point in time> ?qpv . ?qpv <pred:date> \"1992-01-01\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What film has a duration of 120.0 and an exploitation visa number of 54231, with a start time of 1981-05-20?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <duration> ?pv . ?pv <pred:value> \"120.0\" . ?e <exploitation visa number> ?pv_1 . ?pv_1 <pred:value> \"54231\" . [ <pred:fact_h> ?e ; <pred:fact_r> <exploitation visa number> ; <pred:fact_t> ?pv_1 ] <start time> ?qpv . ?qpv <pred:date> \"1981-05-20\"^^xsd:date .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the UN/LOCODE of Lower Hutt?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Lower Hutt\" . ?e <UN/LOCODE> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the number of representatives in an organization/legislature for Bharatiya Janata Party?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Bharatiya Janata Party\" . ?e <number of representatives in an organization/legislature> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the position played on team/speciality of Chris Carter?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Chris Carter\" . ?e <position played on team / speciality> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the British Museum person-institution of Fred Astaire?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Fred Astaire\" . ?e <British Museum person-institution> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Hornbostel-Sachs classification of a bell?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"bell\" . ?e <Hornbostel-Sachs classification> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IPTC Newscode for mechanical engineering?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"mechanical engineering\" . ?e <IPTC Newscode> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the OSM tag or key for a commercial art gallery?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"commercial art gallery\" . ?e <OSM tag or key> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the WOEID of Port Huron?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Port Huron\" . ?e <WOEID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What work is Harry Potter and the Goblet of Fire based on?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Harry Potter and the Goblet of Fire\" . ?e <after a work by> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who is a cast member in the movie Miracle at St. Anna?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Miracle at St. Anna\" . ?e <cast member> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who confers the Academy Award for Best Picture?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Academy Award for Best Picture\" . ?e <conferred by> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the ARCHON code for California State University, Northridge?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"California State University, Northridge\" . ?e <ARCHON code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Giphy username for Hertha BSC?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Hertha BSC\" . ?e <Giphy username> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IMO ship number of Canberra?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Canberra\" . ?e <IMO ship number> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the IPv4 routing prefix for California State University, Long Beach?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"California State University, Long Beach\" . ?e <IPv4 routing prefix> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the PhilPapers topic of heterosexuality?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"heterosexuality\" . ?e <PhilPapers topic> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What are the award disciplines or subjects of the Caldecott Medal?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Caldecott Medal\" . ?e <award disciplines or subjects> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the edition number of the 60th Golden Globe Awards?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"60th Golden Globe Awards\" . ?e <edition number> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Corporate Number (Japan) of SNK?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"SNK\" . ?e <Corporate Number (Japan)> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the DOI prefix for Carleton University?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Carleton University\" . ?e <DOI prefix> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Alexa rank of Target Corporation?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Target Corporation\" . ?e <Alexa rank> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the NSDAP membership number (1925-1945) of Franz Schubert?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Franz Schubert\" . ?e <NSDAP membership number (1925\u20131945> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Nintendo GameID for Guitar Hero III: Legends of Rock?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Guitar Hero III: Legends of Rock\" . ?e <Nintendo GameID> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the field of occupation for an executive producer?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"executive producer\" . ?e <field of this occupation> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Amazon author page for John Grisham?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"John Grisham\" . ?e <Amazon author page> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Statistics Canada Geographic code for Saskatoon?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"Saskatoon\" . ?e <Statistics Canada Geographic code> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who discovered or invented evolution?",
        "sparql": "SELECT DISTINCT ?pv WHERE { ?e <pred:name> \"evolution\" . ?e <discoverer or inventor> ?pv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the city of the United States with UN/LOCODE USCHI the same as the one with UN/LOCODE USCHI?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city of the United States\" . ?e <UN/LOCODE> ?pv_1 . ?pv_1 <pred:value> \"USCHI\" . ?e <UN/LOCODE> ?pv . ?pv <pred:value> \"USCHI\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the agent with ISO 9362 SWIFT/BIC code BOFAUS3N have the same code as its own ISO 9362 SWIFT/BIC code?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <ISO 9362 SWIFT/BIC code> ?pv_1 . ?pv_1 <pred:value> \"BOFAUS3N\" . ?e <ISO 9362 SWIFT/BIC code> ?pv . ?pv <pred:value> \"BOFAUS3N\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the college of the University of Cambridge with an ARCHON code of 2703 also associated with an ARCHON code of 2703?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college of the University of Cambridge\" . ?e <ARCHON code> ?pv_1 . ?pv_1 <pred:value> \"2703\" . ?e <ARCHON code> ?pv . ?pv <pred:value> \"2703\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there an academic discipline with an ACM Classification Code (2012) of 10010178?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"academic discipline\" . ?e <ACM Classification Code (2012)> ?pv_1 . ?pv_1 <pred:value> \"10010178\" . ?e <ACM Classification Code (2012)> ?pv . ?pv <pred:value> \"10010178\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a family name with a Caverphone code of TFS111?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"family name\" . ?e <Caverphone> ?pv_1 . ?pv_1 <pred:value> \"TFS111\" . ?e <Caverphone> ?pv . ?pv <pred:value> \"TFS111\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does the taxon with EPPO Code 1CICHF have the same EPPO Code as its own identifier?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <EPPO Code> ?pv_1 . ?pv_1 <pred:value> \"1CICHF\" . ?e <EPPO Code> ?pv . ?pv <pred:value> \"1CICHF\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is there a national association football team with a FIFA country code of DEN?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"national association football team\" . ?e <FIFA country code> ?pv_1 . ?pv_1 <pred:value> \"DEN\" . ?e <FIFA country code> ?pv . ?pv <pred:value> \"DEN\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the electric piano classified as Hornbostel-Sachs 511?",
        "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"electric piano\" . ?e <Hornbostel-Sachs classification> ?pv_1 . ?pv_1 <pred:value> \"511\" . ?e <Hornbostel-Sachs classification> ?pv . ?pv <pred:value> \"511\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Boston (the one with a population of 617594.0) become a part of the United States of America (which was founded on 1776-07-04)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Boston\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"617594.0\"^^xsd:double . ?e_2 <pred:name> \"United States of America\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1776-07-04\"^^xsd:date . ?e_1 <country> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <country> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Who was the voice actor for Fred Astaire in Top Hat?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Top Hat\" . ?e_2 <pred:name> \"Fred Astaire\" . ?e_1 <cast member> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <cast member> ; <pred:fact_t> ?e_2 ] <voice actor> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Unforgiven win the Academy Award for Best Picture?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Unforgiven\" . ?e_2 <pred:name> \"Academy Award for Best Picture\" . ?e_1 <award received> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <award received> ; <pred:fact_t> ?e_2 ] <point in time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What political party was John McCain a member of during the United States presidential election in 2008?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"United States presidential election, 2008\" . ?e_2 <pred:name> \"John McCain\" . ?e_1 <candidate> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <candidate> ; <pred:fact_t> ?e_2 ] <member of political party> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the instance of the Orkney Islands, which is a part of the North Sea?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"North Sea\" . ?e_2 <pred:name> \"Orkney Islands\" . ?e_1 <has part> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <has part> ; <pred:fact_t> ?e_2 ] <instance of> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What were the last words of George H. W. Bush and who was the addressee (the one whose number of children is 6.0)?",
        "sparql": "ASK { ?e <pred:name> \"George H. W. Bush\" . ?e <number of children> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"6.0\"^^xsd:double . ?e <last words> ?pv . ?pv <pred:value> \"I love you, too.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <last words> ; <pred:fact_t> ?pv ] <addressee> ?qpv . ?qpv <pred:value> \"George W. Bush\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the population of Rio de Janeiro 6.52027e+06 and does it have a Human Development Index of 0.799 (with a unit of 1) and a Brazilian municipality code of 2017?",
        "sparql": "ASK { ?e <pred:name> \"Rio de Janeiro\" . ?e <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.799\"^^xsd:double . ?e <population> ?pv . ?pv <pred:value> \"6.52027e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv ] <Brazilian municipality code> ?qpv . ?qpv <pred:value> \"2017\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the official website of Vodafone and how many employees does it have in the United Kingdom?",
        "sparql": "ASK { ?e <pred:name> \"Vodafone\" . ?e <employees> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"107667.0\"^^xsd:double . ?e <official website> ?pv . ?pv <pred:value> \"https://www.vodafone.co.uk/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official website> ; <pred:fact_t> ?pv ] <applies to jurisdiction> ?qpv . ?qpv <pred:value> \"United Kingdom\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]