[{"question": "How many conservatories have a native label equal to \"\u0421\u0430\u043d\u043a\u0442-\u041f\u0435\u0442\u0435\u0440\u0431\u0443\u0440\u0433\u0441\u043a\u0430\u044f \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u0430\u044f \u043a\u043e\u043d\u0441\u0435\u0440\u0432\u0430\u0442\u043e\u0440\u0438\u044f \u0438\u043c\u0435\u043d\u0438 \u041d. \u0410. \u0420\u0438\u043c\u0441\u043a\u043e\u0433\u043e-\u041a\u043e\u0440\u0441\u0430\u043a\u043e\u0432\u0430\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <native_label> ?pv . ?pv <pred:value> \"\u0421\u0430\u043d\u043a\u0442-\u041f\u0435\u0442\u0435\u0440\u0431\u0443\u0440\u0433\u0441\u043a\u0430\u044f \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u0430\u044f \u043a\u043e\u043d\u0441\u0435\u0440\u0432\u0430\u0442\u043e\u0440\u0438\u044f \u0438\u043c\u0435\u043d\u0438 \u041d. \u0410. \u0420\u0438\u043c\u0441\u043a\u043e\u0433\u043e-\u041a\u043e\u0440\u0441\u0430\u043a\u043e\u0432\u0430\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many metropolises have an area of 3.527e+09?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <area> ?pv . ?pv <pred:value> \"3.527e+09\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many cemeteries have an area of 39.0?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <area> ?pv . ?pv <pred:value> \"39.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many zithers have a Hornbostel-Sachs classification of 314.122-5?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"zither\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"314.122-5\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many miniseries have the title \"Sense and Sensibility\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <title> ?pv . ?pv <pred:value> \"Sense and Sensibility\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many villages have the name \"Underhill's Crossing\" in their native language?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"village\" . ?e <name_in_native_language> ?pv . ?pv <pred:value> \"Underhill's Crossing\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many laws have a subreddit value of \"AnimalRights\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"law\" . ?e <subreddit> ?pv . ?pv <pred:value> \"AnimalRights\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many symptoms have an ICD-10 code of R53?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"symptom\" . ?e <ICD-10> ?pv . ?pv <pred:value> \"R53\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many schools have an ISNI of 0000 0004 0424 992X?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0424 992X\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many chemists have a KldB-2010 occupation code of 41284?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"chemist\" . ?e <KldB-2010_occupation_code> ?pv . ?pv <pred:value> \"41284\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances of science have the subreddit \"Conservative\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Conservative\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many campuses have an ISNI of 0000 0001 2150 6738?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2150 6738\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many sports have the OSM tag or key \"Tag:sport=archery\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sport\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:sport=archery\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many drums have a Hornbostel-Sachs classification of 211.261.1?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drum\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"211.261.1\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many dogs have a life expectancy of 12.0?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <life_expectancy> ?pv . ?pv <pred:value> \"12.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances of fiction have an IAB code of 642?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"fiction\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"642\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many bands have an Instagram username of \"beegees\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"beegees\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many ministers have the official name \"Premier ministre\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <official_name> ?pv . ?pv <pred:value> \"Premier ministre\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many lakes have a volume of 4.918e+06?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"lake\" . ?e <volume_as_quantity> ?pv . ?pv <pred:value> \"4.918e+06\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many concepts have an M.49 code of 001?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"concept\" . ?e <M.49_code> ?pv . ?pv <pred:value> \"001\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many wars have a native label equal to \uacbd\uc778\ub3d9\ub780?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <native_label> ?pv . ?pv <pred:value> \"\uacbd\uc778\ub3d9\ub780\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many airlines have an Instagram username of \"americanair\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"americanair\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many instances of \"trance\" have a subreddit value of \"psytrance\"?", "sparql": "SELECT (COUNT(DISTINCT ?e) AS ?count) WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <subreddit> ?pv . ?pv <pred:value> \"psytrance\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which dog has a catalog code of 086, a subreddit of Yorkies, and 2394.0 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dog\" . ?e <catalog_code> ?pv . ?pv <pred:value> \"086\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Yorkies\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"2394.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the vegetarianism subreddit, with an IAB code of 212 and a subreddit of vegan, have?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"vegetarianism\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"212\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"vegan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"189580.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which philosophy has a Dewey Decimal Classification of 320.52 and a subreddit of Conservative with 133,265 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"philosophy\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"320.52\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Conservative\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"133265.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which superhero has a British Museum person-institution ID of 153870, a subreddit of \"batman\", and has 194291.0 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"153870\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"batman\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"194291.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which drug has a subreddit called \"Marijuana\" and another subreddit called \"trees\" with a number of subscribers equal to 1.1314e+06?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"drug\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Marijuana\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"trees\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"1.1314e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which college has an ISNI of 0000 0001 0675 5242, a Twitter username of CarletonCollege, and has 8047 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0675 5242\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"CarletonCollege\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"8047.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as LGBT, has a Dewey Decimal Classification of 306.7663, a subreddit called \"lesbians\", and has 194,100 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"LGBT\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.7663\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"194100.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which sound has a subreddit called \"kpop\" with 281,136 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <subreddit> ?pv . ?pv <pred:value> \"kpop\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"kpop\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"281136.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the Mormonism (the one whose CANTIC-ID is a11336638 and Twitter username is LDSchurch) have?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11336638\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"LDSchurch\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"461456.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which art has a Dewey Decimal Classification of 770 and is associated with the subreddit photocritique, which has 166,070 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"770\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"photocritique\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"166070.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which science has a Dewey Decimal Classification of 301 and a subreddit called Anthropology with 56966 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"science\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"301\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Anthropology\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"56966.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does the business with ISNI 0000 0000 8338 5874 and Twitter username HearstCorp have?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 8338 5874\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"HearstCorp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"110.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which religion has a Dewey Decimal Classification of 294.3, a subreddit of Buddhism with 137,839 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"religion\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"294.3\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Buddhism\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"137839.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which industry has a Stack Exchange tag of \"https://stackoverflow.com/tags/windows-xp\" and a subreddit of \"windowsxp\" with 701.0 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <Stack_Exchange_tag> ?pv . ?pv <pred:value> \"https://stackoverflow.com/tags/windows-xp\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"windowsxp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"701.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which award has a Twitter username of GolfHallofFame and has 22884 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"GolfHallofFame\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"GolfHallofFame\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"22884.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which basketball has an IAB code of 489, a subreddit of CollegeBasketball, and has 256,367 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"basketball\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"489\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"CollegeBasketball\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"256367.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which phenomenon has an IPTC Newscode of mediatopic/20000441 and is associated with the subreddit \"nature\" with 47980.0 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"phenomenon\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000441\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"nature\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"47980.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which association has an ARCHON code of 397, a Twitter username of royalacademy, and has 420177.0 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <ARCHON_code> ?pv . ?pv <pred:value> \"397\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"royalacademy\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"420177.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which band has an ISNI of 0000 0001 0674 2281, a Twitter username of goldfingermusic, and has 20707.0 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0674 2281\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"goldfingermusic\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"20707.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which airline has a Corporate Number (Japan) of 3700150005378 and a Twitter username of united with 988,612 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <Corporate_Number_(Japan)> ?pv . ?pv <pred:value> \"3700150005378\" . ?e <Twitter_username> ?pv_1 . ?pv_1 <pred:value> \"united\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"988612.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which disco has a subreddit called \"italodisco\" with 3039 subscribers?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <subreddit> ?pv . ?pv <pred:value> \"italodisco\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <number_of_subscribers> ?qpv . ?qpv <pred:unit> \"1\" . ?qpv <pred:value> \"3039.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the organization with ISNI 0000 0000 9987 0743 established on 1946-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-01-01\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0000 9987 0743\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a democracy that was established on 1822-01-07 and is associated with the British Museum person-institution with a value of 180889?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-07\"^^xsd:date . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"180889\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the Medal of Honor, whose inception date is 1862-07-12, a type of medal?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1862-07-12\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Medal of Honor\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the activity with an end time of 2009-08-23 and an official website of http://www.berlin2009.org/1-1-home.html take place?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2009-08-23\"^^xsd:date . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.berlin2009.org/1-1-home.html\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a town with an inception date of 1839-01-01 and a WOEID of 1586549?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1839-01-01\"^^xsd:date . ?e <WOEID> ?pv . ?pv <pred:value> \"1586549\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a dynasty that was dissolved, abolished, or demolished on January 1, 1780 and had a Dewey Decimal Classification of 929.736?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1780-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"929.736\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anime with a publication date of 2008-01-01 and a number of episodes equal to 13?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:value> \"13.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Northern Dancer a horse with a date of birth of 1961-05-27?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1961-05-27\"^^xsd:date . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the official name \"Prime Minister\" associated with an entity that was established on July 1, 1867?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <official_name> ?pv . ?pv <pred:value> \"Prime Minister\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an island with an inception date of 1898-01-01 and a FIPS 10-4 code of GQ?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv . ?pv <pred:value> \"GQ\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Anung un Rama the birth name of the superhero who was born on 1617-10-05?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1617-10-05\"^^xsd:date . ?e <birth_name> ?pv . ?pv <pred:value> \"Anung un Rama\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a novel with a publication date of July 11, 1960 and a Dewey Decimal Classification of 813.54?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-07-11\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"813.54\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a metropolis with an inception date of May 17, 1642 and a Dewey Decimal Classification of 2--71428?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1642-05-17\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--71428\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the album published on 1976-04-23 with a duration of 1744.0 exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"album\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1976-04-23\"^^xsd:date . ?e <duration> ?pv . ?pv <pred:value> \"1744.0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the war with KulturNav-id f0a37482-3736-4dd0-b56c-c7d26fb32a95 end on 1648-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1648-01-01\"^^xsd:date . ?e <KulturNav-id> ?pv . ?pv <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the author with ISNI 0000 0001 0873 3741 born on 1934-08-18?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]