[{"question": "Was Tehran founded on March 20, 1794 and does it have a population of 7,711,230?", "sparql": "ASK { ?e <pred:name> \"Tehran\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1794-03-20\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"7.71123e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Sapporo founded on January 1, 1868 and has a population of 1,955,120?", "sparql": "ASK { ?e <pred:name> \"Sapporo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1868-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.95512e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Morocco established on April 7, 1956 and has a Human Development Index of 0.488?", "sparql": "ASK { ?e <pred:name> \"Morocco\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-04-07\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.488\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Guadalajara founded on November 30, 1542 and has a population of 1,460,150?", "sparql": "ASK { ?e <pred:name> \"Guadalajara\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1542-11-30\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.46015e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Ames founded on January 1, 1864 and has a population of 58965.0?", "sparql": "ASK { ?e <pred:name> \"Ames\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1864-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"58965.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Alaska 738,432 and was it established on January 3, 1959?", "sparql": "ASK { ?e <pred:name> \"Alaska\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1959-01-03\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"738432.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Modesto a city with an inception date of November 8, 1870 and a population of 201,165?", "sparql": "ASK { ?e <pred:name> \"Modesto\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1870-11-08\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"201165.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Tanzania established on January 1, 1964 and has a Human Development Index of 0.5?", "sparql": "ASK { ?e <pred:name> \"Tanzania\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.5\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Rotherham, which was established on 1974-04-01, 260,800?", "sparql": "ASK { ?e <pred:name> \"Rotherham\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"260800.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the show \"It\" end on November 20, 1990 and have 2.0 episodes?", "sparql": "ASK { ?e <pred:name> \"It\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1990-11-20\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Moldova's Human Development Index 0.649 and its inception date 1991-08-27?", "sparql": "ASK { ?e <pred:name> \"Moldova\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-27\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.649\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Tupelo, which was founded on July 20, 1870, equal to 33,988?", "sparql": "ASK { ?e <pred:name> \"Tupelo\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1870-07-20\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"33988.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Cyprus established on January 1, 1960 and has a Human Development Index of 0.852?", "sparql": "ASK { ?e <pred:name> \"Cyprus\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.852\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Islamabad 1.9 million and was it established on January 1, 1960?", "sparql": "ASK { ?e <pred:name> \"Islamabad\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.9e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Athens founded on January 1, 1806 and has a population of 115,452?", "sparql": "ASK { ?e <pred:name> \"Athens\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1806-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"115452.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Paraguay established on January 1, 1811 and has a Human Development Index of 0.551?", "sparql": "ASK { ?e <pred:name> \"Paraguay\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1811-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.551\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Nairobi founded on January 1, 1899 and has a population of 3,240,160?", "sparql": "ASK { ?e <pred:name> \"Nairobi\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1899-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.24016e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Windsor on November 30, 1749 equal to 210,891?", "sparql": "ASK { ?e <pred:name> \"Windsor\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1749-11-30\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"210891.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Dordogne have an annual number of weddings equal to 1475.0 on its inception date of 1790-03-04?", "sparql": "ASK { ?e <pred:name> \"Dordogne\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1790-03-04\"^^xsd:date . ?e <annual_number_of_weddings> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1475.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is FromSoftware a company that was founded on November 1, 1986 and has 218 employees?", "sparql": "ASK { ?e <pred:name> \"FromSoftware\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1986-11-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the female population of Assam, which was established on 1950-01-26, equal to 1.52661e+07?", "sparql": "ASK { ?e <pred:name> \"Assam\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1950-01-26\"^^xsd:date . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.52661e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Bhutan's Human Development Index 0.582 and was it established on 1907-12-17?", "sparql": "ASK { ?e <pred:name> \"Bhutan\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1907-12-17\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.582\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Saxony-Anhalt 2.24547e+06 and was it established on 1990-10-03?", "sparql": "ASK { ?e <pred:name> \"Saxony-Anhalt\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-10-03\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.24547e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Compton founded on May 11, 1888 and has a population of 96,455?", "sparql": "ASK { ?e <pred:name> \"Compton\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1888-05-11\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"96455.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Canberra 381,488 and was it founded on March 12, 0250?", "sparql": "ASK { ?e <pred:name> \"Canberra\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"0250-03-12\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"381488.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Greenwood, which was established on January 1, 1830, equal to 16,087?", "sparql": "ASK { ?e <pred:name> \"Greenwood\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1830-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"16087.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Claremont, which was established on October 3, 1907, equal to 34,926?", "sparql": "ASK { ?e <pred:name> \"Claremont\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1907-10-03\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"34926.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Dalian, which was founded on 1899-08-11, 6.69043e+06?", "sparql": "ASK { ?e <pred:name> \"Dalian\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1899-08-11\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.69043e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Bandung's population 2.39487e+06 and its inception date 1810-09-25?", "sparql": "ASK { ?e <pred:name> \"Bandung\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1810-09-25\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.39487e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Ontario's population 13,448,500 and its inception date July 1, 1867?", "sparql": "ASK { ?e <pred:name> \"Ontario\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.34485e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Thuringia 2.161e+06 and was it established on 1990-10-03?", "sparql": "ASK { ?e <pred:name> \"Thuringia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-10-03\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.161e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Iceland's Human Development Index 0.889 and its inception date 1918-12-01?", "sparql": "ASK { ?e <pred:name> \"Iceland\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-12-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.889\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Rugrats start on August 11, 1991 and have 9.0 seasons?", "sparql": "ASK { ?e <pred:name> \"Rugrats\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1991-08-11\"^^xsd:date . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Potsdam 167,505 and the time of its earliest written record 0993-07-03?", "sparql": "ASK { ?e <pred:name> \"Potsdam\" . ?e <time_of_earliest_written_record> ?pv_1 . ?pv_1 <pred:date> \"0993-07-03\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"167505.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Malawi's Human Development Index 0.42 and was it established on January 1, 1964?", "sparql": "ASK { ?e <pred:name> \"Malawi\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1964-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.42\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Downey, which was founded on October 23, 1873, equal to 111,772?", "sparql": "ASK { ?e <pred:name> \"Downey\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1873-10-23\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"111772.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Quincy start on October 3, 1976 and have 148 episodes?", "sparql": "ASK { ?e <pred:name> \"Quincy\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"1976-10-03\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"148.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does Shueisha, which was founded on 1925-01-01, have 812.0 employees?", "sparql": "ASK { ?e <pred:name> \"Shueisha\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1925-01-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"812.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Mexico's Human Development Index 0.634 on 1821-08-24?", "sparql": "ASK { ?e <pred:name> \"Mexico\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-08-24\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.634\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Benin's Human Development Index 0.344 and its inception date 1960-08-01?", "sparql": "ASK { ?e <pred:name> \"Benin\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-08-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.344\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Oxnard established on June 30, 1903 and has a population of 205,437?", "sparql": "ASK { ?e <pred:name> \"Oxnard\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1903-06-30\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"205437.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Languedoc-Roussillon have a population of 2.72972e+06 and end on 2016-01-01?", "sparql": "ASK { ?e <pred:name> \"Languedoc-Roussillon\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2016-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.72972e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Angel end on May 19, 2004 after 5 seasons?", "sparql": "ASK { ?e <pred:name> \"Angel\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2004-05-19\"^^xsd:date . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Glee end on 2015-03-20 and have 121 episodes?", "sparql": "ASK { ?e <pred:name> \"Glee\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2015-03-20\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"121.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Carmel-by-the-Sea established on October 31, 1916 and has a population of 3722?", "sparql": "ASK { ?e <pred:name> \"Carmel-by-the-Sea\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1916-10-31\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3722.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Virginia 3.96695e+06 and its inception date 1788-06-25?", "sparql": "ASK { ?e <pred:name> \"Virginia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-06-25\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.96695e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Rostov-on-Don founded on January 1, 1749 and has a population of 997,800?", "sparql": "ASK { ?e <pred:name> \"Rostov-on-Don\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1749-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"997800.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Australia's Human Development Index 0.932 and its inception date 1901-01-01?", "sparql": "ASK { ?e <pred:name> \"Australia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1901-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.932\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Aquitaine have a population of 3.31689e+06 and end on 2016-01-01?", "sparql": "ASK { ?e <pred:name> \"Aquitaine\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2016-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.31689e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Xinjiang 2.18133e+07 and its inception date 1955-10-01?", "sparql": "ASK { ?e <pred:name> \"Xinjiang\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1955-10-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.18133e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Phoenix, which was founded on January 1, 1868, equal to 1,469,470?", "sparql": "ASK { ?e <pred:name> \"Phoenix\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1868-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.46947e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did Somerset end on December 31, 1976 and have 1710 episodes?", "sparql": "ASK { ?e <pred:name> \"Somerset\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1976-12-31\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1710.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Oklahoma 3.02529e+06 and was it established on November 16, 1907?", "sparql": "ASK { ?e <pred:name> \"Oklahoma\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1907-11-16\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.02529e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Israel's Human Development Index 0.899 and was it established on 1948-05-14?", "sparql": "ASK { ?e <pred:name> \"Israel\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1948-05-14\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.899\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Sindh 5.52455e+07 and was it established on 1947-08-14?", "sparql": "ASK { ?e <pred:name> \"Sindh\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-08-14\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.52455e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Colombia established on January 1, 1810 and has a Human Development Index of 0.573?", "sparql": "ASK { ?e <pred:name> \"Colombia\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1810-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.573\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Tuvalu 9590.0 and was it established on January 1, 1978?", "sparql": "ASK { ?e <pred:name> \"Tuvalu\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"9590.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Quito 2.73599e+06 and was it founded on 1534-12-06?", "sparql": "ASK { ?e <pred:name> \"Quito\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1534-12-06\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.73599e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Portland founded on February 8, 1851 and has a population of 583,776?", "sparql": "ASK { ?e <pred:name> \"Portland\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1851-02-08\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"583776.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Nevada established on October 31, 1864 and has a population of 488,738?", "sparql": "ASK { ?e <pred:name> \"Nevada\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1864-10-31\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"488738.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the population of Maryland 3.9224e+06 and was it established on April 28, 1788?", "sparql": "ASK { ?e <pred:name> \"Maryland\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1788-04-28\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.9224e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Kuwait established on January 1, 1961 and has a Human Development Index of 0.715?", "sparql": "ASK { ?e <pred:name> \"Kuwait\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1961-01-01\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.715\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Carlsbad, with an inception date of 1952-07-16 and a population of 105328.0, a city?", "sparql": "ASK { ?e <pred:name> \"Carlsbad\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1952-07-16\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"105328.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the female population of Maharashtra, which was established on 1960-05-01, equal to 5.41313e+07?", "sparql": "ASK { ?e <pred:name> \"Maharashtra\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-05-01\"^^xsd:date . ?e <female_population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.41313e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Sony's inception date May 7, 1946 and does it have 128,400 employees?", "sparql": "ASK { ?e <pred:name> \"Sony\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-05-07\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"128400.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is Helsinki's population 152,000 and was it founded on June 12, 1550?", "sparql": "ASK { ?e <pred:name> \"Helsinki\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1550-06-12\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"152000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Budapest founded on November 17, 1873 and has a population of 1,735,710?", "sparql": "ASK { ?e <pred:name> \"Budapest\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1873-11-17\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.73571e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Homeland start on October 2, 2011 and have 84 episodes?", "sparql": "ASK { ?e <pred:name> \"Homeland\" . ?e <start_time> ?pv_1 . ?pv_1 <pred:date> \"2011-10-02\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"84.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was Birmingham founded on April 1, 1974 and has a population of 1,111,300?", "sparql": "ASK { ?e <pred:name> \"Birmingham\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1113e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the TV show Seinfeld end on May 14, 1998 and have 180 episodes?", "sparql": "ASK { ?e <pred:name> \"Seinfeld\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1998-05-14\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"180.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]