[{"question": "Was the currency's inception date on January 1, 1999?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1999-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a human who was born on September 21, 1931?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1931-09-21\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1931-09-21\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the conservatory established on January 1, 1921?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1921-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1921-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an association that was established on January 1, 1768?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1768-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1768-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an animal that was born on January 28, 1970?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"animal\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1970-01-28\"^^xsd:date . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1970-01-28\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the news have its first performance on January 14, 1952?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1952-01-14\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the city's inception date on January 1, 1850?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1850-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1850-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the position's inception date equal to 1789-04-21?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-21\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-21\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did music have an inception date of January 1, 1995?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"music\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the software created on January 30, 2007?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"2007-01-30\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"2007-01-30\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a minister whose inception date is 1867-07-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the university established on September 29, 1963?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1963-09-29\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1963-09-29\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the entertainment have a publication date of 1998-11-18?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1998-11-18\"^^xsd:date . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-11-18\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the landform's inception date on January 1, 1898?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a profession that was established on April 4, 1721?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1721-04-04\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1721-04-04\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a foundation that was established on June 1, 1999?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1999-06-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1999-06-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there an empire that was dissolved, abolished, or demolished on January 1, 1857?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1857-01-01\"^^xsd:date . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1857-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the campus established on January 1, 1893?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1893-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1893-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the facility officially opened on November 19, 1819?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <date_of_official_opening> ?pv_1 . ?pv_1 <pred:date> \"1819-11-19\"^^xsd:date . ?e <date_of_official_opening> ?pv . ?pv <pred:date> \"1819-11-19\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manifestation that has an inception date of 1867-07-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1867-07-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a band that was formed on January 1, 1969?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1969-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1969-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the airline start its work period on April 6, 1926?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <work_period_(start)> ?pv_1 . ?pv_1 <pred:date> \"1926-04-06\"^^xsd:date . ?e <work_period_(start)> ?pv . ?pv <pred:date> \"1926-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a speaker whose inception date is 1789-04-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"speaker\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1789-04-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did jazz music originate on January 1, 1995?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"jazz\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1995-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was disco invented on January 1, 1978?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e <inception> ?pv . ?pv <pred:date> \"1978-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which organization has an inception date of 1946-01-01 and an ISNI of 0000 0000 9987 0743?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <inception> ?pv . ?pv <pred:date> \"1946-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 9987 0743\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which medal has an inception date of 1862-07-12 and a native label of \"Medal of Honor\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <inception> ?pv . ?pv <pred:date> \"1862-07-12\"^^xsd:date . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Medal of Honor\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which activity ended on 2009-08-23 and has an official website of http://www.berlin2009.org/1-1-home.html?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <end_time> ?pv . ?pv <pred:date> \"2009-08-23\"^^xsd:date . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.berlin2009.org/1-1-home.html\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which town was established on January 1, 1839 and has a WOEID of 1586549?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <inception> ?pv . ?pv <pred:date> \"1839-01-01\"^^xsd:date . ?e <WOEID> ?pv_1 . ?pv_1 <pred:value> \"1586549\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which dynasty was dissolved on January 1, 1780 and has a Dewey Decimal Classification of 929.736?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"dynasty\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"1780-01-01\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"929.736\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an inception date of 1957-01-01, ISNI of 0000 0004 0508 6616, and is an instance of Protestantism?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which horse was born on 1961-05-27 and has a native label of \"Northern Dancer\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1961-05-27\"^^xsd:date . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an inception date of 1867-07-01 and an official name of \"Prime Minister\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"official\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Prime Minister\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which island was established on January 1, 1898 and has a FIPS 10-4 code of GQ?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"GQ\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the superhero with a date of birth of 1617-10-05 and a birth name of Anung un Rama?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"superhero\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1617-10-05\"^^xsd:date . ?e <birth_name> ?pv_1 . ?pv_1 <pred:value> \"Anung un Rama\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which novel was published on July 11, 1960 and has a Dewey Decimal Classification of 813.54?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"novel\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1960-07-11\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"813.54\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which metropolis was established on May 17, 1642 and has a Dewey Decimal Classification of 2--71428?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <inception> ?pv . ?pv <pred:date> \"1642-05-17\"^^xsd:date . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--71428\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which war ended on January 1, 1648 and has a KulturNav-id of f0a37482-3736-4dd0-b56c-c7d26fb32a95?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <end_time> ?pv . ?pv <pred:date> \"1648-01-01\"^^xsd:date . ?e <KulturNav-id> ?pv_1 . ?pv_1 <pred:value> \"f0a37482-3736-4dd0-b56c-c7d26fb32a95\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the author born on 1934-08-18 and has an ISNI of 0000 0001 0873 3741?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"author\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which republic was established on January 7, 1822 and has a British Museum person-institution ID of 180889?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <inception> ?pv . ?pv <pred:date> \"1822-01-07\"^^xsd:date . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which division was dissolved on 2015-09-16 and has an official name of \"\u60c5\u5831\u958b\u767a\u672c\u90e8\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"division\" . ?e <dissolved,_abolished_or_demolished> ?pv . ?pv <pred:date> \"2015-09-16\"^^xsd:date . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"\u60c5\u5831\u958b\u767a\u672c\u90e8\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which taxon has a date of birth of 1961-05-27 and a native label of Northern Dancer?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"taxon\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1961-05-27\"^^xsd:date . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which city is the capital, has an inception date of 1571-06-24, and has a FIPS 10-4 code of RPD9?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <inception> ?pv . ?pv <pred:date> \"1571-06-24\"^^xsd:date . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"RPD9\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which agent has an inception date of 1946-01-01 and an ISNI of 0000 0000 9987 0743?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <inception> ?pv . ?pv <pred:date> \"1946-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 9987 0743\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which manga was published on 1952-04-01 and has an official website of http://tezukaosamu.net?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manga\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1952-04-01\"^^xsd:date . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://tezukaosamu.net\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which college was established on January 1, 1824 and has an ISNI of 0000 0001 0719 5427?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0719 5427\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which anthology was published on April 11, 1960 and has an OCLC control number of 357792?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1960-04-11\"^^xsd:date . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"357792\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is a techno genre that was created on January 1, 1991 and has a subreddit called \"minimal\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <inception> ?pv . ?pv <pred:date> \"1991-01-01\"^^xsd:date . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is related to marketing and had its first flight on 1967-04-09 with a RIA_Novosti_reference of 61684885?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <first_flight> ?pv . ?pv <pred:date> \"1967-04-09\"^^xsd:date . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"61684885\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which occupation has a date of birth of 1934-08-18 and an ISNI of 0000 0001 0873 3741?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"occupation\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which neighborhood was established on September 28, 1630 and has a postal code of 02119?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"neighborhood\" . ?e <inception> ?pv . ?pv <pred:date> \"1630-09-28\"^^xsd:date . ?e <postal_code> ?pv_1 . ?pv_1 <pred:value> \"02119\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which soundtrack has a publication date of 2010-04-19 and a title of Iron Man 2?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"soundtrack\" . ?e <publication_date> ?pv . ?pv <pred:date> \"2010-04-19\"^^xsd:date . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Iron Man 2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which army was established on 1947-08-15 and has an ISNI of 0000 0004 0498 1870?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <inception> ?pv . ?pv <pred:date> \"1947-08-15\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0498 1870\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which sound was created on January 1, 1991 and has a subreddit called \"minimal\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"sound\" . ?e <inception> ?pv . ?pv <pred:date> \"1991-01-01\"^^xsd:date . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which subreddit is associated with the trance genre that was created on January 1, 1995?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"trance\" . ?e <inception> ?pv . ?pv <pred:date> \"1995-01-01\"^^xsd:date . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"psytrance\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an instance_of \"Mormonism\", an inception date of 1830-04-06, and a CANTIC-ID of a11336638?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Mormonism\" . ?e <inception> ?pv . ?pv <pred:date> \"1830-04-06\"^^xsd:date . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11336638\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which cemetery was established on January 1, 1825 and is located at Avenue Samson, 37?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <inception> ?pv . ?pv <pred:date> \"1825-01-01\"^^xsd:date . ?e <located_at_street_address_(DEPRECATED)> ?pv_1 . ?pv_1 <pred:value> \"Avenue Samson, 37\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which newscast has a date of first performance of 1952-01-14 and an Instagram username of todayshow?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"1952-01-14\"^^xsd:date . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an inception date of 1957-01-01, an ISNI of 0000 0004 0508 6616, and is related to Christianity?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Christianity\" . ?e <inception> ?pv . ?pv <pred:date> \"1957-01-01\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0508 6616\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which governor was inaugurated on June 4, 1792 and has an official website of http://governor.ky.gov/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"governor\" . ?e <inception> ?pv . ?pv <pred:date> \"1792-06-04\"^^xsd:date . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://governor.ky.gov/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which politician has an inception date of 1789-04-01 and a native label of \"Speaker of the United States House of Representatives\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"politician\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-01\"^^xsd:date . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Speaker of the United States House of Representatives\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is a print that was created on January 17, 1860 and has an IIIF manifest of \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"print\" . ?e <inception> ?pv . ?pv <pred:date> \"1860-01-17\"^^xsd:date . ?e <IIIF_manifest> ?pv_1 . ?pv_1 <pred:value> \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which genre was established on 1876-01-01 and has an official website of http://harvardlampoon.com/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <inception> ?pv . ?pv <pred:date> \"1876-01-01\"^^xsd:date . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://harvardlampoon.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which musical had its first performance on 2011-07-07 and has an official website of http://aladdinthemusical.com?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <date_of_first_performance> ?pv . ?pv <pred:date> \"2011-07-07\"^^xsd:date . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://aladdinthemusical.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which single was published on November 24, 1998 and has an ISWC of T-070.942.427-0?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-11-24\"^^xsd:date . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-070.942.427-0\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which road ended on June 27, 1985 and has a road number of US 66?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <end_time> ?pv . ?pv <pred:date> \"1985-06-27\"^^xsd:date . ?e <road_number> ?pv_1 . ?pv_1 <pred:value> \"US 66\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Who is the writer born on 1934-08-18 and has an ISNI of 0000 0001 0873 3741?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"writer\" . ?e <date_of_birth> ?pv . ?pv <pred:date> \"1934-08-18\"^^xsd:date . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 0873 3741\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]