[
    {
        "question": "What is the connection between Cuba (the one with a Human Development Index of 0.685) and Cuba (the one whose inception date is 1898-12-10)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Cuba . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.685\"^^xsd:double . ?e_2 <pred:name> Cuba . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-12-10\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Portugal (the one with a Human Development Index of 0.827) and Portugal (the one whose inception date is 1143-10-05)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Portugal . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.827\"^^xsd:double . ?e_2 <pred:name> Portugal . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1143-10-05\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Carlisle (the one with a population of 75399.0) and Carlisle (the one whose inception date is 1974-04-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Carlisle . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"75399.0\"^^xsd:double . ?e_2 <pred:name> Carlisle . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between the population of Brandenburg (which is 2.725e+06) and its inception date (which is 1990-10-03)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Brandenburg . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.725e+06\"^^xsd:double . ?e_2 <pred:name> Brandenburg . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1990-10-03\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Ghana (the one with a Human Development Index of 0.427) and Ghana (the one whose inception date is 1957-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Ghana . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.427\"^^xsd:double . ?e_2 <pred:name> Ghana . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Haiti (the one with a Human Development Index of 0.422) and Haiti (the one whose inception date is 1804-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Haiti . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.422\"^^xsd:double . ?e_2 <pred:name> Haiti . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1804-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Nigeria (the one with a Human Development Index of 0.499) and Nigeria (the one whose inception date is 1960-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Nigeria . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.499\"^^xsd:double . ?e_2 <pred:name> Nigeria . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Laos (the one with a Human Development Index of 0.462) and Laos (the one whose inception date is 1949-01-01)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Laos . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.462\"^^xsd:double . ?e_2 <pred:name> Laos . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1949-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Eswatini (the one with a Human Development Index of 0.473) and Eswatini (the one whose inception date is 1968-09-06)?",
        "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> Eswatini . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.473\"^^xsd:double . ?e_2 <pred:name> Eswatini . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-09-06\"^^xsd:date . ?e_1 ?p ?e_2 .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the connection between Mormonism (the one whose CANTIC-ID is a11336638) and itself (also with a CANTIC-ID of a11336638)?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> Mormonism . ?e <CANTIC-ID> ?pv . ?pv <pred:value> \"a11336638\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a11336638\" . [ <pred:fact_h> ?e ; <pred:fact_r> <CANTIC-ID> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"a11336638\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which restaurant has an OSM tag or key of \"Tag:shop=deli\" and a fact with the same OSM tag or key and value?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> restaurant . ?e <OSM tag or key> ?pv . ?pv <pred:value> \"Tag:shop=deli\" . ?e <OSM tag or key> ?pv_1 . ?pv_1 <pred:value> \"Tag:shop=deli\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM tag or key> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"Tag:shop=deli\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the government entity with an ISNI of 0000 0001 2230 8442 and a RIA Novosti reference of 43219727?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> government . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0001 2230 8442\" . ?e <RIA Novosti reference> ?pv_1 . ?pv_1 <pred:value> \"43219727\" . [ <pred:fact_h> ?e ; <pred:fact_r> <RIA Novosti reference> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"43219727\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which peninsula has an area of 622918.0 and a fact with a value of 622918.0?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> peninsula . ?e <area> ?pv . ?pv <pred:value> \"622918.0\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"622918.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <area> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"622918.0\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which nationality has a population of 6 million and a population of 6 million at a different time? And what is the time when the population was 6 million?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> nationality . ?e <population> ?pv . ?pv <pred:value> \"6e+06\" . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"6e+06\" . [ <pred:fact_h> ?e ; <pred:fact_r> <population> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"6e+06\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which politician has a short name of IND and is associated with the party whose short name is also IND?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> politician . ?e <short name> ?pv . ?pv <pred:value> \"IND\" . ?e <short name> ?pv_1 . ?pv_1 <pred:value> \"IND\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short name> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"IND\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which entity belongs to the science category and has an ACM Classification Code (2012) of 10002979?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> science . ?e <ACM Classification Code (2012)> ?pv . ?pv <pred:value> \"10002979\" . ?e <ACM Classification Code (2012)> ?pv_1 . ?pv_1 <pred:value> \"10002979\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ACM Classification Code (2012)> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"10002979\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which product has an IPTC Newscode of \"mediatopic/20000245\" and is related to \"mediatopic/20000245\"?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> product . ?e <IPTC Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000245\" . ?e <IPTC Newscode> ?pv_1 . ?pv_1 <pred:value> \"mediatopic/20000245\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IPTC Newscode> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"mediatopic/20000245\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Which road has a length of 2451.0 and a road number of US 66?",
        "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> road . ?e <length> ?pv . ?pv <pred:value> \"2451.0\" . ?e <road number> ?pv_1 . ?pv_1 <pred:value> \"US 66\" . [ <pred:fact_h> ?e ; <pred:fact_r> <road number> ; <pred:fact_t> ?pv_1 ] <pred:fact t> ?qpv . ?qpv <pred:value> \"US 66\" .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Zambia (the one that has a CIVICUS Monitor country entry value of \"zambia\")?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Zambia . ?e <CIVICUS Monitor country entry> ?pv_1 . ?pv_1 <pred:value> \"zambia\" . ?e <subreddit> ?pv . ?pv <pred:value> Zambia . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Wisconsin, which has a population of 2.93901e+06?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Wisconsin . ?e <population> ?pv_1 . ?pv_1 <pred:value> \"2.93901e+06\" . ?e <subreddit> ?pv . ?pv <pred:value> Wisconsin . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the local dialing code and fact for Fairbanks (the one whose native label is also Fairbanks)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Fairbanks . ?e <local dialing code> ?pv_1 . ?pv_1 <pred:value> \"907\" . ?e <native label> ?pv . ?pv <pred:value> Fairbanks . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with Usher's name in native language and official website http://www.ushernow.com?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Usher . ?e <official website> ?pv_1 . ?pv_1 <pred:value> \"http://www.ushernow.com\" . ?e <name in native language> ?pv . ?pv <pred:value> Usher . [ <pred:fact_h> ?e ; <pred:fact_r> <name in native language> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Hoffa's title?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Hoffa . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Hoffa\" . ?e <title> ?pv . ?pv <pred:value> Hoffa . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Karachi's native label being \"\" and also \"Karachi\"?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Karachi . ?e <native label> ?pv_1 . ?pv_1 <pred:value> \"\" . ?e <native label> ?pv . ?pv <pred:value> Karachi . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact associated with the title \"Kinsey\" for the entity named Kinsey?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Kinsey . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Kinsey\" . ?e <title> ?pv . ?pv <pred:value> Kinsey . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the exploitation visa number for the movie Signs and who is the fact about?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Signs . ?e <exploitation visa number> ?pv_1 . ?pv_1 <pred:value> \"106368\" . ?e <title> ?pv . ?pv <pred:value> Signs . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the fact about Schleswig-Holstein (the one whose NUTS code is DEF and native label is also Schleswig-Holstein)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Schleswig-Holstein . ?e <NUTS code> ?pv_1 . ?pv_1 <pred:value> \"DEF\" . ?e <native label> ?pv . ?pv <pred:value> Schleswig-Holstein . [ <pred:fact_h> ?e ; <pred:fact_r> <native label> ; <pred:fact_t> ?pv ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the language of work or name for the subreddit of Wyoming (the one whose CANTIC-ID is a1144938x)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> Wyoming . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a1144938x\" . ?e <subreddit> ?pv . ?pv <pred:value> Wyoming . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language of work or name> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a publication titled Waco in 1966 with the name Waco in it?",
        "sparql": "ASK { ?e <pred:name> Waco . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1966-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Waco .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a publication titled Nancy on January 20th, 2018?",
        "sparql": "ASK { ?e <pred:name> Nancy . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2018-01-20\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Nancy .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was the publication date of the book/movie titled Ninotchka in 1939-01-01?",
        "sparql": "ASK { ?e <pred:name> Ninotchka . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1939-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Ninotchka .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the Twitter username for Chrysler the same as its name and was it founded on June 6th, 1925?",
        "sparql": "ASK { ?e <pred:name> Chrysler . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1925-06-06\"^^xsd:date . ?e <Twitter username> ?pv . ?pv <pred:value> Chrysler .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of Metropolis in the public domain as of January 1st, 2022?",
        "sparql": "ASK { ?e <pred:name> Metropolis . ?e <public domain date> ?pv_1 . ?pv_1 <pred:date> \"2022-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Metropolis .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Was there a publication titled Ronaldo with a publication date of 2015-11-09?",
        "sparql": "ASK { ?e <pred:name> Ronaldo . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"2015-11-09\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Ronaldo .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Does Somalia have a subreddit with the same name and an inception date of 1960-01-01?",
        "sparql": "ASK { ?e <pred:name> Somalia . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e <subreddit> ?pv . ?pv <pred:value> Somalia .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is Tupelo's official name also Tupelo and was it founded on July 20th, 1870?",
        "sparql": "ASK { ?e <pred:name> Tupelo . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1870-07-20\"^^xsd:date . ?e <official name> ?pv . ?pv <pred:value> Tupelo .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is the title of the work with the name Americana and publication date of 1983-01-01 also Americana?",
        "sparql": "ASK { ?e <pred:name> Americana . ?e <publication date> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <title> ?pv . ?pv <pred:value> Americana .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "Is P!nk's name in native language also P!nk and was she born on 1979-09-08?",
        "sparql": "ASK { ?e <pred:name> P!nk . ?e <date of birth> ?pv_1 . ?pv_1 <pred:date> \"1979-09-08\"^^xsd:date . ?e <name in native language> ?pv . ?pv <pred:value> P!nk .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the narrative location of Last of the Summer Wine (the one with 295.0 episodes) and what is the value of the fact h?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Last of the Summer Wine\" . ?e_1 <number of episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"295.0\"^^xsd:double . ?e_2 <pred:name> Yorkshire . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"5.2347e+06\"^^xsd:double . ?e_1 <narrative location> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <narrative location> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the Human Development Index of Slovakia and what is the population of its capital city, Bratislava? Also, what is the connection between Slovakia and Bratislava in terms of being a capital city?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Slovakia\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.836\"^^xsd:double . ?e_2 <pred:name> Bratislava . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"425923.0\"^^xsd:double . ?e_1 <capital> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <capital> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population of Virginia (the one with a population of 3.96695e+06) and Fairfax (the one with a population of 22749.0) and what is the relationship between them?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Virginia\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.96695e+06\"^^xsd:double . ?e_2 <pred:name> Fairfax . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"22749.0\"^^xsd:double . ?e_1 <contains administrative territorial entity> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <contains administrative territorial entity> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "When did Georgia start having diplomatic relations with Dominica (the one whose Human Development Index is 0.723)?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Georgia\" . ?e_1 <Human Development Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.735\"^^xsd:double . ?e_2 <pred:name> Dominica . ?e_2 <Human Development Index> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"0.723\"^^xsd:double . ?e_1 <diplomatic relation> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <diplomatic relation> ; <pred:fact_t> ?e_2 ] <start time> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    },
    {
        "question": "What is the population ratio between Guadalajara (with a population of 1.46015e+06) and Downey (with a population of 111772.0), the two cities that are twinned administrative bodies?",
        "sparql": "SELECT DISTINCT ?qpv WHERE { ?e_1 <pred:name> \"Guadalajara\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.46015e+06\"^^xsd:double . ?e_2 <pred:name> Downey . ?e_2 <population> ?pv_1 . ?pv_1 <pred:unit> \"1\" . ?pv_1 <pred:value> \"111772.0\"^^xsd:double . ?e_1 <twinned administrative body> ?e_2 . [ <pred:fact_h> ?e_1 ; <pred:fact_r> <twinned administrative body> ; <pred:fact_t> ?e_2 ] <pred:fact h> ?qpv .  }",
        "choices": [
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown",
            "unknown"
        ],
        "answer": "unknown"
    }
]