[{"question": "Is the print with the IIIF manifest \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" that was created on 1860-01-17 still active?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"print\" . ?e <IIIF_manifest> ?pv_1 . ?pv_1 <pred:value> \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IIIF_manifest> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://damsssl.llgc.org.uk/iiif/2.0/1132631/manifest.json\" . ?e <inception> ?pv . ?pv <pred:date> \"1860-01-17\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the genre with the official website http://harvardlampoon.com/ established on January 1, 1876?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://harvardlampoon.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://harvardlampoon.com/\" . ?e <inception> ?pv . ?pv <pred:date> \"1876-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a single with the ISWC code T-070.942.427-0 and publication date of 1998-11-24?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <ISWC> ?pv_1 . ?pv_1 <pred:value> \"T-070.942.427-0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISWC> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"T-070.942.427-0\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1998-11-24\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a road with a length of 2451.0 and an inception date of 1926-11-11?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"road\" . ?e <length> ?pv_1 . ?pv_1 <pred:value> \"2451.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <length> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2451.0\" . ?e <inception> ?pv . ?pv <pred:date> \"1926-11-11\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the business with the Instagram username \"hearstcorp\" established on 1887-03-04?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"hearstcorp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Instagram_username> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"hearstcorp\" . ?e <inception> ?pv . ?pv <pred:date> \"1887-03-04\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a museum with an ARCHON code of 345 and an inception date of 1824-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"345\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the post-hardcore genre, which has a subreddit called Emo, created on January 1, 1988?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"post-hardcore\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"Emo\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Emo\" . ?e <inception> ?pv . ?pv <pred:date> \"1988-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When did the currency with PermID 500269 start?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"currency\" . ?e <PermID> ?pv_1 . ?pv_1 <pred:value> \"500269\" . [ <pred:fact_h> ?e ; <pred:fact_r> <PermID> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"500269\" . ?e <start_time> ?pv . ?pv <pred:date> \"1694-07-27\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the person with ISNI 0000 0000 5930 3891 die on 2012-11-23?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 5930 3891\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0000 5930 3891\" . ?e <date_of_death> ?pv . ?pv <pred:date> \"2012-11-23\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the inception date of the conservatory with ISNI 0000 0001 2189 390X?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2189 390X\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2189 390X\" . ?e <inception> ?pv . ?pv <pred:date> \"1921-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city with an area of 187.7 and an inception date of 1850-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <area> ?pv_1 . ?pv_1 <pred:value> \"187.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <area> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"187.7\" . ?e <inception> ?pv . ?pv <pred:date> \"1850-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a position with an Instagram username of \"vp\" and an inception date of 1789-04-21?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"vp\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Instagram_username> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"vp\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-21\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a software with the Stack Exchange tag \"https://android.stackexchange.com/tags/windows\" and an inception date of 1985-11-20?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <Stack_Exchange_tag> ?pv_1 . ?pv_1 <pred:value> \"https://android.stackexchange.com/tags/windows\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Stack_Exchange_tag> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://android.stackexchange.com/tags/windows\" . ?e <inception> ?pv . ?pv <pred:date> \"1985-11-20\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the minister with the official name \"Prime Minister\" established on July 1, 1867?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Prime Minister\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Prime Minister\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the entertainment with the official website http://www.bitmap-brothers.co.uk/our-games/past/z.htm published on 1996-07-31?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.bitmap-brothers.co.uk/our-games/past/z.htm\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.bitmap-brothers.co.uk/our-games/past/z.htm\" . ?e <publication_date> ?pv . ?pv <pred:date> \"1996-07-31\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a landform with FIPS 10-4 (countries and regions) code GQ that was established on January 1, 1898?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"landform\" . ?e <FIPS_10-4_(countries_and_regions)> ?pv_1 . ?pv_1 <pred:value> \"GQ\" . [ <pred:fact_h> ?e ; <pred:fact_r> <FIPS_10-4_(countries_and_regions)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"GQ\" . ?e <inception> ?pv . ?pv <pred:date> \"1898-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the profession \"United States Secretary of State\" incepted on 1789-04-06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"United States Secretary of State\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"United States Secretary of State\" . ?e <inception> ?pv . ?pv <pred:date> \"1789-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the foundation with the official website https://www.apache.org established on 1999-06-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.apache.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://www.apache.org\" . ?e <inception> ?pv . ?pv <pred:date> \"1999-06-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "When was the campus with ISNI 0000 0001 2150 6738 established?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"campus\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 2150 6738\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 2150 6738\" . ?e <inception> ?pv . ?pv <pred:date> \"1893-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a facility with an ARCHON code of 345 and an inception date of 1824-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"facility\" . ?e <ARCHON_code> ?pv_1 . ?pv_1 <pred:value> \"345\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ARCHON_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"345\" . ?e <inception> ?pv . ?pv <pred:date> \"1824-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a manifestation with 107.0 number of constituencies and an inception date of 1867-07-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <number_of_constituencies> ?pv_1 . ?pv_1 <pred:value> \"107.0\" . [ <pred:fact_h> ?e ; <pred:fact_r> <number_of_constituencies> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"107.0\" . ?e <inception> ?pv . ?pv <pred:date> \"1867-07-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is the band with ISNI 0000 0001 1089 9660's inception date 1969-01-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"band\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0001 1089 9660\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0001 1089 9660\" . ?e <inception> ?pv . ?pv <pred:date> \"1969-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the airline with the IATA airline designator \"UA\" start operating on April 6, 1926?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"airline\" . ?e <IATA_airline_designator> ?pv_1 . ?pv_1 <pred:value> \"UA\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IATA_airline_designator> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"UA\" . ?e <work_period_(start)> ?pv . ?pv <pred:date> \"1926-04-06\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a disco genre subreddit in English called italodisco that was created on January 1, 1978?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"disco\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"italodisco\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"English\" . ?e <inception> ?pv . ?pv <pred:date> \"1978-01-01\"^^xsd:date .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there an organization that was dissolved on 2012-03-01 and had 500 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"organization\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2012-03-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a democracy with an inception date of 1822-01-07 and a Human Development Index of 0.424?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"democracy\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-07\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.424\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was the medal, which was established on 1862-07-12 and has a quantity of 3493.0, created?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"medal\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1862-07-12\"^^xsd:date . ?e <quantity> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3493.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the activity with an end time of 2008-07-27 and 145 participants have only 1 participant?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"activity\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2008-07-27\"^^xsd:date . ?e <number_of_participants> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"145.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a town with an inception date of 1566-01-01 and a population of 6444.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"town\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1566-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6444.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the anime with a publication date of 2008-01-01 and 13.0 episodes exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anime\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2008-01-01\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"13.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an island with an inception date of 1898-01-01 and a population of 133,553?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"island\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1898-01-01\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"133553.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a metropolis with an inception date of May 17, 1642 and a population of 1,649,520?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1642-05-17\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.64952e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the war, which ended on 1918-11-11 and had a number of deaths equal to 1.7e+07, have a duration of 1 unit?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"war\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1918-11-11\"^^xsd:date . ?e <number_of_deaths> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.7e+07\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a capital city with an inception date of 1571-06-24 and an electorate of 959581?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"capital\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1571-06-24\"^^xsd:date . ?e <electorate> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"959581.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there an agent that was dissolved, abolished, or demolished on 2012-03-01 and had 500 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2012-03-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a country that was established on December 15, 1954 and has a Human Development Index of 0.909?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"country\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1954-12-15\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.909\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a college that was established on January 1, 1824 and has 1628 students?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"college\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1824-01-01\"^^xsd:date . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1628.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an anthology with a publication date of 1960-04-11 and a number of pages equal to 218.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"anthology\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-04-11\"^^xsd:date . ?e <number_of_pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a song with a publication date of 1991-12-30 and a beats per minute of 90.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"song\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1991-12-30\"^^xsd:date . ?e <beats_per_minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"90.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the miniseries, which ended on 1986-12-21 and has 1 episode with a rating of 6.0, have an official website?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"miniseries\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1986-12-21\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"6.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the comedy show, which ended on 1992-05-09 and has 180.0 episodes, have a unit of 1?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"comedy\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"1992-05-09\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"180.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an army that was established on 1947-08-15 and has 1,129,900 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-08-15\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1299e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a cemetery that was established on January 1, 1825 and has 20,000 graves?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"cemetery\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e <number_of_graves> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"20000.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the film with a publication date of 2005-11-06 have a box office of 8.96911e+08?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"film\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2005-11-06\"^^xsd:date . ?e <box_office> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"8.96911e+08\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a newscast that had its first performance on January 14, 1952 and has 66 seasons?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"newscast\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a state with an inception date of 1991-08-27 and a Human Development Index of 0.649?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-27\"^^xsd:date . ?e <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.649\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the genre, published on 1960-04-11 and with 218.0 pages, exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"genre\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1960-04-11\"^^xsd:date . ?e <number_of_pages> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"218.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a single with a publication date of 2007-11-06 and a beats per minute of 72.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"single\" . ?e <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2007-11-06\"^^xsd:date . ?e <beats_per_minute> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"72.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Was there a business that had 500 employees and was dissolved on 2012-03-01?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"business\" . ?e <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"2012-03-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"500.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a school with an inception date of 1881-01-01 and a student count of 4962?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"school\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1881-01-01\"^^xsd:date . ?e <students_count> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"4962.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Did the industry end on 2014-12-18 and have 1447 episodes?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"industry\" . ?e <end_time> ?pv_1 . ?pv_1 <pred:date> \"2014-12-18\"^^xsd:date . ?e <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1447.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the award, which was established on 1983-01-01 and has 441290.0 visitors per year, exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1983-01-01\"^^xsd:date . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"441290.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the museum, which officially opened on 1819-11-19 and has 2.69667e+06 visitors per year, exist?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"museum\" . ?e <date_of_official_opening> ?pv_1 . ?pv_1 <pred:date> \"1819-11-19\"^^xsd:date . ?e <visitors_per_year> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.69667e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Does the person born on 1899-05-10 have 2 children?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"human\" . ?e <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1899-05-10\"^^xsd:date . ?e <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a conservatory that was established on September 20, 1862 and has 75 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"conservatory\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1862-09-20\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"75.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there an association that was established on 1768-01-01 and has 80.0 employees?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"association\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1768-01-01\"^^xsd:date . ?e <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"80.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a news with a date of first performance on 1952-01-14 and has 66.0 seasons?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1952-01-14\"^^xsd:date . ?e <number_of_seasons> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a city that was established on 1810-09-25 and has a population of 2.39487e+06?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"city\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1810-09-25\"^^xsd:date . ?e <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.39487e+06\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Is there a software that was created on 1997-09-15 and has an Alexa rank of 1.0?", "sparql": "ASK { ?e <pred:instance_of> ?c . ?c <pred:name> \"software\" . ?e <inception> ?pv_1 . ?pv_1 <pred:date> \"1997-09-15\"^^xsd:date . ?e <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]