[{"question": "What is the connection between Sudan (the one with a Human Development Index of 0.477) and Sudan (the one with an inception date of 1956-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Sudan\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.477\"^^xsd:double . ?e_2 <pred:name> \"Sudan\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Birmingham (the one with a population of 1.1371e+06) and Birmingham (the one with an inception date of 1974-04-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Birmingham\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.1371e+06\"^^xsd:double . ?e_2 <pred:name> \"Birmingham\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-04-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Comoros (the one with a Human Development Index of 0.499) and Comoros (the one with an inception date of 1975-07-06)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Comoros\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.499\"^^xsd:double . ?e_2 <pred:name> \"Comoros\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-07-06\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guatemala (the one with a Human Development Index of 0.455) and Guatemala (the one with an inception date of 1821-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guatemala\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.455\"^^xsd:double . ?e_2 <pred:name> \"Guatemala\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1821-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Rwanda (the one with a Human Development Index of 0.479) and Rwanda (the one with an inception date of 1962-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Rwanda\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.479\"^^xsd:double . ?e_2 <pred:name> \"Rwanda\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1962-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ghana (the one with a Human Development Index of 0.427) and Ghana (the one with an inception date of 1957-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ghana\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.427\"^^xsd:double . ?e_2 <pred:name> \"Ghana\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1957-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Latvia (the one with a Human Development Index of 0.806) and Latvia (whose inception date is 1918-11-18)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Latvia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.806\"^^xsd:double . ?e_2 <pred:name> \"Latvia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-11-18\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Morocco (the one with a Human Development Index of 0.488) and Morocco (the one with an inception date of 1956-04-07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Morocco\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.488\"^^xsd:double . ?e_2 <pred:name> \"Morocco\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-04-07\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Chad (the one with a Human Development Index of 0.338) and Chad (the one with an inception date of 1960-08-11)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Chad\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.338\"^^xsd:double . ?e_2 <pred:name> \"Chad\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-08-11\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Suriname (the one with a Human Development Index of 0.714) and Suriname (the one with an inception date of 1975-11-25)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Suriname\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.714\"^^xsd:double . ?e_2 <pred:name> \"Suriname\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-11-25\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Tunisia (the one with a Human Development Index of 0.721) and Tunisia (the one with an inception date of 1956-03-20)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Tunisia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.721\"^^xsd:double . ?e_2 <pred:name> \"Tunisia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1956-03-20\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Turkey (the one with a Human Development Index of 0.751) and Turkey (the one with an inception date of 1923-10-29)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Turkey\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.751\"^^xsd:double . ?e_2 <pred:name> \"Turkey\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1923-10-29\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Belarus (the one with a Human Development Index of 0.796) and Belarus (the one with an inception date of 1991-08-25)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Belarus\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.796\"^^xsd:double . ?e_2 <pred:name> \"Belarus\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-25\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Odessa (the one with a population of 99940.0) and Odessa (the one with an inception date of 1794-09-02)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Odessa\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"99940.0\"^^xsd:double . ?e_2 <pred:name> \"Odessa\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1794-09-02\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Egypt (the one with a Human Development Index of 0.583) and Egypt (the one with an inception date of 1953-06-18)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Egypt\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.583\"^^xsd:double . ?e_2 <pred:name> \"Egypt\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1953-06-18\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mali (the one with a Human Development Index of 0.199) and Mali (the one with an inception date of 1960-09-22)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mali\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.199\"^^xsd:double . ?e_2 <pred:name> \"Mali\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-09-22\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Liberia (the one with a Human Development Index of 0.424) and Liberia (the one with an inception date of 1822-01-07)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Liberia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.424\"^^xsd:double . ?e_2 <pred:name> \"Liberia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1822-01-07\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Fargo (the one with 30.0 episodes) and Fargo (the one published on 1996-05-28)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fargo\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"30.0\"^^xsd:double . ?e_2 <pred:name> \"Fargo\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1996-05-28\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Paraguay (the one whose Human Development Index is 0.551) and Paraguay (the one whose inception date is 1811-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Paraguay\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.551\"^^xsd:double . ?e_2 <pred:name> \"Paraguay\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1811-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Shrek (the one with 3.0 children) and Shrek (the one with a publication date of 2001-04-22)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Shrek\" . ?e_1 <number_of_children> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"3.0\"^^xsd:double . ?e_2 <pred:name> \"Shrek\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2001-04-22\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the TV show Dynasty (which has 22 episodes) and its date of first performance (which is January 12, 1981)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dynasty\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"22.0\"^^xsd:double . ?e_2 <pred:name> \"Dynasty\" . ?e_2 <date_of_first_performance> ?pv_1 . ?pv_1 <pred:date> \"1981-01-12\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the TV show Limitless (which has 22 episodes) and its publication date (which is 2011-04-14)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Limitless\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"22.0\"^^xsd:double . ?e_2 <pred:name> \"Limitless\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"2011-04-14\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Libya (the one with a Human Development Index of 0.657) and Libya (the one with an inception date of 1951-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Libya\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.657\"^^xsd:double . ?e_2 <pred:name> \"Libya\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1951-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Ukraine (the one with a Human Development Index of 0.705) and Ukraine (the one with an inception date of 1991-08-24)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Ukraine\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.705\"^^xsd:double . ?e_2 <pred:name> \"Ukraine\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-24\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Saxony-Anhalt (the one with a population of 2.24547e+06) and Saxony-Anhalt (the one with an inception date of 1947-02-25)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Saxony-Anhalt\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"2.24547e+06\"^^xsd:double . ?e_2 <pred:name> \"Saxony-Anhalt\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1947-02-25\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mozambique (the one whose Human Development Index is 0.218) and Mozambique (the one whose inception date is 1975-06-25)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mozambique\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.218\"^^xsd:double . ?e_2 <pred:name> \"Mozambique\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1975-06-25\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between the TV show \"Eve\" (which has 66 episodes) and the person named Eve (who was born on 1978-11-10)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Eve\" . ?e_1 <number_of_episodes> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"66.0\"^^xsd:double . ?e_2 <pred:name> \"Eve\" . ?e_2 <date_of_birth> ?pv_1 . ?pv_1 <pred:date> \"1978-11-10\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Mauritius (the one with a Human Development Index of 0.674) and Mauritius (the one with an inception date of 1968-03-12)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Mauritius\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.674\"^^xsd:double . ?e_2 <pred:name> \"Mauritius\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-03-12\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Moldova (the one with a Human Development Index of 0.649) and Moldova (the one with an inception date of 1991-08-27)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Moldova\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.649\"^^xsd:double . ?e_2 <pred:name> \"Moldova\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1991-08-27\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Nauru (the one with a population of 10084.0) and Nauru (the one with an inception date of 1968-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Nauru\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"10084.0\"^^xsd:double . ?e_2 <pred:name> \"Nauru\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1968-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Joseon (the one with a population of 1.3e+07) and Joseon (the one dissolved, abolished, or demolished on 1897-10-12)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Joseon\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.3e+07\"^^xsd:double . ?e_2 <pred:name> \"Joseon\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1897-10-12\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Belgium (the one with a Human Development Index of 0.755) and Belgium (the one with an inception date of 1830-10-04)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Belgium\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.755\"^^xsd:double . ?e_2 <pred:name> \"Belgium\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1830-10-04\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Austria (the one with a Human Development Index of 0.853) and Austria (the one with an inception date of 1918-11-12)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Austria\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.853\"^^xsd:double . ?e_2 <pred:name> \"Austria\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-11-12\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Italy (the one with a Human Development Index of 0.829) and Italy (the one with an inception date of 1946-06-02)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Italy\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.829\"^^xsd:double . ?e_2 <pred:name> \"Italy\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1946-06-02\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Uruguay (the one with a Human Development Index of 0.784) and Uruguay (the one with an inception date of 1825-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Uruguay\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.784\"^^xsd:double . ?e_2 <pred:name> \"Uruguay\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1825-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Finland (the one with a Human Development Index of 0.869) and Finland (the one with an inception date of 1917-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Finland\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.869\"^^xsd:double . ?e_2 <pred:name> \"Finland\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1917-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guernsey (the one with a population of 65345.0) and Guernsey (the one with an inception date of 1204-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guernsey\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"65345.0\"^^xsd:double . ?e_2 <pred:name> \"Guernsey\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1204-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Bahrain (with a Human Development Index of 0.821) and Bahrain (which was established on 1971-08-14)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Bahrain\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.821\"^^xsd:double . ?e_2 <pred:name> \"Bahrain\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1971-08-14\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Indonesia (with a Human Development Index of 0.671) and Indonesia (which was established on 1945-08-17)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Indonesia\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.671\"^^xsd:double . ?e_2 <pred:name> \"Indonesia\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1945-08-17\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Argentina (the one with a Human Development Index of 0.725) and Argentina (the one with an inception date of 1816-07-09)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Argentina\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.725\"^^xsd:double . ?e_2 <pred:name> \"Argentina\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1816-07-09\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Fiji (the one with a Human Development Index of 0.722) and Fiji (the one with an inception date of 1970-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Fiji\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.722\"^^xsd:double . ?e_2 <pred:name> \"Fiji\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1970-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Google (the one with an Alexa rank of 1.0) and Google (the one with an inception date of 1998-09-04)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Google\" . ?e_1 <Alexa_rank> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.0\"^^xsd:double . ?e_2 <pred:name> \"Google\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1998-09-04\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Microsoft (the one with 127104.0 employees) and Microsoft (the one with an inception date of 1992-09-18)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Microsoft\" . ?e_1 <employees> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"127104.0\"^^xsd:double . ?e_2 <pred:name> \"Microsoft\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1992-09-18\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Spain (the one with a Human Development Index of 0.87) and Spain (the one with an inception date of 1812-03-19)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Spain\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.87\"^^xsd:double . ?e_2 <pred:name> \"Spain\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1812-03-19\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Togo (the one with a Human Development Index of 0.459) and Togo (the one with an inception date of 1960-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Togo\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.459\"^^xsd:double . ?e_2 <pred:name> \"Togo\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1960-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Dominica (the one with a Human Development Index of 0.723) and Dominica (the one with an inception date of 1978-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Dominica\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.723\"^^xsd:double . ?e_2 <pred:name> \"Dominica\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1978-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Barbados (the one with a Human Development Index of 0.785) and Barbados (the one with an inception date of 1966-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Barbados\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.785\"^^xsd:double . ?e_2 <pred:name> \"Barbados\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1966-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Guinea-Bissau (the one whose Human Development Index is 0.418) and Guinea-Bissau (the one whose inception date is 1974-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Guinea-Bissau\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.418\"^^xsd:double . ?e_2 <pred:name> \"Guinea-Bissau\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1974-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Poland (the one with a Human Development Index of 0.833) and Poland (the one with an inception date of 1918-11-11)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Poland\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.833\"^^xsd:double . ?e_2 <pred:name> \"Poland\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1918-11-11\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Athens (the one with a population of 664046.0) and Athens (the one with an inception date of 1806-01-01)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Athens\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"664046.0\"^^xsd:double . ?e_2 <pred:name> \"Athens\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1806-01-01\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Oman (the one with a Human Development Index of 0.793) and Oman (the one with an inception date of 1970-07-23)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Oman\" . ?e_1 <Human_Development_Index> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"0.793\"^^xsd:double . ?e_2 <pred:name> \"Oman\" . ?e_2 <inception> ?pv_1 . ?pv_1 <pred:date> \"1970-07-23\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Austria-Hungary (the one with a population of 5.28e+07) and Austria-Hungary (the one dissolved, abolished, or demolished on 1918-10-28)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Austria-Hungary\" . ?e_1 <population> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"5.28e+07\"^^xsd:double . ?e_2 <pred:name> \"Austria-Hungary\" . ?e_2 <dissolved,_abolished_or_demolished> ?pv_1 . ?pv_1 <pred:date> \"1918-10-28\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the connection between Cinderella (the one with an attendance of 1.35985e+06) and Cinderella (the one with a publication date of 1950-02-15)?", "sparql": "SELECT DISTINCT ?p WHERE { ?e_1 <pred:name> \"Cinderella\" . ?e_1 <attendance> ?pv . ?pv <pred:unit> \"1\" . ?pv <pred:value> \"1.35985e+06\"^^xsd:double . ?e_2 <pred:name> \"Cinderella\" . ?e_2 <publication_date> ?pv_1 . ?pv_1 <pred:date> \"1950-02-15\"^^xsd:date . ?e_1 ?p ?e_2 .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]