[{"question": "Which horse has a native label of \"Northern Dancer\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"horse\" . ?e <native_label> ?pv . ?pv <pred:value> \"Northern Dancer\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Northern Dancer\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Northern Dancer\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which businessperson has an Iconclass notation of 46A613?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"businessperson\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"46A613\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"46A613\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"46A613\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified under \"Protestantism\" and has a Library of Congress Classification of \"BR1644-1644.7\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"Protestantism\" . ?e <Library_of_Congress_Classification> ?pv . ?pv <pred:value> \"BR1644-1644.7\" . ?e <Library_of_Congress_Classification> ?pv_1 . ?pv_1 <pred:value> \"BR1644-1644.7\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Library_of_Congress_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"BR1644-1644.7\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which physician has a short name of M.D.?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"physician\" . ?e <short_name> ?pv . ?pv <pred:value> \"M.D.\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"M.D.\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"M.D.\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which republic has a British Museum person-institution value of 180889?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"republic\" . ?e <British_Museum_person-institution> ?pv . ?pv <pred:value> \"180889\" . ?e <British_Museum_person-institution> ?pv_1 . ?pv_1 <pred:value> \"180889\" . [ <pred:fact_h> ?e ; <pred:fact_r> <British_Museum_person-institution> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"180889\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is related to the medicine category and has an OSM tag or key of \"Tag:healthcare:speciality=internal\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"medicine\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:healthcare:speciality=internal\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:healthcare:speciality=internal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Tag:healthcare:speciality=internal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which group has an OSM tag or key of \"Tag:generator:source=wind\" and a short name of \"\u0412\u042d\u0421\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"group\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:generator:source=wind\" . ?e <short_name> ?pv_1 . ?pv_1 <pred:value> \"\u0412\u042d\u0421\" . [ <pred:fact_h> ?e ; <pred:fact_r> <short_name> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"\u0412\u042d\u0421\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which minister has an official website of \"https://www.treasury.gov/about/Pages/Secretary.aspx\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"minister\" . ?e <official_website> ?pv . ?pv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://www.treasury.gov/about/Pages/Secretary.aspx\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which marketing entity has a RIA Novosti reference of 61684885 and an official website of http://www.boeing.com/boeing/commercial/737family/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"marketing\" . ?e <RIA_Novosti_reference> ?pv . ?pv <pred:value> \"61684885\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.boeing.com/boeing/commercial/737family/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.boeing.com/boeing/commercial/737family/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which musical has the official website http://aladdinthemusical.com?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"musical\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://aladdinthemusical.com\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://aladdinthemusical.com\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://aladdinthemusical.com\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which army has an ISNI of 0000 0004 0498 1870?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"army\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 0498 1870\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0004 0498 1870\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0004 0498 1870\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as \"interdisciplinarity\" with a Classification_of_Instructional_Programs_code of 05.0207?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"interdisciplinarity\" . ?e <Classification_of_Instructional_Programs_code> ?pv . ?pv <pred:value> \"05.0207\" . ?e <Classification_of_Instructional_Programs_code> ?pv_1 . ?pv_1 <pred:value> \"05.0207\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Classification_of_Instructional_Programs_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"05.0207\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which foundation has an ACM Classification Code (2012) of 10011263 and an official website of https://www.apache.org?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"foundation\" . ?e <ACM_Classification_Code_(2012)> ?pv . ?pv <pred:value> \"10011263\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"https://www.apache.org\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"https://www.apache.org\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which news has an Instagram username of \"todayshow\" and also has an Instagram username of \"todayshow\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"news\" . ?e <Instagram_username> ?pv . ?pv <pred:value> \"todayshow\" . ?e <Instagram_username> ?pv_1 . ?pv_1 <pred:value> \"todayshow\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Instagram_username> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"todayshow\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has a RIA_Novosti_reference of 55428295?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"suicide\" . ?e <RIA_Novosti_reference> ?pv . ?pv <pred:value> \"55428295\" . ?e <RIA_Novosti_reference> ?pv_1 . ?pv_1 <pred:value> \"55428295\" . [ <pred:fact_h> ?e ; <pred:fact_r> <RIA_Novosti_reference> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"55428295\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with both Iconclass notations 95 and 94 in the context of folklore?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"folklore\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"95\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"94\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"94\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which lawyer has an ISCO occupation code of 2421 and an Iconclass notation of 44G161?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"lawyer\" . ?e <ISCO_occupation_code> ?pv . ?pv <pred:value> \"2421\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"44G161\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"44G161\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which manifestation has an official website of \"http://www.timeshighereducation.co.uk/world-university-rankings/\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"manifestation\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.timeshighereducation.co.uk/world-university-rankings/\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.timeshighereducation.co.uk/world-university-rankings/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.timeshighereducation.co.uk/world-university-rankings/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which method has an IPTC Newscode of mediatopic/20000037 and an Iconclass notation of 48C2?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"method\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000037\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"48C2\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"48C2\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a pome and has a Dewey Decimal Classification of 634.11?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"pome\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"634.11\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"634.11\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"634.11\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which empire has the OSM tag or key \"Tag:historic:civilization=byzantine\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"empire\" . ?e <OSM_tag_or_key> ?pv . ?pv <pred:value> \"Tag:historic:civilization=byzantine\" . ?e <OSM_tag_or_key> ?pv_1 . ?pv_1 <pred:value> \"Tag:historic:civilization=byzantine\" . [ <pred:fact_h> ?e ; <pred:fact_r> <OSM_tag_or_key> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Tag:historic:civilization=byzantine\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which initialism has a Dewey Decimal Classification of 306.7663 and is associated with the subreddit \"lesbians\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"initialism\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"306.7663\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"lesbians\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"lesbians\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which event has the official name \"National Basketball Association World Championship Series\" and also has the official name \"Basketball Association of America World Championship Series\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"final\" . ?e <official_name> ?pv . ?pv <pred:value> \"National Basketball Association World Championship Series\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Basketball Association of America World Championship Series\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"Basketball Association of America World Championship Series\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which award has an official website of http://www.whiting.org/awards/?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"award\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.whiting.org/awards/\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.whiting.org/awards/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.whiting.org/awards/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has an IAB code of 69 for equity?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"equity\" . ?e <IAB_code> ?pv . ?pv <pred:value> \"69\" . ?e <IAB_code> ?pv_1 . ?pv_1 <pred:value> \"69\" . [ <pred:fact_h> ?e ; <pred:fact_r> <IAB_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"69\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which metropolis has a Dewey Decimal Classification of 2--71428?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"metropolis\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"2--71428\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"2--71428\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"2--71428\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which university has an ISNI of 0000 0004 1936 8286 and also has an ISNI of 0000 0000 8596 9494?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"university\" . ?e <ISNI> ?pv . ?pv <pred:value> \"0000 0004 1936 8286\" . ?e <ISNI> ?pv_1 . ?pv_1 <pred:value> \"0000 0000 8596 9494\" . [ <pred:fact_h> ?e ; <pred:fact_r> <ISNI> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"0000 0000 8596 9494\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a guitar according to the Hornbostel-Sachs classification code 321.322?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"guitar\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"321.322\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has the Glottolog code \"aust1298\" for the language English?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"English\" . ?e <Glottolog_code> ?pv . ?pv <pred:value> \"aust1298\" . ?e <Glottolog_code> ?pv_1 . ?pv_1 <pred:value> \"aust1298\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Glottolog_code> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"aust1298\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which agent has an official website of \"http://www.cammell-laird.com/\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"agent\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.cammell-laird.com/\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cammell-laird.com/\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.cammell-laird.com/\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with the subreddit \"RootsReggae\" in the category \"reggae\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"reggae\" . ?e <subreddit> ?pv . ?pv <pred:value> \"RootsReggae\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"RootsReggae\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"RootsReggae\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which state has an IPTC Newscode of mediatopic/20000801 and a pronunciation audio file named LL-Q5146 (por)-NMaia-pobreza.wav in Portuguese?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"state\" . ?e <IPTC_Newscode> ?pv . ?pv <pred:value> \"mediatopic/20000801\" . ?e <pronunciation_audio> ?pv_1 . ?pv_1 <pred:value> \"LL-Q5146 (por)-NMaia-pobreza.wav\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pronunciation_audio> ; <pred:fact_t> ?pv_1 ] <language_of_work_or_name> ?qpv . ?qpv <pred:value> \"Portuguese\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which art has a Dewey Decimal Classification of 820?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"art\" . ?e <Dewey_Decimal_Classification> ?pv . ?pv <pred:value> \"820\" . ?e <Dewey_Decimal_Classification> ?pv_1 . ?pv_1 <pred:value> \"820\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Dewey_Decimal_Classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"820\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entertainment has an official website of http://www.nintendo.co.jp/wii/rwsj/index.html?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"entertainment\" . ?e <official_website> ?pv . ?pv <pred:value> \"http://www.nintendo.co.jp/wii/rwsj/index.html\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.nintendo.co.jp/wii/rwsj/index.html\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_website> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"http://www.nintendo.co.jp/wii/rwsj/index.html\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which profession has a SOC Code (2010) of 11-1021?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"profession\" . ?e <SOC_Code_(2010)> ?pv . ?pv <pred:value> \"11-1021\" . ?e <SOC_Code_(2010)> ?pv_1 . ?pv_1 <pred:value> \"11-1021\" . [ <pred:fact_h> ?e ; <pred:fact_r> <SOC_Code_(2010)> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"11-1021\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is associated with both the subreddit \"techno\" and the subreddit \"minimal\"?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"techno\" . ?e <subreddit> ?pv . ?pv <pred:value> \"minimal\" . ?e <subreddit> ?pv_1 . ?pv_1 <pred:value> \"minimal\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"minimal\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity has the position with Iconclass notation 44B151211?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"position\" . ?e <Iconclass_notation> ?pv . ?pv <pred:value> \"44B151211\" . ?e <Iconclass_notation> ?pv_1 . ?pv_1 <pred:value> \"44B151211\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Iconclass_notation> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"44B151211\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "Which entity is classified as a violin and has a Hornbostel-Sachs classification of 321.322-71?", "sparql": "SELECT DISTINCT ?e WHERE { ?e <pred:instance_of> ?c . ?c <pred:name> \"violin\" . ?e <Hornbostel-Sachs_classification> ?pv . ?pv <pred:value> \"321.322-71\" . ?e <Hornbostel-Sachs_classification> ?pv_1 . ?pv_1 <pred:value> \"321.322-71\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Hornbostel-Sachs_classification> ; <pred:fact_t> ?pv_1 ] <pred:fact_t> ?qpv . ?qpv <pred:value> \"321.322-71\" .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the OCLC control number for the book titled \"Atonement\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Atonement\" . ?e <OCLC_control_number> ?pv_1 . ?pv_1 <pred:value> \"248628819\" . ?e <title> ?pv . ?pv <pred:value> \"Atonement\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label for Afrikaans?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Afrikaans\" . ?e <native_label> ?pv_1 . ?pv_1 <pred:value> \"Afrikaans\" . ?e <native_label> ?pv . ?pv <pred:value> \"Afrikaans\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the game with the Nintendo GameID GYRP41?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"TMNT\" . ?e <Nintendo_GameID> ?pv_1 . ?pv_1 <pred:value> \"GYRP41\" . ?e <title> ?pv . ?pv <pred:value> \"TMNT\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of Reading?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Reading\" . ?e <official_name> ?pv_1 . ?pv_1 <pred:value> \"Reading\" . ?e <official_name> ?pv . ?pv <pred:value> \"Reading\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Limitless?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Limitless\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Limitless\" . ?e <title> ?pv . ?pv <pred:value> \"Limitless\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Singapore?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Singapore\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Singapore\" . ?e <title> ?pv . ?pv <pred:value> \"Singapore\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named Rebecca?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Rebecca\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Rebecca\" . ?e <title> ?pv . ?pv <pred:value> \"Rebecca\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "How many subscribers does Madonna have on Twitter (the one whose CANTIC-ID is a12355859)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Madonna\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a12355859\" . ?e <Twitter_username> ?pv . ?pv <pred:value> \"Madonna\" . [ <pred:fact_h> ?e ; <pred:fact_r> <Twitter_username> ; <pred:fact_t> ?pv ] <number_of_subscribers> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the entity named \"Bangor\"?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Bangor\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Bangor\" . ?e <title> ?pv . ?pv <pred:value> \"Bangor\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of the movie Sliver?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Sliver\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Sliver\" . ?e <title> ?pv . ?pv <pred:value> \"Sliver\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the language of work or name for the subreddit Wyoming (the one whose CANTIC-ID is a1144938x)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Wyoming\" . ?e <CANTIC-ID> ?pv_1 . ?pv_1 <pred:value> \"a1144938x\" . ?e <subreddit> ?pv . ?pv <pred:value> \"Wyoming\" . [ <pred:fact_h> ?e ; <pred:fact_r> <subreddit> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the title of Milan?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Milan\" . ?e <title> ?pv_1 . ?pv_1 <pred:value> \"Milan\" . ?e <title> ?pv . ?pv <pred:value> \"Milan\" . [ <pred:fact_h> ?e ; <pred:fact_r> <title> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the native label of Nottingham (the one whose local dialing code is 0115)?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Nottingham\" . ?e <local_dialing_code> ?pv_1 . ?pv_1 <pred:value> \"0115\" . ?e <native_label> ?pv . ?pv <pred:value> \"Nottingham\" . [ <pred:fact_h> ?e ; <pred:fact_r> <native_label> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What language pertains to the pseudonym Adele regarding the person with the Libris-URI c9ps010w4p2txl7?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Adele\" . ?e <Libris-URI> ?pv_1 . ?pv_1 <pred:value> \"c9ps010w4p2txl7\" . ?e <pseudonym> ?pv . ?pv <pred:value> \"Adele\" . [ <pred:fact_h> ?e ; <pred:fact_r> <pseudonym> ; <pred:fact_t> ?pv ] <language_of_work_or_name> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}, {"question": "What is the official name of the city with the official website http://www.cityofboise.org/?", "sparql": "SELECT DISTINCT ?qpv WHERE { ?e <pred:name> \"Boise\" . ?e <official_website> ?pv_1 . ?pv_1 <pred:value> \"http://www.cityofboise.org/\" . ?e <official_name> ?pv . ?pv <pred:value> \"Boise\" . [ <pred:fact_h> ?e ; <pred:fact_r> <official_name> ; <pred:fact_t> ?pv ] <pred:fact_h> ?qpv .  }", "choices": ["unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown", "unknown"], "answer": "unknown"}]